esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AHB_DMA</name>
      <description>AHB_DMA Peripheral</description>
      <groupName>AHB_DMA</groupName>
      <baseAddress>0x50085000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2f0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AHB_PDMA_IN_CH0</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_IN_CH1</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_IN_CH2</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH0</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH1</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>AHB_PDMA_OUT_CH2</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>AXI_PDMA_IN_CH0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>AXI_PDMA_IN_CH1</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>AXI_PDMA_IN_CH2</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>AXI_PDMA_OUT_CH0</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>AXI_PDMA_OUT_CH1</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>AXI_PDMA_OUT_CH2</name>
        <value>67</value>
      </interrupt>
      <registers>
        <register>
          <name>IN_INT_RAW_CH0</name>
          <description>Raw interrupt status of RX channel 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ST_CH0</name>
          <description>Masked interrupt status of RX channel 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ENA_CH0</name>
          <description>Interrupt enable bits of RX channel 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_CLR_CH0</name>
          <description>Interrupt clear bits of RX channel 0</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH0_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_RAW_CH1</name>
          <description>Raw interrupt status of RX channel 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ST_CH1</name>
          <description>Masked interrupt status of RX channel 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ENA_CH1</name>
          <description>Interrupt enable bits of RX channel 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_CLR_CH1</name>
          <description>Interrupt clear bits of RX channel 1</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH1_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
