esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>IN_INT_RAW_CH2</name>
          <description>Raw interrupt status of RX channel 2</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH2_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ST_CH2</name>
          <description>Masked interrupt status of RX channel 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH2_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_ENA_CH2</name>
          <description>Interrupt enable bits of RX channel 2</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH2_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_INT_CLR_CH2</name>
          <description>Interrupt clear bits of RX channel 2</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_SUC_EOF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_ERR_EOF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_ERR_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_DSCR_EMPTY_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_OVF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INFIFO_UDF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IN_AHBINF_RESP_ERR_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH2_INT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_RAW_CH0</name>
          <description>//Raw interrupt status of TX channel 0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH0_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_ST_CH0</name>
          <description>Masked interrupt status of TX channel 0</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH0_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_ENA_CH0</name>
          <description>Interrupt enable bits of TX channel 0</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH0_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_CLR_CH0</name>
          <description>Interrupt clear bits of TX channel 0</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DONE_CH0_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_EOF_CH0_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH0_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH0_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH0_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH0_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH0_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH0_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_RAW_CH1</name>
          <description>//Raw interrupt status of TX channel 1</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH1_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
