esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>OUT_INT_ST_CH1</name>
          <description>Masked interrupt status of TX channel 1</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH1_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_ENA_CH1</name>
          <description>Interrupt enable bits of TX channel 1</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH1_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_CLR_CH1</name>
          <description>Interrupt clear bits of TX channel 1</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DONE_CH1_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_EOF_CH1_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH1_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH1_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH1_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH1_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH1_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH1_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_RAW_CH2</name>
          <description>//Raw interrupt status of TX channel 2</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH2_INT_RAW</name>
              <description>The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_ST_CH2</name>
          <description>Masked interrupt status of TX channel 2</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH2_INT_ST</name>
              <description>The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_ENA_CH2</name>
          <description>Interrupt enable bits of TX channel 2</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH2_INT_ENA</name>
              <description>Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_INT_CLR_CH2</name>
          <description>Interrupt clear bits of TX channel 2</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DONE_CH2_INT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_EOF_CH2_INT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH2_INT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH2_INT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH2_INT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH2_INT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_AHBINF_RESP_ERR_CH2_INT_CLR</name>
              <description>Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH2_INT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_TEST</name>
          <description>only for test</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHB_TESTMODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_TESTADDR</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF</name>
          <description>reserved</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHBM_RST_INTER</name>
              <description>Write 1 and then 0 to reset the internal AHB FSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_PRI_DIS</name>
              <description>Configures whether to disable the fixed-priority channel arbitration.\\0: Enable\\1: Disable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures clock gating.\\0: Support clock only when the application writes registers.\\ 1: Always force the clock on for registers.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x250220</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_CONF0_CH0</name>
          <description>Configuration register 0 of RX channel 0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <name>IN_RST_CH0</name>
              <description>Write 1 and then 0 to reset AHB_DMA channel 0 RX FSM and RX FIFO pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_LOOP_TEST_CH0</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDSCR_BURST_EN_CH0</name>
              <description>Configures whether to enable INCR burst transfer for RX channel 0 to read descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DATA_BURST_EN_CH0</name>
              <description>Set this bit to 1 to enable INCR4 burst transfer for Rx channel 0 receiving data when accessing internal SRAM.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_TRANS_EN_CH0</name>
              <description>Configures whether to enable memory-to-memory data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ETM_EN_CH0</name>
              <description>Configures whether to enable ETM control for RX channel0.\\0: Disable\\1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DATA_BURST_MODE_SEL_CH0</name>
              <description>Configures max burst size for Rx channel0.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_CONF1_CH0</name>
          <description>Configuration register 1 of RX channel 0</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_CHECK_OWNER_CH0</name>
              <description>Configures whether to enable owner bit check for RX channel 0.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
