esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>OUT_CONF0_CH2</name>
          <description>Configuration register 0 of TX channel 2</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0x108</resetValue>
          <fields>
            <field>
              <name>OUT_RST_CH2</name>
              <description>Configures the reset state of AHB_DMA channel 2 TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH2</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AUTO_WRBACK_CH2</name>
              <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH2</name>
              <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel 2 is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel 2 is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH2</name>
              <description>Configures whether to enable INCR burst transfer for TX channel 2 reading descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DATA_BURST_EN_CH2</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 2 transmitting data when accessing internal SRAM.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_EN_CH2</name>
              <description>Configures whether to enable ETM control for TX channel 2.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DATA_BURST_MODE_SEL_CH2</name>
              <description>Configures max burst size for TX channel2.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CONF1_CH2</name>
          <description>Configuration register 1 of TX channel 2</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CHECK_OWNER_CH2</name>
              <description>Configures whether to enable owner bit check for TX channel 2.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTFIFO_STATUS_CH2</name>
          <description>Receive FIFO status of RX channel 2</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0x7800002</resetValue>
          <fields>
            <field>
              <name>OUTFIFO_FULL_CH2</name>
              <description>Represents whether L1 TX FIFO is full.\\0: Not Full\\1: Full\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_CH2</name>
              <description>Represents whether L1 TX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_CH2</name>
              <description>Represents the number of data bytes in L1 TX FIFO for TX channel 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_1B_CH2</name>
              <description>reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_2B_CH2</name>
              <description>reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_3B_CH2</name>
              <description>reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_4B_CH2</name>
              <description>reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PUSH_CH2</name>
          <description>Push control register of TX channel 2</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_WDATA_CH2</name>
              <description>Configures whether to push data into AHB_DMA FIFO.\\0: Invalid. No effect\\1: Push\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_PUSH_CH2</name>
              <description>Configures the data that need to be pushed into AHB_DMA FIFO.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_CH2</name>
          <description>Push control register of TX channel 2</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUTLINK_STOP_CH2</name>
              <description>Configures whether to stop AHB_DMA's TX channel 2 from transmitting data.\\0: Invalid. No effect\\1: Stop\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_START_CH2</name>
              <description>Configures whether to enable AHB_DMA's TX channel 2 for data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_RESTART_CH2</name>
              <description>Configures whether to restart TX channel 2 for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_PARK_CH2</name>
              <description>Represents the status of the transmit descriptor's FSM.\\0: Running\\1: Idle\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_STATE_CH2</name>
          <description>Transmit status of TX channel 2</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_ADDR_CH2</name>
              <description>Represents the lower 18 bits of the address of the next transmit descriptor to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_STATE_CH2</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_STATE_CH2</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EOF_DES_ADDR_CH2</name>
          <description>Transmit descriptor address when EOF occurs on TX channel 2</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH2</name>
              <description>Represents the address of the transmit descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EOF_BFR_DES_ADDR_CH2</name>
          <description>The last transmit descriptor address when EOF occurs on TX channel 2</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_BFR_DES_ADDR_CH2</name>
              <description>Represents the address of the transmit descriptor before the last transmit descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_CH2</name>
          <description>Current transmit descriptor address of TX channel 2</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH2</name>
              <description>Represents the address of the next transmit descriptor y+1 pointed by the current transmit descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_BF0_CH2</name>
          <description>The last transmit descriptor address of TX channel 2</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF0_CH2</name>
              <description>Represents the address of the current transmit descriptor y that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_BF1_CH2</name>
          <description>The second-to-last transmit descriptor address of TX channel 2</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF1_CH2</name>
              <description>Represents the address of the previous transmit descriptor y-1 that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PERI_CH2</name>
          <description>Priority register of TX channel 2</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_PRI_CH2</name>
              <description>Configures the priority of TX channel 2.The larger of the value, the higher of the priority..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PERI_SEL_CH2</name>
          <description>Peripheral selection register of TX channel 2</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>PERI_OUT_SEL_CH2</name>
              <description>Configures the peripheral connected to TX channel 2.\\ 0: I3C\\ 1: Dummy\\ 2: UHCI0\\ 3: I2S0\\ 4: I2S1\\ 5: I2S2\\ 6: Dummy\\ 7: Dummy\\ 8: ADC_DAC\\ 9: Dummy\\ 10: RMT\\ 11~15: Dummy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>OUT_CRC_INIT_DATA_CH%s</name>
          <description>This register is used to config ch%s crc initial data(max 32 bit)</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>OUT_CRC_INIT_DATA_CH</name>
              <description>This register is used to config ch0 of tx crc initial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_WIDTH_CH%s</name>
          <description>This register is used to confiig tx ch%s crc result width,2'b00 mean crc_width &lt;=8bit,2'b01 8&lt;crc_width&lt;=16 ,2'b10 mean 16&lt;crc_width  &lt;=24,2'b11 mean 24&lt;crc_width&lt;=32</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_WIDTH_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CRC_LAUTCH_FLGA_CH</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>OUT_CRC_CLEAR_CH%s</name>
          <description>This register is used to clear ch%s crc result</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CRC_CLEAR_CH</name>
              <description>This register is used to clear ch0 of tx crc result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>OUT_CRC_FINAL_RESULT_CH%s</name>
          <description>This register is used to store ch%s crc result</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CRC_FINAL_RESULT_CH</name>
              <description>This register is used to store result ch0 of tx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_EN_WR_DATA_CH%s</name>
          <description>This resister is used to config ch%s crc en for every bit</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_EN_WR_DATA_CH</name>
              <description>This register is used to enable tx ch0 crc 32bit on/off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_EN_ADDR_CH%s</name>
          <description>This register is used to config ch%s crc en addr</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_DATA_EN_WR_DATA_CH%s</name>
          <description>This register is used to config crc data_8bit en</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_DATA_EN_WR_DATA_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>TX_CRC_DATA_EN_ADDR_CH%s</name>
          <description>This register is used to config addr of crc data_8bit en</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CRC_DATA_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CH_ARB_WEIGHT_CH0</name>
          <description>TX channel 0 arbitration weight configuration register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_VALUE_CH0</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ARB_WEIGHT_OPT_DIR_CH0</name>
          <description>TX channel 0 weight arbitration optimization enable register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_OPT_DIS_CH0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CH_ARB_WEIGHT_CH1</name>
          <description>TX channel 1 arbitration weight configuration register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_VALUE_CH1</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ARB_WEIGHT_OPT_DIR_CH1</name>
          <description>TX channel 1 weight arbitration optimization enable register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_OPT_DIS_CH1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CH_ARB_WEIGHT_CH2</name>
          <description>TX channel 2 arbitration weight configuration register</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_VALUE_CH2</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ARB_WEIGHT_OPT_DIR_CH2</name>
          <description>TX channel 2 weight arbitration optimization enable register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGHT_OPT_DIS_CH2</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>IN_CRC_INIT_DATA_CH%s</name>
          <description>This register is used to config ch%s crc initial data(max 32 bit)</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>IN_CRC_INIT_DATA_CH</name>
              <description>This register is used to config ch0 of rx crc initial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
