esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_WIDTH_CH%s</name>
          <description>This register is used to confiig rx ch%s crc result width,2'b00 mean crc_width &lt;=8bit,2'b01 8&lt;crc_width&lt;=16 ,2'b10 mean 16&lt;crc_width  &lt;=24,2'b11 mean 24&lt;crc_width&lt;=32</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CRC_WIDTH_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CRC_LAUTCH_FLGA_CH</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>IN_CRC_CLEAR_CH%s</name>
          <description>This register is used to clear ch%s crc result</description>
          <addressOffset>0x33c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_CRC_CLEAR_CH</name>
              <description>This register is used to clear ch0 of rx crc result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>IN_CRC_FINAL_RESULT_CH%s</name>
          <description>This register is used to store ch%s crc result</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_CRC_FINAL_RESULT_CH</name>
              <description>This register is used to store result ch0 of rx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_EN_WR_DATA_CH%s</name>
          <description>This resister is used to config ch%s crc en for every bit</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CRC_EN_WR_DATA_CH</name>
              <description>This register is used to enable rx ch0 crc 32bit on/off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_EN_ADDR_CH%s</name>
          <description>This register is used to config ch%s crc en addr</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CRC_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_DATA_EN_WR_DATA_CH%s</name>
          <description>This register is used to config crc data_8bit en</description>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CRC_DATA_EN_WR_DATA_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x28</dimIncrement>
          <name>RX_CRC_DATA_EN_ADDR_CH%s</name>
          <description>This register is used to config addr of crc data_8bit en</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CRC_DATA_EN_ADDR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH_ARB_WEIGHT_CH0</name>
          <description>RX channel 0 arbitration weight configuration register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_VALUE_CH0</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ARB_WEIGHT_OPT_DIR_CH0</name>
          <description>RX channel 0 weight arbitration optimization enable register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_OPT_DIS_CH0</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH_ARB_WEIGHT_CH1</name>
          <description>RX channel 1 arbitration weight configuration register</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_VALUE_CH1</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ARB_WEIGHT_OPT_DIR_CH1</name>
          <description>RX channel 1 weight arbitration optimization enable register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_OPT_DIS_CH1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH_ARB_WEIGHT_CH2</name>
          <description>RX channel 2 arbitration weight configuration register</description>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_VALUE_CH2</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ARB_WEIGHT_OPT_DIR_CH2</name>
          <description>RX channel 2 weight arbitration optimization enable register</description>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGHT_OPT_DIS_CH2</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_ADDR_CH0</name>
          <description>Link list descriptor address configuration of RX channel 0</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH0</name>
              <description>Configures the 32 bits of the first receive descriptor's address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_ADDR_CH1</name>
          <description>Link list descriptor address configuration of RX channel 1</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH1</name>
              <description>Configures the 32 bits of the first receive descriptor's address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_LINK_ADDR_CH2</name>
          <description>Link list descriptor address configuration of RX channel 2</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_ADDR_CH2</name>
              <description>Configures the 32 bits of the first receive descriptor's address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_ADDR_CH0</name>
          <description>Link list descriptor address configuration of TX channel 0</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH0</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_ADDR_CH1</name>
          <description>Link list descriptor address configuration of TX channel 1</description>
          <addressOffset>0x3bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH1</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_ADDR_CH2</name>
          <description>Link list descriptor address configuration of TX channel 2</description>
          <addressOffset>0x3c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH2</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>Accessible address space start address configuration register</description>
          <addressOffset>0x3c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>Accessible address space start address configuration register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>Accessible address space end address configuration register</description>
          <addressOffset>0x3c8</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>Configures the end address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT_TX</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x3cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT_TX</name>
              <description>Configures the time slot for TX. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT_RX</name>
          <description>RX arbitration timeout configuration register</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT_RX</name>
              <description>Configures the time slot for RX. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN_TX</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WEIGHT_EN_TX</name>
              <description>Configures whether to enable weight arbitration for TX.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN_RX</name>
          <description>RX weight arbitration enable register</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WEIGHT_EN_RX</name>
              <description>Configures whether to enable weight arbitration for RX.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NUM</name>
              <description>Configures the time slot. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WEIGHT_EN</name>
              <description>Configures whether to enable weight arbitration.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODULE_CLK_EN</name>
          <description>Module clock force on register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <resetValue>0x7fff</resetValue>
          <fields>
            <field>
              <name>AHB_APB_SYNC_CLK_EN</name>
              <description>Configures whether to force on ahb_apb_sync 2~0 module clock. For bit n:\\0 : Not force on ahb_apb_sync n clock \\1 : Force on ahb_apb_sync n clock\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_CLK_EN</name>
              <description>Configures whether to force on out_dscr 2~0 module clock. For bit n:\\0 : Not force on out_dscr n clock \\1 : Force on out_dscr n clock\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CTRL_CLK_EN</name>
              <description>Configures whether to force on out_ctrl 2~0 module clock. For bit n:\\0 : Not force on out_ctrl n clock \\1 : Force on out_ctrl n clock\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_CLK_EN</name>
              <description>Configures whether to force on in_dscr 2~0 module clock. For bit n:\\0 : Not force on in_dscr n clock \\1 : Force on in_dscr n clock\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CTRL_CLK_EN</name>
              <description>Configures whether to force on in_ctrl 2~0 module clock. For bit n:\\0 : Not force on in_ctrl n clock \\1 : Force on in_ctrl n clock\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_ARB_CLK_EN</name>
              <description>Configures whether to force on cmd_arb module clock. \\0 : Not force on cmd_arb clock \\1 : Force on cmd_arb clock\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBINF_CLK_EN</name>
              <description>Configures whether to force on ahbinf module clock. \\0 : Not force on ahbinf clock \\1 : Force on ahbinf clock\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBINF_RESP_ERR_STATUS0</name>
          <description>AHB response error status 0 register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHBINF_RESP_ERR_ADDR</name>
              <description>Represents the address of the AHB response error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBINF_RESP_ERR_STATUS1</name>
          <description>AHB response error status 1 register</description>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <resetValue>0x1e</resetValue>
          <fields>
            <field>
              <name>AHBINF_RESP_ERR_WR</name>
              <description>Represents the AHB response error is write request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBINF_RESP_ERR_ID</name>
              <description>Represents the AHB response error request id.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBINF_RESP_ERR_CH_ID</name>
              <description>Represents the AHB response error request channel id.bit[2]=1:TX channel.\\bit[2]=0:RX channel.\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH0</name>
          <description>RX_done Inlink descriptor address of RX channel 0</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH0</name>
              <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DONE_DES_ADDR_CH0</name>
          <description>TX done outlink descriptor address of TX channel 0</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_DES_ADDR_CH0</name>
              <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH1</name>
          <description>RX_done Inlink descriptor address of RX channel 1</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH1</name>
              <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DONE_DES_ADDR_CH1</name>
          <description>TX done outlink descriptor address of TX channel 1</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_DES_ADDR_CH1</name>
              <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
