esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>CORE_1_INTR_CLR</name>
          <description>core1 monitor interrupt clr register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_RD_CLR</name>
              <description>Core1 dram0 area0 read monitor interrupt clr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_0_WR_CLR</name>
              <description>Core1 dram0 area0 write monitor interrupt clr</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_RD_CLR</name>
              <description>Core1 dram0 area1 read monitor interrupt clr</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_WR_CLR</name>
              <description>Core1 dram0 area1 write monitor interrupt clr</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_RD_CLR</name>
              <description>Core1 PIF area0 read monitor interrupt clr</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_WR_CLR</name>
              <description>Core1 PIF area0 write monitor interrupt clr</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_RD_CLR</name>
              <description>Core1 PIF area1 read monitor interrupt clr</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_WR_CLR</name>
              <description>Core1 PIF area1 write monitor interrupt clr</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MIN_CLR</name>
              <description>Core1 stackpoint underflow monitor interrupt clr</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MAX_CLR</name>
              <description>Core1 stackpoint overflow monitor interrupt clr</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>IBUS busy monitor interrupt clr</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>DBUS busy monitor interrupt clr</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_0_MIN</name>
          <description>core1 dram0 region0 addr configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_MIN</name>
              <description>Core1 dram0 region0 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_0_MAX</name>
          <description>core1 dram0 region0 addr configuration register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_MAX</name>
              <description>Core1 dram0 region0 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_1_MIN</name>
          <description>core1 dram0 region1 addr configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_1_MIN</name>
              <description>Core1 dram0 region1 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_1_MAX</name>
          <description>core1 dram0 region1 addr configuration register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_1_MAX</name>
              <description>Core1 dram0 region1 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_0_MIN</name>
          <description>core1 PIF region0 addr configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_0_MIN</name>
              <description>Core1 PIF region0 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_0_MAX</name>
          <description>core1 PIF region0 addr configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_0_MAX</name>
              <description>Core1 PIF region0 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_1_MIN</name>
          <description>core1 PIF region1 addr configuration register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_1_MIN</name>
              <description>Core1 PIF region1 start addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_1_MAX</name>
          <description>core1 PIF region1 addr configuration register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_1_MAX</name>
              <description>Core1 PIF region1 end addr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PC</name>
          <description>core1 area pc status register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PC</name>
              <description>the stackpointer when first touch region monitor interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_SP</name>
          <description>core1 area sp status register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_AREA_SP</name>
              <description>the PC when first touch region monitor interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_MIN</name>
          <description>stack min value</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_SP_MIN</name>
              <description>core1 sp region configuration regsiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_MAX</name>
          <description>stack max value</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CORE_1_SP_MAX</name>
              <description>core1 sp pc status register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_PC</name>
          <description>stack monitor pc status register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_SP_PC</name>
              <description>This regsiter stores the PC when trigger stack monitor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_EN</name>
          <description>record enable configuration register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_RCD_RECORDEN</name>
              <description>Set 1 to enable record PC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_RCD_PDEBUGEN</name>
              <description>Set 1 to enable cpu pdebug function, must set this bit can get cpu PC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGPC</name>
          <description>record status regsiter</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGPC</name>
              <description>recorded PC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGSP</name>
          <description>record status regsiter</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGSP</name>
              <description>recorded sp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register0</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_IRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_1_iram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_WR_0</name>
              <description>reg_core_1_iram0_recording_wr_0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_LOADSTORE_0</name>
              <description>reg_core_1_iram0_recording_loadstore_0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_EXCEPTION_MONITOR_1</name>
          <description>exception monitor status register1</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_IRAM0_RECORDING_ADDR_1</name>
              <description>reg_core_1_iram0_recording_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_WR_1</name>
              <description>reg_core_1_iram0_recording_wr_1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_LOADSTORE_1</name>
              <description>reg_core_1_iram0_recording_loadstore_1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register2</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_WR_0</name>
              <description>reg_core_1_dram0_recording_wr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_RECORDING_BYTEEN_0</name>
              <description>reg_core_1_dram0_recording_byteen_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_1</name>
          <description>exception monitor status register3</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_1_dram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_2</name>
          <description>exception monitor status register4</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_PC_0</name>
              <description>reg_core_1_dram0_recording_pc_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_3</name>
          <description>exception monitor status register5</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_WR_1</name>
              <description>reg_core_1_dram0_recording_wr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_RECORDING_BYTEEN_1</name>
              <description>reg_core_1_dram0_recording_byteen_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_4</name>
          <description>exception monitor status register6</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_ADDR_1</name>
              <description>reg_core_1_dram0_recording_addr_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_5</name>
          <description>exception monitor status register7</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_PC_1</name>
              <description>reg_core_1_dram0_recording_pc_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_LASTPC_BEFORE_EXCEPTION</name>
          <description>cpu status register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_LASTPC_BEFORE_EXC</name>
              <description>cpu's lastpc before exception</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DEBUG_MODE</name>
          <description>cpu status register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_1_DEBUG_MODE</name>
              <description>cpu debug mode status, 1 means cpu enter debug mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DEBUG_MODULE_ACTIVE</name>
              <description>cpu debug_module active status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register6</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0</name>
              <description>reg_core_x_iram0_dram0_limit_cycle_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_1</name>
          <description>exception monitor status register7</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_1</name>
              <description>reg_core_x_iram0_dram0_limit_cycle_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>clock register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Set 1 force on the clock gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>version register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2109130</resetValue>
          <fields>
            <field>
              <name>ASSIST_DEBUG_DATE</name>
              <description>version register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
