esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>L1_DBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS0_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus0 WB-Access Counter register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS0_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_HIT_CNT</name>
          <description>L1-DCache bus1 Hit-Access Counter register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS1_HIT_CNT</name>
              <description>The register records the number of hits when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_MISS_CNT</name>
          <description>L1-DCache bus1 Miss-Access Counter register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS1_MISS_CNT</name>
              <description>The register records the number of missing when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus1 WB-Access Counter register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS1_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_HIT_CNT</name>
          <description>L1-DCache bus2 Hit-Access Counter register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_MISS_CNT</name>
          <description>L1-DCache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus2 WB-Access Counter register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS2_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS3_ACS_HIT_CNT</name>
          <description>L1-DCache bus3 Hit-Access Counter register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS3_HIT_CNT</name>
              <description>The register records the number of hits when bus3 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS3_ACS_MISS_CNT</name>
          <description>L1-DCache bus3 Miss-Access Counter register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS3_MISS_CNT</name>
              <description>The register records the number of missing when bus3 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS3_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus3 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-DCache accesses L2-Cache due to bus3 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS3_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus3 WB-Access Counter register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DBUS3_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache0 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache1 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE2_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE2_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache2 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_ACS_FAIL_ID_ATTR</name>
          <description>L1-ICache0 Access Fail ID/attribution information register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_ACS_FAIL_ADDR</name>
          <description>L1-ICache0 Access Fail Address information register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache3 accesses L1-ICache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_ACS_FAIL_ID_ATTR</name>
          <description>L1-DCache Access Fail ID/attribution information register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_FAIL_ID</name>
              <description>The register records the ID of fail-access when cache accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DCACHE_FAIL_ATTR</name>
              <description>The register records the attribution of fail-access when cache accesses L1-DCache.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_ACS_FAIL_ADDR</name>
          <description>L1-DCache Access Fail Address information register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_FAIL_ADDR</name>
              <description>The register records the address of fail-access when cache accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_L1_CACHE_PRELOAD_INT_ENA</name>
          <description>L1-Cache Access Fail Interrupt enable register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PLD_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache0 preload-operation. If preload operation is done, interrupt occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache1 preload-operation. If preload operation is done, interrupt occurs.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_DONE_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_DONE_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DCACHE_PLD_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-DCache preload-operation. If preload operation is done, interrupt occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_DONE_INT_ENA</name>
              <description>The bit is used to enable interrupt of Cache sync-operation done.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PLD_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache0 preload-operation error.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PLD_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-ICache1 preload-operation error.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE2_PLD_ERR_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PLD_ERR_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_DCACHE_PLD_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of L1-DCache preload-operation error.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_ERR_INT_ENA</name>
              <description>The bit is used to enable interrupt of Cache sync-operation error.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
