esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>PSRAM_DQ13_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQ13_DLI</name>
              <description>psram dq13 dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ13_DLC</name>
              <description>psram dq13 dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ13_HYS</name>
              <description>psram dq13 sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ13_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ13_WPU</name>
              <description>psram dq13 wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ13_WPD</name>
              <description>psram dq13 wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ13_DRV</name>
              <description>psram dq13 drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ13_HOLD</name>
              <description>psram dq13 hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQ14_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQ14_DLI</name>
              <description>psram dq14 dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ14_DLC</name>
              <description>psram dq14 dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ14_HYS</name>
              <description>psram dq14 sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ14_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ14_WPU</name>
              <description>psram dq14 wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ14_WPD</name>
              <description>psram dq14 wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ14_DRV</name>
              <description>psram dq14 drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ14_HOLD</name>
              <description>psram dq14 hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQ15_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQ15_DLI</name>
              <description>psram dq15 dli</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ15_DLC</name>
              <description>psram dq15 dlc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ15_HYS</name>
              <description>psram dq15 sl</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ15_IE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ15_WPU</name>
              <description>psram dq15 wpu</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ15_WPD</name>
              <description>psram dq15 wpd</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ15_DRV</name>
              <description>psram dq15 drv</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQ15_HOLD</name>
              <description>psram dq15 hold</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_DQS_1_PIN0</name>
          <description>IOMUX_MSPI_PIN_PSRAM_D_PIN0_REG</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00020000</resetValue>
          <fields>
            <field>
              <name>REG_PSRAM_DQS_1_XPD</name>
              <description>psram xpd dqs1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_PHASE</name>
              <description>psram dqs1 phase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_DLI</name>
              <description>psram dqs1 dli</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_DELAY_90</name>
              <description>psram dqs1 delay 90</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_HYS</name>
              <description>psram dqs1 sl</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_IE</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_WPU</name>
              <description>psram dqs1 wpu</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_WPD</name>
              <description>psram dqs1 wpd</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_DRV</name>
              <description>psram dqs1 drv</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_1_DELAY_270</name>
              <description>psram dqs1 delay 270</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_PSRAM_DQS_HOLD</name>
              <description>psram dqs hold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
