esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT_CORE0</name>
      <description>Interrupt Controller (Core 0)</description>
      <groupName>CORE0</groupName>
      <baseAddress>0x500d6000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x244</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LP_RTC_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_RTC_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_RTC_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_RTC_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_WDT_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_WDT_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_WDT_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_WDT_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TIMER_REG_0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_TIMER_REG_0_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TIMER_REG_0_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TIMER_REG_0_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TIMER_REG_1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_TIMER_REG_1_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TIMER_REG_1_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TIMER_REG_1_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_HP_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_MB_HP_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_MB_HP_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_MB_HP_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MB_LP_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_MB_LP_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_MB_LP_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_MB_LP_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_REG_0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_PMU_REG_0_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_PMU_REG_0_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_PMU_REG_0_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_REG_1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_PMU_REG_1_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_PMU_REG_1_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_PMU_REG_1_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANAPERI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_ANAPERI_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_ANAPERI_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_ANAPERI_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ADC_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_ADC_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_ADC_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_ADC_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_GPIO_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_GPIO_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_GPIO_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_GPIO_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_I2C_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_I2C_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_I2C_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_I2C_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_I2S_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_I2S_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_I2S_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_I2S_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SPI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_SPI_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_SPI_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_SPI_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TOUCH_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_TOUCH_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TOUCH_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TOUCH_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TSENS_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_TSENS_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TSENS_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_TSENS_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_UART_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_UART_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_UART_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_UART_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_EFUSE_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_EFUSE_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_EFUSE_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_EFUSE_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SW_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_SW_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_SW_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_SW_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SYSREG_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_SYSREG_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_SYSREG_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_SYSREG_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_HUK_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_LP_HUK_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_HUK_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_LP_HUK_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_ICM_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_SYS_ICM_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_SYS_ICM_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_SYS_ICM_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
