esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>AXI_PDMA_OUT_CH1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_AXI_PDMA_OUT_CH1_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_AXI_PDMA_OUT_CH1_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_AXI_PDMA_OUT_CH1_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PDMA_OUT_CH2_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_AXI_PDMA_OUT_CH2_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_AXI_PDMA_OUT_CH2_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_AXI_PDMA_OUT_CH2_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_RSA_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_RSA_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_RSA_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_AES_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_AES_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_AES_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_SHA_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_SHA_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_SHA_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_ECC_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_ECC_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_ECC_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECDSA_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_ECDSA_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_ECDSA_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_ECDSA_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_KM_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_KM_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_KM_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT0_MAP</name>
          <description>NA</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_GPIO_INT0_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT0_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT0_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT1_MAP</name>
          <description>NA</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_GPIO_INT1_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT1_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT1_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT2_MAP</name>
          <description>NA</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_GPIO_INT2_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT2_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT2_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT3_MAP</name>
          <description>NA</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_GPIO_INT3_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT3_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_INT3_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_PAD_COMP_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_GPIO_PAD_COMP_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_PAD_COMP_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_GPIO_PAD_COMP_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INT_FROM_CPU_0_MAP</name>
          <description>NA</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_0_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_0_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_0_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INT_FROM_CPU_1_MAP</name>
          <description>NA</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_1_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_1_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_1_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INT_FROM_CPU_2_MAP</name>
          <description>NA</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_2_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_2_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_2_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_INT_FROM_CPU_3_MAP</name>
          <description>NA</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_3_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_3_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CPU_INT_FROM_CPU_3_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_CACHE_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CACHE_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CACHE_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_MSPI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_FLASH_MSPI_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_FLASH_MSPI_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_FLASH_MSPI_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_BRIDGE_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_CSI_BRIDGE_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CSI_BRIDGE_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CSI_BRIDGE_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSI_BRIDGE_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_DSI_BRIDGE_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_DSI_BRIDGE_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_DSI_BRIDGE_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE0_CSI_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CSI_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CSI_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
