esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>DSI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_DSI_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DSI_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DSI_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMII_PHY_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_GMII_PHY_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_GMII_PHY_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_GMII_PHY_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_LPI_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_LPI_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_LPI_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMT_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_PMT_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_PMT_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_PMT_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBD_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_SBD_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_SBD_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_SBD_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_USB_OTG_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_USB_OTG_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_USB_OTG_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG_ENDP_MULTI_PROC_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_USB_OTG_ENDP_MULTI_PROC_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_USB_OTG_ENDP_MULTI_PROC_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JPEG_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_JPEG_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_JPEG_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_JPEG_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPA_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_PPA_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_PPA_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_PPA_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE0_TRACE_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_CORE0_TRACE_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_CORE0_TRACE_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_CORE0_TRACE_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE1_TRACE_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_CORE1_TRACE_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_CORE1_TRACE_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_CORE1_TRACE_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_CTRL_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_HP_CORE_CTRL_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_HP_CORE_CTRL_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_HP_CORE_CTRL_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISP_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_ISP_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_ISP_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_ISP_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_MST_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_I3C_MST_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_I3C_MST_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_I3C_MST_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_SLV_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_I3C_SLV_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_I3C_SLV_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_I3C_SLV_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG11_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_USB_OTG11_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_USB_OTG11_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_USB_OTG11_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_IN_CH0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_IN_CH0_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_IN_CH0_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_IN_CH0_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_IN_CH1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_IN_CH1_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_IN_CH1_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_IN_CH1_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_OUT_CH0_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_OUT_CH0_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH0_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH0_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_OUT_CH1_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_OUT_CH1_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH1_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH1_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2D_OUT_CH2_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_OUT_CH2_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH2_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH2_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_MSPI_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_PSRAM_MSPI_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_PSRAM_MSPI_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_PSRAM_MSPI_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
