esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>DMA2D_OUT_CH3_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_DMA2D_OUT_CH3_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH3_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_DMA2D_OUT_CH3_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERF_MON_INT_MAP</name>
          <description>NA</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_AXI_PERF_MON_INT_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_AXI_PERF_MON_INT_SRC_PASS_IN_SEC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_AXI_PERF_MON_INT_SRC_IN_SEC_FLAG</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_STATUS_REG_4</name>
          <description>NA</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_STATUS_4</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SIG_IDX_ASSERT_IN_SEC</name>
          <description>NA</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_SIG_IDX_ASSERT_IN_SEC</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SEC_STATUS</name>
          <description>NA</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_SEC_STATUS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SRC_PASS_IN_SEC_STATUS_0</name>
          <description>NA</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_SRC_PASS_IN_SEC_STATUS_0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SRC_PASS_IN_SEC_STATUS_1</name>
          <description>NA</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_SRC_PASS_IN_SEC_STATUS_1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SRC_PASS_IN_SEC_STATUS_2</name>
          <description>NA</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_SRC_PASS_IN_SEC_STATUS_2</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SRC_PASS_IN_SEC_STATUS_3</name>
          <description>NA</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_SRC_PASS_IN_SEC_STATUS_3</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SRC_PASS_IN_SEC_STATUS_4</name>
          <description>NA</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE1_INTR_SRC_PASS_IN_SEC_STATUS_4</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_REG_DATE</name>
          <description>NA</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2502280</resetValue>
          <fields>
            <field>
              <name>CORE1_INTERRUPT_REG_DATE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
