esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MIPI_CSI_BRIDGE</name>
      <description>MIPI Camera Interface Bridge</description>
      <groupName>CSI_BRIG</groupName>
      <baseAddress>0x5009f800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CSI_BRIDGE</name>
        <value>85</value>
      </interrupt>
      <registers>
        <register>
          <name>CLK_EN</name>
          <description>csi bridge register mapping unit clock gating.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>0: enable clock gating. 1: disable clock gating, clock always on.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_EN</name>
          <description>csi bridge enable.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CSI_BRIG_EN</name>
              <description>0: disable csi bridge. 1: enable csi bridge.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_BRIG_RST</name>
              <description>0: release csi bridge reset. 1: enable csi bridge reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_REQ_CFG</name>
          <description>dma request configuration.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x20080</resetValue>
          <fields>
            <field>
              <name>DMA_BURST_LEN</name>
              <description>DMA burst length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_CFG_UPD_BY_BLK</name>
              <description>1: reg_dma_burst_len &amp; reg_dma_burst_len will be updated by dma block finish. 0: updated by frame.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_FORCE_RD_STATUS</name>
              <description>1: mask dma request when reading frame info. 0: disable mask.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_DMA_FLOW_CONTROLLER</name>
              <description>0: dma as flow controller. 1: csi_bridge as flow controller</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUF_FLOW_CTL</name>
          <description>csi bridge buffer control.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x7f8</resetValue>
          <fields>
            <field>
              <name>CSI_BUF_AFULL_THRD</name>
              <description>buffer almost full threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_BUF_DEPTH</name>
              <description>buffer data count.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_TYPE_CFG</name>
          <description>pixel data type configuration.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x2f18</resetValue>
          <fields>
            <field>
              <name>DATA_TYPE_MIN</name>
              <description>the min value of data type used for pixel filter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_TYPE_MAX</name>
              <description>the max value of data type used for pixel filter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME_CFG</name>
          <description>frame configuration.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x11e01e0</resetValue>
          <fields>
            <field>
              <name>VADR_NUM</name>
              <description>vadr of frame data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HADR_NUM</name>
              <description>hadr of frame data.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HAS_HSYNC_E</name>
              <description>0: frame data doesn't contain hsync. 1: frame data contains hsync.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADR_NUM_CHECK</name>
              <description>0: disable vadr check. 1: enable vadr check.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENDIAN_MODE</name>
          <description>data endianness order configuration.</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BYTE_ENDIAN_ORDER</name>
              <description>endianness order in bytes. 2'h0 is normal mode and 2'h3 is useful to YUV420(Legacy) when isp is bapassed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_ENDIAN_ORDER</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>csi bridge interrupt raw.</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VADR_NUM_GT_INT_RAW</name>
              <description>reg_vadr_num is greater than real interrupt raw.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADR_NUM_LT_INT_RAW</name>
              <description>reg_vadr_num is less than real interrupt raw.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCARD_INT_RAW</name>
              <description>an incomplete frame of data was sent interrupt raw.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_BUF_OVERRUN_INT_RAW</name>
              <description>buffer overrun interrupt raw.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_ASYNC_FIFO_OVF_INT_RAW</name>
              <description>buffer overflow interrupt raw.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_CFG_HAS_UPDATED_INT_RAW</name>
              <description>dma configuration update complete interrupt raw.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>csi bridge interrupt clr.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VADR_NUM_GT_REAL_INT_CLR</name>
              <description>reg_vadr_num is greater than real interrupt clr.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VADR_NUM_LT_REAL_INT_CLR</name>
              <description>reg_vadr_num is less than real interrupt clr.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DISCARD_INT_CLR</name>
              <description>an incomplete frame of data was sent interrupt clr.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSI_BUF_OVERRUN_INT_CLR</name>
              <description>buffer overrun interrupt clr.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CSI_ASYNC_FIFO_OVF_INT_CLR</name>
              <description>buffer overflow interrupt clr.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_CFG_HAS_UPDATED_INT_CLR</name>
              <description>dma configuration update complete interrupt clr.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>csi bridge interrupt st.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VADR_NUM_GT_INT_ST</name>
              <description>reg_vadr_num is greater than real interrupt st.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VADR_NUM_LT_INT_ST</name>
              <description>reg_vadr_num is less than real interrupt st.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DISCARD_INT_ST</name>
              <description>an incomplete frame of data was sent interrupt st.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_BUF_OVERRUN_INT_ST</name>
              <description>buffer overrun interrupt st.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSI_ASYNC_FIFO_OVF_INT_ST</name>
              <description>buffer overflow interrupt st.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CFG_HAS_UPDATED_INT_ST</name>
              <description>dma configuration update complete interrupt st.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>csi bridge interrupt enable.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VADR_NUM_GT_INT_ENA</name>
              <description>reg_vadr_num is greater than real interrupt enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADR_NUM_LT_INT_ENA</name>
              <description>reg_vadr_num is less than real interrupt enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCARD_INT_ENA</name>
              <description>an incomplete frame of data was sent interrupt enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_BUF_OVERRUN_INT_ENA</name>
              <description>buffer overrun interrupt enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_ASYNC_FIFO_OVF_INT_ENA</name>
              <description>buffer overflow interrupt enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_CFG_HAS_UPDATED_INT_ENA</name>
              <description>dma configuration update complete interrupt enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_REQ_INTERVAL</name>
          <description>DMA interval configuration.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>DMA_REQ_INTERVAL</name>
              <description>16'b1: 1 cycle. 16'b11: 2 cycle. ... ... 16'hFFFF: 16 cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABLK_SIZE</name>
          <description>DMA block size configuration.</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x1fff</resetValue>
          <fields>
            <field>
              <name>DMABLK_SIZE</name>
              <description>the number of reg_dma_burst_len in a block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_CS</name>
          <description>N/A</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_EN</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_ECO_RESULT</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_LOW</name>
          <description>N/A</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_LOW</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_HIGH</name>
          <description>N/A</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RDN_ECO_HIGH</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_CTRL</name>
          <description>csi host control by csi bridge.</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>CSI_ENABLECLK</name>
              <description>enable clock lane module of csi phy.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_CFG_CLK_EN</name>
              <description>enable cfg_clk of csi host module.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOOPBK_TEST_EN</name>
              <description>for phy test by loopback dsi phy to csi phy.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CTRL</name>
          <description>csi bridge buffer control.</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x2640</resetValue>
          <fields>
            <field>
              <name>CSI_BRIDGE_MEM_CLK_FORCE_ON</name>
              <description>csi bridge memory clock gating force on.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_MEM_AUX_CTRL</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_CM_CTRL</name>
          <description>CSI HOST color mode convert configuration.</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x803</resetValue>
          <fields>
            <field>
              <name>CSI_HOST_CM_EN</name>
              <description>Configures whether to enable cm output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_BYPASS</name>
              <description>Configures whether to bypass cm</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_RX</name>
              <description>Configures whether to bypass cm</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_RX_RGB_FORMAT</name>
              <description>Configures whether to bypass cm</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_RX_YUV422_FORMAT</name>
              <description>Configures whether to bypass cm</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_TX</name>
              <description>Configures whether to bypass cm</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_LANE_NUM</name>
              <description>Configures lane number that csi used, valid only rgb888 to rgb888. 0: 1-lane, 1: 2-lane</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_16BIT_SWAP</name>
              <description>Configures whether to swap idi32 high and low 16-bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSI_HOST_CM_8BIT_SWAP</name>
              <description>Configures whether to swap idi32 high and low 8-bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
