esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>CH1_INTCLEAR1</name>
          <description>NA</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH1_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_SAR0</name>
          <description>NA</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_SAR1</name>
          <description>NA</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SAR1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_DAR0</name>
          <description>NA</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_DAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_DAR1</name>
          <description>NA</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_DAR1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_BLOCK_TS0</name>
          <description>NA</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_BLOCK_TS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CTL0</name>
          <description>NA</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0x1200</resetValue>
          <fields>
            <field>
              <name>CH2_SMS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DMS</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SINC</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DINC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SRC_TR_WIDTH</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DST_TR_WIDTH</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SRC_MSIZE</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DST_MSIZE</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_AR_CACHE</name>
              <description>NA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_AW_CACHE</name>
              <description>NA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_NONPOSTED_LASTWRITE_EN</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CTL1</name>
          <description>NA</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_AR_PROT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_AW_PROT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ARLEN_EN</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ARLEN</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_AWLEN_EN</name>
              <description>NA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_AWLEN</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SRC_STAT_EN</name>
              <description>NA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DST_STAT_EN</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_IOC_BLKTFR</name>
              <description>NA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SHADOWREG_OR_LLI_LAST</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SHADOWREG_OR_LLI_VALID</name>
              <description>NA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CFG0</name>
          <description>NA</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SRC_MULTBLK_TYPE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DST_MULTBLK_TYPE</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_RD_UID</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_WR_UID</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CFG1</name>
          <description>NA</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0x4001b</resetValue>
          <fields>
            <field>
              <name>CH2_TT_FC</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_HS_SEL_SRC</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_HS_SEL_DST</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SRC_HWHS_POL</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_DST_HWHS_POL</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_SRC_PER</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DST_PER</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_CH_PRIOR</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_LOCK_CH</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_LOCK_CH_L</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_SRC_OSR_LMT</name>
              <description>NA</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_DST_OSR_LMT</name>
              <description>NA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_LLP0</name>
          <description>NA</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_LMS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_LOC0</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_LLP1</name>
          <description>NA</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_LOC1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_STATUS0</name>
          <description>NA</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_CMPLTD_BLK_TFR_SIZE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_STATUS1</name>
          <description>NA</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_DATA_LEFT_IN_FIFO</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_SWHSSRC0</name>
          <description>NA</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SWHS_REQ_SRC</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SWHS_REQ_SRC_WE</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_SWHS_SGLREQ_SRC</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SWHS_SGLREQ_SRC_WE</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_SWHS_LST_SRC</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SWHS_LST_SRC_WE</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_SWHSDST0</name>
          <description>NA</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SWHS_REQ_DST</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SWHS_REQ_DST_WE</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_SWHS_SGLREQ_DST</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SWHS_SGLREQ_DST_WE</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_SWHS_LST_DST</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_SWHS_LST_DST_WE</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_BLK_TFR_RESUMEREQ0</name>
          <description>NA</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_BLK_TFR_RESUMEREQ</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_AXI_ID0</name>
          <description>NA</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_AXI_READ_ID_SUFFIX</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_AXI_WRITE_ID_SUFFIX</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_AXI_QOS0</name>
          <description>NA</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_AXI_AWQOS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_AXI_ARQOS</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_SSTAT0</name>
          <description>NA</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_DSTAT0</name>
          <description>NA</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_DSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_SSTATAR0</name>
          <description>NA</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SSTATAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_SSTATAR1</name>
          <description>NA</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_SSTATAR1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_DSTATAR0</name>
          <description>NA</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_DSTATAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
