esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>CH2_INTSIGNAL_ENABLE0</name>
          <description>NA</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0xfa3f7ffb</resetValue>
          <fields>
            <field>
              <name>CH2_ENABLE_BLOCK_TFR_DONE_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_DMA_TFR_DONE_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SRC_TRANSCOMP_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_DST_TRANSCOMP_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SRC_DEC_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_DST_DEC_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SRC_SLV_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_DST_SLV_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_LLI_RD_DEC_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_LLI_WR_DEC_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_LLI_RD_SLV_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_LLI_WR_SLV_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SHADOWREG_OR_LLI_INVALID_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_MULTIBLKTYPE_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_DEC_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_WR2RO_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_RD2RWO_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_WRONCHEN_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_WRONHOLD_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_SLVIF_WRPARITY_ERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_ENABLE_CH_LOCK_CLEARED_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_CH_SRC_SUSPENDED_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_CH_SUSPENDED_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_CH_DISABLED_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ENABLE_CH_ABORTED_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_INTSIGNAL_ENABLE1</name>
          <description>NA</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>CH2_ENABLE_ECC_PROT_CHMEM_CORRERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_ENABLE_ECC_PROT_CHMEM_UNCORRERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_ENABLE_ECC_PROT_UIDMEM_CORRERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2_ENABLE_ECC_PROT_UIDMEM_UNCORRERR_INTSIGNAL</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_INTCLEAR0</name>
          <description>NA</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_CLEAR_BLOCK_TFR_DONE_INTSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_DMA_TFR_DONE_INTSTAT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SRC_TRANSCOMP_INTSTAT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_DST_TRANSCOMP_INTSTAT</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SRC_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_DST_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SRC_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_DST_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_LLI_RD_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_LLI_WR_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_LLI_RD_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_LLI_WR_SLV_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SHADOWREG_OR_LLI_INVALID_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_MULTIBLKTYPE_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_DEC_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_WR2RO_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_RD2RWO_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_WRONCHEN_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_SHADOWREG_WRON_VALID_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_WRONHOLD_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_SLVIF_WRPARITY_ERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_CH_LOCK_CLEARED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_CH_SRC_SUSPENDED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_CH_SUSPENDED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_CH_DISABLED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_CH_ABORTED_INTSTAT</name>
              <description>NA</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_INTCLEAR1</name>
          <description>NA</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH2_CLEAR_ECC_PROT_CHMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_ECC_PROT_CHMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_ECC_PROT_UIDMEM_CORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH2_CLEAR_ECC_PROT_UIDMEM_UNCORRERR_INTSTAT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_SAR0</name>
          <description>NA</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH3_SAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_SAR1</name>
          <description>NA</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH3_SAR1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_DAR0</name>
          <description>NA</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH3_DAR0</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_DAR1</name>
          <description>NA</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH3_DAR1</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_BLOCK_TS0</name>
          <description>NA</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH3_BLOCK_TS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_CTL0</name>
          <description>NA</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0x1200</resetValue>
          <fields>
            <field>
              <name>CH3_SMS</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_DMS</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_SINC</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_DINC</name>
              <description>NA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_SRC_TR_WIDTH</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_DST_TR_WIDTH</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_SRC_MSIZE</name>
              <description>NA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_DST_MSIZE</name>
              <description>NA</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_AR_CACHE</name>
              <description>NA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_AW_CACHE</name>
              <description>NA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_NONPOSTED_LASTWRITE_EN</name>
              <description>NA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
