esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>DMA_FRAME_INTERVAL</name>
          <description>dsi_bridge dam frame interval control register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x20002409</resetValue>
          <fields>
            <field>
              <name>DMA_FRAME_SLOT</name>
              <description>this field configures the max frame_slot_cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_FRAME_INTERVAL</name>
              <description>this field configures the max frame_interval_cnt, frame_interval_cnt increased by 1 when frame_slot_cnt if full</description>
              <bitOffset>10</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_MULTIBLK_EN</name>
              <description>this bit configures enable multi-blk transfer, 0: disable, 1: enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>this bit configures enable interval between frame transfer, 0: disable, 1: enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL</name>
          <description>dsi_bridge mem aux control register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x1320</resetValue>
          <fields>
            <field>
              <name>DSI_MEM_AUX_CTRL</name>
              <description>this field configures dsi_bridge fifo memory aux ctrl</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_CS</name>
          <description>dsi_bridge rdn eco cs register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_EN</name>
              <description>rdn_eco_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_ECO_RESULT</name>
              <description>rdn_eco_result</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_LOW</name>
          <description>dsi_bridge rdn eco all low register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_LOW</name>
              <description>rdn_eco_low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_HIGH</name>
          <description>dsi_bridge rdn eco all high register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RDN_ECO_HIGH</name>
              <description>rdn_eco_high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HOST_CTRL</name>
          <description>dsi_bridge host control register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>DSI_CFG_REF_CLK_EN</name>
              <description>this bit configures the clk enable refclk and cfg_clk of dsi_host. 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CLK_CTRL</name>
          <description>dsi_bridge mem force on control register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DSI_BRIDGE_MEM_CLK_FORCE_ON</name>
              <description>this bit configures the clock force on of dsi_bridge fifo memory. 0: disable, 1: force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI_MEM_CLK_FORCE_ON</name>
              <description>this bit configures the clock force on of dpi fifo memory. 0: disable, 1: force on</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_FLOW_CTRL</name>
          <description>dsi_bridge dma flow controller register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>DSI_DMA_FLOW_CONTROLLER</name>
              <description>this bit configures the flow controller, 0: dmac as flow controller, 1:dsi_bridge as flow controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_FLOW_MULTIBLK_NUM</name>
              <description>this field configures the num of blocks when multi-blk is enable and dmac as flow controller</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAW_BUF_ALMOST_EMPTY_THRD</name>
          <description>dsi_bridge buffer empty threshold register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x200</resetValue>
          <fields>
            <field>
              <name>DSI_RAW_BUF_ALMOST_EMPTY_THRD</name>
              <description>this field configures the fifo almost empty threshold, is valid only when dmac as flow controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>YUV_CFG</name>
          <description>dsi_bridge yuv format config register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROTOCAL</name>
              <description>this bit configures yuv protoocl, 0: bt.601, 1: bt.709</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV_PIX_ENDIAN</name>
              <description>this bit configures yuv pixel endian, 0: y0u0y1v1y2u2y3v3, 1: y3u3y2v2y1u1y0v0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV422_FORMAT</name>
              <description>this field configures yuv422 store format, 0: yuyv, 1: yvyu, 2: uyvy, 3: vyuy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV_RANGE</name>
              <description>Configures yuv pixel range, 0: limit range, 1: full range</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_LP_LOOPBACK_CTRL</name>
          <description>dsi phy lp_loopback test ctrl</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PHY_LP_TXDATAESC_1</name>
              <description>txdataesc_1 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_TXREQUESTESC_1</name>
              <description>txrequestesc_1 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_TXVALIDESC_1</name>
              <description>txvalidesc_1 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_TXLPDTESC_1</name>
              <description>txlpdtesc_1 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_BASEDIR_1</name>
              <description>basedir_1 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_TXDATAESC_0</name>
              <description>txdataesc_0 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_TXREQUESTESC_0</name>
              <description>txrequestesc_0 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_TXVALIDESC_0</name>
              <description>txvalidesc_0 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_TXLPDTESC_0</name>
              <description>txlpdtesc_0 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_BASEDIR_0</name>
              <description>basedir_0 ctrl when enable dsi phy lp_loopback_test</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_LOOPBACK_CHECK</name>
              <description>dsi phy lp_loopback test start check</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PHY_LP_LOOPBACK_CHECK_DONE</name>
              <description>dsi phy lp_loopback test check done</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_LP_LOOPBACK_EN</name>
              <description>dsi phy lp_loopback ctrl en</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_LOOPBACK_OK</name>
              <description>result of dsi phy lp_loopback test</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_HS_LOOPBACK_CTRL</name>
          <description>dsi phy hp_loopback test ctrl</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x200</resetValue>
          <fields>
            <field>
              <name>PHY_HS_TXDATAHS_1</name>
              <description>txdatahs_1 ctrl when enable dsi phy hs_loopback_test</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_TXREQUESTDATAHS_1</name>
              <description>txrequestdatahs_1 ctrl when enable dsi phy hs_loopback_test</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_BASEDIR_1</name>
              <description>basedir_1 ctrl when enable dsi phy hs_loopback_test</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_TXDATAHS_0</name>
              <description>txdatahs_0 ctrl when enable dsi phy hs_loopback_test</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_TXREQUESTDATAHS_0</name>
              <description>txrequestdatahs_0 ctrl when enable dsi phy hs_loopback_test</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_BASEDIR_0</name>
              <description>basedir_0 ctrl when enable dsi phy hs_loopback_test</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_TXREQUESTHSCLK</name>
              <description>txrequesthsclk when  enable dsi phy hs_loopback_test</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_LOOPBACK_CHECK</name>
              <description>dsi phy hs_loopback test start check</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PHY_HS_LOOPBACK_CHECK_DONE</name>
              <description>dsi phy hs_loopback test check done</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_HS_LOOPBACK_EN</name>
              <description>dsi phy hs_loopback ctrl en</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_HS_LOOPBACK_OK</name>
              <description>result of dsi phy hs_loopback test</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHY_LOOPBACK_CNT</name>
          <description>loopback test cnt</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x400040</resetValue>
          <fields>
            <field>
              <name>PHY_HS_CHECK_CNT_TH</name>
              <description>hs_loopback test check cnt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_LP_CHECK_CNT_TH</name>
              <description>lp_loopback test check cnt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VER_DATE</name>
          <description>version control register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x20250109</resetValue>
          <fields>
            <field>
              <name>VER_DATA</name>
              <description>Represents csv version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
