esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>SDF_3D_ACT</name>
          <description>NA</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE_3D_ACT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORMAT_3D_ACT</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECOND_VSYNC_ACT</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIGHT_FIRST_ACT</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEND_3D_CFG_ACT</name>
              <description>NA</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ECC</name>
      <description>ECC (ECC Hardware Accelerator)</description>
      <groupName>ECC</groupName>
      <baseAddress>0x50093000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x138</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ECC</name>
        <value>71</value>
      </interrupt>
      <registers>
        <register>
          <name>MULT_INT_RAW</name>
          <description>ECC raw interrupt status register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MULT_CALC_DONE_INT_RAW</name>
              <description>The raw interrupt status of the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_INT_ST</name>
          <description>ECC masked interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MULT_CALC_DONE_INT_ST</name>
              <description>The masked interrupt status of the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_INT_ENA</name>
          <description>ECC interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MULT_CALC_DONE_INT_ENA</name>
              <description>Write 1 to enable the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_INT_CLR</name>
          <description>ECC interrupt clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MULT_CALC_DONE_INT_CLR</name>
              <description>Write 1 to clear the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_CONF</name>
          <description>ECC configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MULT_START</name>
              <description>Configures whether to start calculation of ECC Accelerator. This bit will be self-cleared after the calculation is done. \\
0: No effect\\
1: Start calculation of ECC Accelerator\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT_RESET</name>
              <description>Configures whether to reset ECC Accelerator. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MULT_KEY_LENGTH</name>
              <description>Configures the key length mode bit of ECC Accelerator. \\
0: P-192\\
1: P-256\\
2: P-384\\
3: Reserved.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT_MOD_BASE</name>
              <description>Configures the mod base of mod operation, only valid in work_mode 8-11. \\
0: n(order of curve)\\
1: p(mod base of curve)\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT_WORK_MODE</name>
              <description>Configures the work mode of ECC Accelerator.\\
0: Point Multi mode\\
1: Reserved\\
2: Point Verif mode\\
3: Point Verif + Multi mode\\
4: Jacobian Point Multi mode\\
5: Reserved\\
6: Jacobian Point Verif mode\\
7: Point Verif + Jacobian Point Multi mode\\
8: Mod Add mode\\
9. Mod Sub mode\\
10: Mod Multi mode\\
11: Mod Div mode\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT_SECURITY_MODE</name>
              <description>Configures the security mode of ECC Accelerator.\\
0: no secure function enabled.\\
1: enable constant-time calculation in all point multiplication modes.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT_VERIFICATION_RESULT</name>
              <description>Represents the verification result of ECC Accelerator, valid only when calculation is done.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULT_CLK_EN</name>
              <description>Configures whether to force on register clock gate. \\
0: No effect\\
1: Force on\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT_MEM_CLOCK_GATE_FORCE_ON</name>
              <description>Configures whether to force on ECC memory clock gate. \\
0: No effect\\
1: Force on\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2408120</resetValue>
          <fields>
            <field>
              <name>MULT_DATE</name>
              <description>ECC mult version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MULT_K_MEM[%s]</name>
          <description>The memory that stores k.</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MULT_PX_MEM[%s]</name>
          <description>The memory that stores Px.</description>
          <addressOffset>0x130</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MULT_PY_MEM[%s]</name>
          <description>The memory that stores Py.</description>
          <addressOffset>0x160</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MULT_QX_MEM[%s]</name>
          <description>The memory that stores Qx.</description>
          <addressOffset>0x190</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MULT_QY_MEM[%s]</name>
          <description>The memory that stores Qy.</description>
          <addressOffset>0x1c0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>MULT_QZ_MEM[%s]</name>
          <description>The memory that stores Qz.</description>
          <addressOffset>0x1f0</addressOffset>
          <size>8</size>
        </register>
