esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>APB2OTP_BLK6_W8</name>
          <description>eFuse apb2otp block6 data register8.</description>
          <addressOffset>0x944</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W8</name>
              <description>Otp block6 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W9</name>
          <description>eFuse apb2otp block6 data register9.</description>
          <addressOffset>0x948</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W9</name>
              <description>Otp block6 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W10</name>
          <description>eFuse apb2otp block6 data register10.</description>
          <addressOffset>0x94c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W10</name>
              <description>Otp block6 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W11</name>
          <description>eFuse apb2otp block6 data register11.</description>
          <addressOffset>0x950</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W11</name>
              <description>Otp block6 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W1</name>
          <description>eFuse apb2otp block7 data register1.</description>
          <addressOffset>0x954</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W1</name>
              <description>Otp block7 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W2</name>
          <description>eFuse apb2otp block7 data register2.</description>
          <addressOffset>0x958</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W2</name>
              <description>Otp block7 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W3</name>
          <description>eFuse apb2otp block7 data register3.</description>
          <addressOffset>0x95c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W3</name>
              <description>Otp block7 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W4</name>
          <description>eFuse apb2otp block7 data register4.</description>
          <addressOffset>0x960</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W4</name>
              <description>Otp block7 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W5</name>
          <description>eFuse apb2otp block7 data register5.</description>
          <addressOffset>0x964</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W5</name>
              <description>Otp block7 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W6</name>
          <description>eFuse apb2otp block7 data register6.</description>
          <addressOffset>0x968</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W6</name>
              <description>Otp block7 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W7</name>
          <description>eFuse apb2otp block7 data register7.</description>
          <addressOffset>0x96c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W7</name>
              <description>Otp block7 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W8</name>
          <description>eFuse apb2otp block7 data register8.</description>
          <addressOffset>0x970</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W8</name>
              <description>Otp block7 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W9</name>
          <description>eFuse apb2otp block7 data register9.</description>
          <addressOffset>0x974</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W9</name>
              <description>Otp block7 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W10</name>
          <description>eFuse apb2otp block7 data register10.</description>
          <addressOffset>0x978</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W10</name>
              <description>Otp block7 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W11</name>
          <description>eFuse apb2otp block7 data register11.</description>
          <addressOffset>0x97c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W11</name>
              <description>Otp block7 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W1</name>
          <description>eFuse apb2otp block8 data register1.</description>
          <addressOffset>0x980</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W1</name>
              <description>Otp block8 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W2</name>
          <description>eFuse apb2otp block8 data register2.</description>
          <addressOffset>0x984</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W2</name>
              <description>Otp block8 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W3</name>
          <description>eFuse apb2otp block8 data register3.</description>
          <addressOffset>0x988</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W3</name>
              <description>Otp block8 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W4</name>
          <description>eFuse apb2otp block8 data register4.</description>
          <addressOffset>0x98c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W4</name>
              <description>Otp block8 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W5</name>
          <description>eFuse apb2otp block8 data register5.</description>
          <addressOffset>0x990</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W5</name>
              <description>Otp block8 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W6</name>
          <description>eFuse apb2otp block8 data register6.</description>
          <addressOffset>0x994</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W6</name>
              <description>Otp block8 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W7</name>
          <description>eFuse apb2otp block8 data register7.</description>
          <addressOffset>0x998</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W7</name>
              <description>Otp block8 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W8</name>
          <description>eFuse apb2otp block8 data register8.</description>
          <addressOffset>0x99c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W8</name>
              <description>Otp block8 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W9</name>
          <description>eFuse apb2otp block8 data register9.</description>
          <addressOffset>0x9a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W9</name>
              <description>Otp block8 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W10</name>
          <description>eFuse apb2otp block8 data register10.</description>
          <addressOffset>0x9a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W10</name>
              <description>Otp block8 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK8_W11</name>
          <description>eFuse apb2otp block8 data register11.</description>
          <addressOffset>0x9a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK8_W11</name>
              <description>Otp block8 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W1</name>
          <description>eFuse apb2otp block9 data register1.</description>
          <addressOffset>0x9ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W1</name>
              <description>Otp block9 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W2</name>
          <description>eFuse apb2otp block9 data register2.</description>
          <addressOffset>0x9b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W2</name>
              <description>Otp block9 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W3</name>
          <description>eFuse apb2otp block9 data register3.</description>
          <addressOffset>0x9b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W3</name>
              <description>Otp block9 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W4</name>
          <description>eFuse apb2otp block9 data register4.</description>
          <addressOffset>0x9b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W4</name>
              <description>Otp block9 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W5</name>
          <description>eFuse apb2otp block9 data register5.</description>
          <addressOffset>0x9bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W5</name>
              <description>Otp block9 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W6</name>
          <description>eFuse apb2otp block9 data register6.</description>
          <addressOffset>0x9c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W6</name>
              <description>Otp block9 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W7</name>
          <description>eFuse apb2otp block9 data register7.</description>
          <addressOffset>0x9c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W7</name>
              <description>Otp block9 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W8</name>
          <description>eFuse apb2otp block9 data register8.</description>
          <addressOffset>0x9c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W8</name>
              <description>Otp block9 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W9</name>
          <description>eFuse apb2otp block9 data register9.</description>
          <addressOffset>0x9cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W9</name>
              <description>Otp block9 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W10</name>
          <description>eFuse apb2otp block9 data register10.</description>
          <addressOffset>0x9d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W10</name>
              <description>Otp block9 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK9_W11</name>
          <description>eFuse apb2otp block9 data register11.</description>
          <addressOffset>0x9d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK9_W11</name>
              <description>Otp block9 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W1</name>
          <description>eFuse apb2otp block10 data register1.</description>
          <addressOffset>0x9d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W1</name>
              <description>Otp block10 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W2</name>
          <description>eFuse apb2otp block10 data register2.</description>
          <addressOffset>0x9dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W2</name>
              <description>Otp block10 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W3</name>
          <description>eFuse apb2otp block10 data register3.</description>
          <addressOffset>0x9e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W3</name>
              <description>Otp block10 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W4</name>
          <description>eFuse apb2otp block10 data register4.</description>
          <addressOffset>0x9e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W4</name>
              <description>Otp block10 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W5</name>
          <description>eFuse apb2otp block10 data register5.</description>
          <addressOffset>0x9e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W5</name>
              <description>Otp block10 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W6</name>
          <description>eFuse apb2otp block10 data register6.</description>
          <addressOffset>0x9ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W6</name>
              <description>Otp block10 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK10_W7</name>
          <description>eFuse apb2otp block10 data register7.</description>
          <addressOffset>0x9f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK10_W7</name>
              <description>Otp block10 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
