esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>B_ROI_REGION3</name>
          <description>Video B H264 ROI region3 range configure register.</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 3 in Video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 3 in Video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 3 in video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 3 in video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 3 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION4</name>
          <description>Video B H264 ROI region4 range configure register.</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 4 in Video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 4 in Video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 4 in video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 4 in video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 4 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION5</name>
          <description>Video B H264 ROI region5 range configure register.</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontial start macroblocks of region 5 video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 5 video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 5 video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 5 in video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 5 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION6</name>
          <description>Video B H264 ROI region6 range configure register.</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontial start macroblocks of region 6 video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 6 in video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 6 in video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 6 in video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 6 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION7</name>
          <description>Video B H264 ROI region7 range configure register.</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>X</name>
              <description>Configures the horizontal start macroblocks of region 7 in video B.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y</name>
              <description>Configures the  vertical start macroblocks of region 7 in video B.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>X_LEN</name>
              <description>Configures the number of  macroblocks in horizontal direction of  the region 7 in video B.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_LEN</name>
              <description>Configures the number of  macroblocks in vertical direction of  the region 7 in video B.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether or not to open Video B ROI of region 7 .\\0:Close ROI\\1:Open ROI.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION0_3_QP</name>
          <description>Video B H264 ROI region0, region1,region2,region3 QP register.</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B_ROI_REGION0_QP</name>
              <description>Configure H264 ROI region0 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_ROI_REGION1_QP</name>
              <description>Configure H264 ROI region1 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_ROI_REGION2_QP</name>
              <description>Configure H264 ROI region2 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_ROI_REGION3_QP</name>
              <description>Configure H264 ROI region3 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_REGION4_7_QP</name>
          <description>Video B H264 ROI region4, region5,region6,region7 QP register.</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B_ROI_REGION4_QP</name>
              <description>Configure H264 ROI region4 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_ROI_REGION5_QP</name>
              <description>Configure H264 ROI region5 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_ROI_REGION6_QP</name>
              <description>Configure H264 ROI region6 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_ROI_REGION7_QP</name>
              <description>Configure H264 ROI region7 qp in video B,fixed qp or delta qp.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_NO_ROI_REGION_QP_OFFSET</name>
          <description>Video B H264 no roi region QP register.</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B_NO_ROI_REGION_QP</name>
              <description>Configure H264 no region qp in video B, delta qp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ROI_CONFIG</name>
          <description>Video B H264 ROI configure register.</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>B_ROI_EN</name>
              <description>Configure whether or not to enable ROI in video B.\\0:not enable ROI\\1:enable ROI.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B_ROI_MODE</name>
              <description>Configure the mode of ROI in video B.\\0:fixed qp\\1:delta qp.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC_STATUS0</name>
          <description>Rate control status register0.</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FRAME_MAD_SUM</name>
              <description>Represents all MB actual MAD sum value of one frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC_STATUS1</name>
          <description>Rate control status register1.</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FRAME_ENC_BITS</name>
              <description>Represents all MB actual encoding bits sum value of one frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC_STATUS2</name>
          <description>Rate control status register2.</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FRAME_QP_SUM</name>
              <description>Represents all MB actual luma QP sum value of one frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLICE_HEADER_REMAIN</name>
          <description>Frame Slice Header remain bit register.</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLICE_REMAIN_BITLENGTH</name>
              <description>Configures Slice Header remain bit number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLICE_REMAIN_BIT</name>
              <description>Configures Slice Header remain bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLICE_HEADER_BYTE_LENGTH</name>
          <description>Frame Slice Header byte length register.</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLICE_BYTE_LENGTH</name>
              <description>Configures Slice Header byte number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BS_THRESHOLD</name>
          <description>Bitstream buffer overflow threshold register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x30</resetValue>
          <fields>
            <field>
              <name>BS_BUFFER_THRESHOLD</name>
              <description>Configures bitstream buffer overflow threshold. This value should be bigger than the encode bytes of one 4x4 submb.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLICE_HEADER_BYTE0</name>
          <description>Frame Slice Header byte low 32 bit  register.</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLICE_BYTE_LSB</name>
              <description>Configures Slice Header low 32 bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLICE_HEADER_BYTE1</name>
          <description>Frame Slice Header byte high 32 bit  register.</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLICE_BYTE_MSB</name>
              <description>Configures Slice Header high 32 bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw status register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DB_TMP_READY_INT_RAW</name>
              <description>Raw status bit: The raw interrupt status of  H264_DB_TMP_READY_INT. Triggered when H264 written enough db tmp pixel.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REC_READY_INT_RAW</name>
              <description>Raw status bit: The raw interrupt status of  H264_REC_READY_INT. Triggered when H264 encoding enough reconstruct pixel.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_DONE_INT_RAW</name>
              <description>Raw status bit: The raw interrupt status of  H264_FRAME_DONE_INT. Triggered when H264 encoding one frame done.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_MOVE_2MB_LINE_DONE_INT_RAW</name>
              <description>Raw status bit: The raw interrupt status of H264_DMA_MOVE_2MB_LINE_DONE_INT. Triggered when H264 move two MB lines of reference frame from external mem to internal mem done.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS_BUFFER_OVERFLOW_INT_RAW</name>
              <description>Raw status bit: The raw interrupt status of H264_BS_BUFFER_OVERFLOW_INT. Triggered when H264 bit stream buffer overflow.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt masked status register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DB_TMP_READY_INT_ST</name>
              <description>Masked status bit: The masked interrupt status of H264_DB_TMP_READY_INT. Valid only when the H264_DB_TMP_READY_INT_ENA is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REC_READY_INT_ST</name>
              <description>Masked status bit: The masked interrupt status of H264_REC_READY_INT. Valid only when the H264_REC_READY_INT_ENA is set to 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAME_DONE_INT_ST</name>
              <description>Masked status bit: The masked interrupt status of H264_FRAME_DONE_INT. Valid only when the H264_FRAME_DONE_INT_ENA is set to 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_MOVE_2MB_LINE_DONE_INT_ST</name>
              <description>Masked status bit: The masked interrupt status of H264_DMA_MOVE_2MB_LINE_DONE_INT. Valid only when the H264_DMA_MOVE_2MB_LINE_DONE_INT_ENA is set to 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BS_BUFFER_OVERFLOW_INT_ST</name>
              <description>Masked status bit: The masked interrupt status of H264_BS_BUFFER_OVERFLOW_INT. Valid only when the H264_BS_BUFFER_OVERFLOW_INT_ENA is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
