esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>DEBUG_INFO1</name>
          <description>Debug information register1.</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FME_CTRL_DEBUG_STATE</name>
              <description>Represents fme_ctrl module FSM info.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECI_CALC_DEBUG_STATE</name>
              <description>Represents deci_calc module's FSM info. DEV use only.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DB_DEBUG_STATE</name>
              <description>Represents db module FSM info.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAVLC_ENC_DEBUG_STATE</name>
              <description>Represents cavlc module enc FSM info.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAVLC_SCAN_DEBUG_STATE</name>
              <description>Represents cavlc module scan FSM info.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAVLC_CTRL_DEBUG_STATE</name>
              <description>Represents cavlc module ctrl FSM info.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_INFO2</name>
          <description>Debug information register2.</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>P_RC_DONE_DEBUG_FLAG</name>
              <description>Represents p rate ctrl done status.\\0: not done\\1: done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_P_I_CMP_DONE_DEBUG_FLAG</name>
              <description>Represents p p_i_cmp done status.\\0: not done\\1: done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_MV_MERGE_DONE_DEBUG_FLAG</name>
              <description>Represents p mv merge done status.\\0: not done\\1: done.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_MOVE_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents p move origin done status.\\0: not done\\1: done.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_MC_DONE_DEBUG_FLAG</name>
              <description>Represents p mc done status.\\0: not done\\1: done.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_IME_DONE_DEBUG_FLAG</name>
              <description>Represents p ime done status.\\0: not done\\1: done.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_GET_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents p get origin done status.\\0: not done\\1: done.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_FME_DONE_DEBUG_FLAG</name>
              <description>Represents p fme done status.\\0: not done\\1: done.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_FETCH_DONE_DEBUG_FLAG</name>
              <description>Represents p fetch done status.\\0: not done\\1: done.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_DB_DONE_DEBUG_FLAG</name>
              <description>Represents p deblocking done status.\\0: not done\\1: done.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>P_BS_BUF_DONE_DEBUG_FLAG</name>
              <description>Represents p bitstream buffer done status.\\0: not done\\1: done.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF_MOVE_2MB_LINE_DONE_DEBUG_FLAG</name>
              <description>Represents dma move 2 ref mb line done status.\\0: not done\\1: done.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_P_I_CMP_DONE_DEBUG_FLAG</name>
              <description>Represents I p_i_cmp done status.\\0: not done\\1: done.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_MOVE_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents I move origin done status.\\0: not done\\1: done.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_GET_ORI_DONE_DEBUG_FLAG</name>
              <description>Represents I get origin done status.\\0: not done\\1: done.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_EC_DONE_DEBUG_FLAG</name>
              <description>Represents I encoder done status.\\0: not done\\1: done.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_DB_DONE_DEBUG_FLAG</name>
              <description>Represents I deblocking done status.\\0: not done\\1: done.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I_BS_BUF_DONE_DEBUG_FLAG</name>
              <description>Represents I bitstream buffer done status.\\0: not done\\1: done.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0x2412300</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Configures the version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A_ORI_CONF</name>
          <description>Video A original picture configuration register.</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>A_ORI_COLOR_SPACE</name>
              <description>Configures video A original picture color space.\\0: RGB888\\1: RGB565\\2: YUV444\\3: YUV422\\4: YUV420\\5: GRAY\\Others: Invalid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>B_ORI_CONF</name>
          <description>Video B original picture configuration register.</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>B_ORI_COLOR_SPACE</name>
              <description>Configures video B original picture color space.\\0: RGB888\\1: RGB565\\2: YUV444\\3: YUV422\\4: YUV420\\5: GRAY\\Others: Invalid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORI_DEBUG_CONF</name>
          <description>Original picture debug configuration register.</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_ORI_DATA_EN</name>
              <description>Configures whether to replace original picture pixels.\\0: not replace\\1: replace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_REPLACE_ORI_DATA</name>
              <description>Configures original picture pixels to be replaced. When the original picture color space is RGB, byte0~2 is BGR. When the original picture color space is YUV, byte0~2 is VUY. When the original picture color space is GRAY, byte0 is GRAY.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MV_MERGE_DEBUG_CONF</name>
          <description>Original picture debug configuration register.</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_MV_MERGE_DATA_EN</name>
              <description>Configures whether to replace mv merge data.\\0: not replace\\1: replace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_REPLACE_MV_MERGE_DATA</name>
              <description>Configures mv merge data to be replaced.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BS_DEBUG_CONG</name>
          <description>Encode bitstream debug configuration register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_WR_BS_DATA_EN</name>
              <description>Configures whether or not to replace bs data.\\0: not replace\\1: replace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_REPLACE_WR_BS_DATA</name>
              <description>Configures bs data to be replaced</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DB_WR_TEMP_DEBUG_CONG</name>
          <description>Deblocking filter write temp debug configuration register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_WR_DB_TEMP_DATA_EN</name>
              <description>Configure deblocking fliter whether or not to replace write temp data.\\0: not replace\\1: replace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_REPLACE_WR_DB_TEMP_DATA</name>
              <description>Configure deblocking filter write temp data to be replaced.byte0~2 is VUY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DB_RD_TEMP_DEBUG_CONG</name>
          <description>Deblocking filter read temp debug configuration register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_RD_DB_TEMP_DATA_EN</name>
              <description>Configure deblocking fliter whether or not to replace read temp data.\\0: not replace\\1: replace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_REPLACE_RD_DB_TEMP_DATA</name>
              <description>Configure deblocking filter read temp data to be replaced.byte0~2 is VUY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DB_WR_DEBUG_CONG</name>
          <description>Deblocking filter final data debug configuration register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_WR_DB_DATA_EN</name>
              <description>Configure deblocking fliter whether or not to replace write data.\\0: not replace\\1: replace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_REPLACE_WR_DB_DATA</name>
              <description>Configure deblocking filter write data to be replaced.byte0~2 is VUY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_DEBUG_CONG</name>
          <description>Deblocking filter final data debug configuration register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DBG_REPLACE_REF_DATA_EN</name>
              <description>Configure whether to replace reference picture pixels.\\0: not replace\\1: replace</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_REPLACE_REF_DATA</name>
              <description>Configure reference picture pixels to be replaced.byte0~2 is VUY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
