esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>OUT_INT_CLR_CH4</name>
          <description>TX CH4  interrupt clr register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUT_DONE_CH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_EOF_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUT_EOF_CH_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_ERR_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_TOTAL_EOF_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L1_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L1_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_OVF_L2_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTFIFO_UDF_L2_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_DSCR_TASK_OVF_CH4_INT_CLR</name>
              <description>Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTFIFO_STATUS_CH4</name>
          <description>TX CH4 outfifo status register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <resetValue>0x20082</resetValue>
          <fields>
            <field>
              <name>OUTFIFO_FULL_L2_CH4</name>
              <description>Tx FIFO full signal for Tx channel 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_L2_CH4</name>
              <description>Tx FIFO empty signal for Tx channel 2.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_L2_CH4</name>
              <description>The register stores the byte number of the data in Tx FIFO for Tx channel 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_FULL_L1_CH4</name>
              <description>Tx FIFO full signal for Tx channel 2.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_L1_CH4</name>
              <description>Tx FIFO empty signal for Tx channel 2.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_L1_CH4</name>
              <description>The register stores the byte number of the data in Tx FIFO for Tx channel 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_FULL_L3_CH4</name>
              <description>Tx FIFO full signal for Tx channel 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_L3_CH4</name>
              <description>Tx FIFO empty signal for Tx channel 2.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_L3_CH4</name>
              <description>The register stores the byte number of the data in Tx FIFO for Tx channel 2.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PUSH_CH4</name>
          <description>TX CH4 outfifo push register</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_WDATA_CH4</name>
              <description>This register stores the data that need to be pushed into DMA Tx FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_PUSH_CH4</name>
              <description>Set this bit to push data into DMA Tx FIFO.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_CONF_CH4</name>
          <description>TX CH4 out_link dscr ctrl register</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <resetValue>0x800000</resetValue>
          <fields>
            <field>
              <name>OUTLINK_STOP_CH4</name>
              <description>Set this bit to stop dealing with the outlink descriptors.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_START_CH4</name>
              <description>Set this bit to start dealing with the outlink descriptors.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_RESTART_CH4</name>
              <description>Set this bit to restart a new outlink from the last address.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_PARK_CH4</name>
              <description>1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_LINK_ADDR_CH4</name>
          <description>TX CH4 out_link dscr addr register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH4</name>
              <description>This register stores the first outlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_STATE_CH4</name>
          <description>TX CH4 state register</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_ADDR_CH4</name>
              <description>This register stores the current outlink descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_STATE_CH4</name>
              <description>This register stores the current descriptor state machine state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_STATE_CH4</name>
              <description>This register stores the current control module state machine state.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EOF_DES_ADDR_CH4</name>
          <description>TX CH4 eof des addr register</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH4</name>
              <description>This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_CH4</name>
          <description>TX CH4 next dscr addr register</description>
          <addressOffset>0x42c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH4</name>
              <description>The address of the next outlink descriptor address y.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_BF0_CH4</name>
          <description>TX CH4 last dscr addr register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF0_CH4</name>
              <description>The address of the last outlink descriptor's next address y-1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_DSCR_BF1_CH4</name>
          <description>TX CH4 second-to-last dscr addr register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF1_CH4</name>
              <description>The address of the second-to-last outlink descriptor's next address y-2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_ARB_CH4</name>
          <description>TX CH4 arb register</description>
          <addressOffset>0x43c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>OUT_ARB_TOKEN_NUM_CH4</name>
              <description>Set the max number of token count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTER_OUT_ARB_PRIORITY_CH4</name>
              <description>Set the priority of channel</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_ETM_CONF_CH4</name>
          <description>TX CH4 ETM config register</description>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>OUT_ETM_EN_CH4</name>
              <description>Set this bit to 1 to enable ETM task function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_LOOP_EN_CH4</name>
              <description>when this bit is 1, dscr can be processed after receiving a task</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_TASK_MAK_CH4</name>
              <description>ETM dscr_ready maximum cache numbers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_BUF_LEN_CH4</name>
          <description>tx CH4 buf len register</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CMDFIFO_BUF_LEN_HB_CH4</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_FIFO_BCNT_CH4</name>
          <description>tx CH4 fifo byte cnt register</description>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CMDFIFO_OUTFIFO_BCNT_CH4</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PUSH_BYTECNT_CH4</name>
          <description>tx CH4 push byte cnt register</description>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>OUT_CMDFIFO_PUSH_BYTECNT_CH4</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_XADDR_CH4</name>
          <description>tx CH4 xaddr register</description>
          <addressOffset>0x47c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CMDFIFO_XADDR_CH4</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_BLOCK_BUF_LEN_CH4</name>
          <description>tx CH4 block buf len register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_BLOCK_BUF_LEN_CH4</name>
              <description>only for debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_CONF0_CH0</name>
          <description>RX CH0 config0 register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INDSCR_BURST_EN_CH0</name>
              <description>Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor when accessing SRAM.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ECC_AES_EN_CH0</name>
              <description>When access address space is ecc/aes area, this bit should be set to 1. In this case, the start address of square should be 16-bit aligned. The width of square multiply byte number of one pixel should be 16-bit aligned.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CHECK_OWNER_CH0</name>
              <description>Set this bit to enable checking the owner attribute of the link descriptor.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_MEM_BURST_LENGTH_CH0</name>
              <description>Block size of Rx channel 0. 0: single      1: 16 bytes      2: 32 bytes    3: 64 bytes    4: 128 bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_PAGE_BOUND_EN_CH0</name>
              <description>Set this bit to 1 to make sure AXI write data don't cross the address boundary which define by mem_burst_length</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_RST_CH0</name>
              <description>Write 1 then write 0 to this bit to reset Rx channel</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CMD_DISABLE_CH0</name>
              <description>Write 1 before reset and write 0 after reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_ARB_WEIGHT_OPT_DIS_CH0</name>
              <description>Set this bit to 1 to disable arbiter optimum weight function.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
