esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>RST_CONF</name>
          <description>axi reset config register</description>
          <addressOffset>0xb08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INTER_AXIM_RD_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master read data FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTER_AXIM_WR_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master write data FIFO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTER_AXIM_RD_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master read data FIFO.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTER_AXIM_WR_RST</name>
              <description>Write 1 then write 0  to this bit to reset axi master write data FIFO.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_START_ADDR0</name>
          <description>Start address of inter memory range0 register</description>
          <addressOffset>0xb0c</addressOffset>
          <size>32</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_START_ADDR0</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_END_ADDR0</name>
          <description>end address of inter memory range0 register</description>
          <addressOffset>0xb10</addressOffset>
          <size>32</size>
          <resetValue>0x8fffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_END_ADDR0</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_START_ADDR1</name>
          <description>Start address of inter memory range1 register</description>
          <addressOffset>0xb14</addressOffset>
          <size>32</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_START_ADDR1</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTER_MEM_END_ADDR1</name>
          <description>end address of inter memory range1 register</description>
          <addressOffset>0xb18</addressOffset>
          <size>32</size>
          <resetValue>0x8fffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTER_MEM_END_ADDR1</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_START_ADDR0</name>
          <description>Start address of exter memory range0 register</description>
          <addressOffset>0xb20</addressOffset>
          <size>32</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_START_ADDR0</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_END_ADDR0</name>
          <description>end address of exter memory range0 register</description>
          <addressOffset>0xb24</addressOffset>
          <size>32</size>
          <resetValue>0x8fffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_END_ADDR0</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_START_ADDR1</name>
          <description>Start address of exter memory range1 register</description>
          <addressOffset>0xb28</addressOffset>
          <size>32</size>
          <resetValue>0x30100000</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_START_ADDR1</name>
              <description>The start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTER_MEM_END_ADDR1</name>
          <description>end address of exter memory range1 register</description>
          <addressOffset>0xb2c</addressOffset>
          <size>32</size>
          <resetValue>0x8fffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_EXTER_MEM_END_ADDR1</name>
              <description>The end address of accessible address space. The access address beyond this range would lead to descriptor error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_ARB_CONFIG</name>
          <description>reserved</description>
          <addressOffset>0xb30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_ARB_TIMEOUT_NUM</name>
              <description>Set the max number of timeout count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_WEIGHT_EN</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_ARB_CONFIG</name>
          <description>reserved</description>
          <addressOffset>0xb34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_ARB_TIMEOUT_NUM</name>
              <description>Set the max number of timeout count of arbiter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_WEIGHT_EN</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>reserved</description>
          <addressOffset>0xb3c</addressOffset>
          <size>32</size>
          <resetValue>0x20230403</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNTER_RST</name>
          <description>counter reset register</description>
          <addressOffset>0xb50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CH0_EXTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch0 counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH1_EXTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch1 counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH2_INTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch2 counter.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CH5_INTER_COUNTER_RST</name>
              <description>Write 1 then write 0 to this bit to reset rx ch5 counter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH0_COUNTER</name>
          <description>rx ch0 counter register</description>
          <addressOffset>0xb54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CH0_CNT</name>
              <description>rx ch0 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH1_COUNTER</name>
          <description>rx ch1 counter register</description>
          <addressOffset>0xb58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CH1_CNT</name>
              <description>rx ch1 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH2_COUNTER</name>
          <description>rx ch2 counter register</description>
          <addressOffset>0xb5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CH2_CNT</name>
              <description>rx ch2 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CH5_COUNTER</name>
          <description>rx ch5 counter register</description>
          <addressOffset>0xb60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CH5_CNT</name>
              <description>rx ch5 counter register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBYTE</name>
          <description>image pbyte register</description>
          <addressOffset>0xb64</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>ORI_PBYTE</name>
              <description>configures bytes per pixel for ori img. 0: 0.5byte/pix, 1: 1byte/pix, 2: 1.5byte/pix, 3: 2byte/pix, 4: 3byte/pix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_DBG_EN</name>
          <description>channel debug enable register</description>
          <addressOffset>0xb68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH0_DBG_EN</name>
              <description>configures whether to enable out channel 0 debug. 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_OUT_CH1_DBG_EN</name>
              <description>configures whether to enable out channel 1 debug. 0: disable, 1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_OUT_CH2_DBG_EN</name>
              <description>configures whether to enable out channel 2 debug. 0: disable, 1: enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_OUT_CH3_DBG_EN</name>
              <description>configures whether to enable out channel 3 debug. 0: disable, 1: enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_OUT_CH4_DBG_EN</name>
              <description>configures whether to enable out channel 4 debug. 0: disable, 1: enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_IN_CH0_DBG_EN</name>
              <description>configures whether to enable in channel 0 debug. 0: disable, 1: enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_IN_CH1_DBG_EN</name>
              <description>configures whether to enable in channel 1 debug. 0: disable, 1: enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_IN_CH2_DBG_EN</name>
              <description>configures whether to enable in channel 2 debug. 0: disable, 1: enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_IN_CH3_DBG_EN</name>
              <description>configures whether to enable in channel 3 debug. 0: disable, 1: enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_IN_CH4_DBG_EN</name>
              <description>configures whether to enable in channel 4 debug. 0: disable, 1: enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>H264_IN_CH5_DBG_EN</name>
              <description>configures whether to enable in channel 5 debug. 0: disable, 1: enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH0_DBG_DATA_L</name>
          <description>out channel 0 debug data register</description>
          <addressOffset>0xb6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH0_DBG_DATA_L</name>
              <description>configures out channel 0 debug data bit 31-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH0_DBG_DATA_H</name>
          <description>out channel 0 debug data register</description>
          <addressOffset>0xb70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH0_DBG_DATA_H</name>
              <description>configures out channel 0 debug data bit 63-32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH1_DBG_DATA_L</name>
          <description>out channel 1 debug data register</description>
          <addressOffset>0xb74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH1_DBG_DATA_L</name>
              <description>configures out channel 1 debug data bit 31-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH1_DBG_DATA_H</name>
          <description>out channel 1 debug data register</description>
          <addressOffset>0xb78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH1_DBG_DATA_H</name>
              <description>configures out channel 1 debug data bit 63-32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH2_DBG_DATA_L</name>
          <description>out channel 2 debug data register</description>
          <addressOffset>0xb7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH2_DBG_DATA_L</name>
              <description>configures out channel 2 debug data bit 31-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH2_DBG_DATA_H</name>
          <description>out channel 2 debug data register</description>
          <addressOffset>0xb80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH2_DBG_DATA_H</name>
              <description>configures out channel 2 debug data bit 63-32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH3_DBG_DATA_L</name>
          <description>out channel 3 debug data register</description>
          <addressOffset>0xb84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH3_DBG_DATA_L</name>
              <description>configures out channel 3 debug data bit 31-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH3_DBG_DATA_H</name>
          <description>out channel 3 debug data register</description>
          <addressOffset>0xb88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH3_DBG_DATA_H</name>
              <description>configures out channel 3 debug data bit 63-32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH4_DBG_DATA_L</name>
          <description>out channel 4 debug data register</description>
          <addressOffset>0xb8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH4_DBG_DATA_L</name>
              <description>configures out channel 4 debug data bit 31-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CH4_DBG_DATA_H</name>
          <description>out channel 4 debug data register</description>
          <addressOffset>0xb90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_OUT_CH4_DBG_DATA_H</name>
              <description>configures out channel 4 debug data bit 63-32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_CH0_DBG_DATA_L</name>
          <description>in channel 0 debug data register</description>
          <addressOffset>0xb94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_IN_CH0_DBG_DATA_L</name>
              <description>configures in channel 0 debug data bit 31-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_CH0_DBG_DATA_H</name>
          <description>in channel 0 debug data register</description>
          <addressOffset>0xb98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>H264_IN_CH0_DBG_DATA_H</name>
              <description>configures in channel 0 debug data bit 63-32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
