esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_SYS</name>
      <description>High-Power System</description>
      <groupName>HP_SYS</groupName>
      <baseAddress>0x500e5000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1a4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ETH_MAC</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>HP_SYS</name>
        <value>110</value>
      </interrupt>
      <registers>
        <register>
          <name>VER_DATE</name>
          <description>NA</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x20250307</resetValue>
          <fields>
            <field>
              <name>HP_REG_VER_DATE</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CLK_EN</name>
          <description>NA</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_CLK_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_0</name>
          <description>NA</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_0</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_1</name>
          <description>NA</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_1</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_2</name>
          <description>NA</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_2</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_INT_FROM_CPU_3</name>
          <description>NA</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_INT_FROM_CPU_3</name>
              <description>set 1 will triger a interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CACHE_CLK_CONFIG</name>
          <description>NA</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x33</resetValue>
          <fields>
            <field>
              <name>HP_REG_L2_CACHE_CLK_ON</name>
              <description>l2 cahce clk enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L1_D_CACHE_CLK_ON</name>
              <description>l1 dcahce clk enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L1_I1_CACHE_CLK_ON</name>
              <description>l1 icahce1 clk enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L1_I0_CACHE_CLK_ON</name>
              <description>l1 icahce0 clk enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CACHE_RESET_CONFIG</name>
          <description>NA</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_L1_D_CACHE_RESET</name>
              <description>set 1 to reset l1 dcahce</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L1_I1_CACHE_RESET</name>
              <description>set 1 to reset l1 icahce1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L1_I0_CACHE_RESET</name>
              <description>set 1 to reset l1 icahce0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_ADDR_CTRL</name>
          <description>NA</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_SYS_DMA_ADDR_SEL</name>
              <description>0 means dma access extmem use 8xxx_xxxx else use 4xxx_xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_RAM_WRR_CONFIG</name>
          <description>NA</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x826ed93f</resetValue>
          <fields>
            <field>
              <name>HP_REG_TCM_RAM_IBUS0_WT</name>
              <description>weight value of ibus0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_IBUS1_WT</name>
              <description>weight value of ibus1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_IBUS2_WT</name>
              <description>weight value of ibus2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_IBUS3_WT</name>
              <description>weight value of ibus3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_DBUS0_WT</name>
              <description>weight value of dbus0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_DBUS1_WT</name>
              <description>weight value of dbus1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_DBUS2_WT</name>
              <description>weight value of dbus2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_DBUS3_WT</name>
              <description>weight value of dbus3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_DMA_WT</name>
              <description>weight value of dma</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_RAM_WRR_HIGH</name>
              <description>enable weighted round robin arbitration</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_SW_PARITY_BWE_MASK</name>
          <description>NA</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_TCM_SW_PARITY_BWE_MASK_CTRL</name>
              <description>Set 1 to mask tcm bwe parity code bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_RAM_PWR_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_HP_TCM_CLK_FORCE_ON</name>
              <description>hp_tcm clk gatig force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_ROM_PWR_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_L2_ROM_CLK_FORCE_ON</name>
              <description>l2_rom clk gating force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PROBEA_CTRL</name>
          <description>NA</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_PROBE_A_MOD_SEL</name>
              <description>Tihs field is used to selec probe_group from probe_group0 to probe_group15 for module's probe_out[31:0] in a mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_A_TOP_SEL</name>
              <description>Tihs field is used to selec module's probe_out[31:0] as probe out in a mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_L_SEL</name>
              <description>Tihs field is used to selec probe_out[31:16]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_H_SEL</name>
              <description>Tihs field is used to selec probe_out[31:16]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_GLOBAL_EN</name>
              <description>Set this bit to enable global debug probe in hp system.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PROBEB_CTRL</name>
          <description>NA</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_PROBE_B_MOD_SEL</name>
              <description>Tihs field is used to selec probe_group from probe_group0 to probe_group15 for module's probe_out[31:0] in b mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_B_TOP_SEL</name>
              <description>Tihs field is used to select module's probe_out[31:0]  as probe_out in b mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_PROBE_B_EN</name>
              <description>Set this bit to enable b mode for debug probe. 1:  b mode, 0: a mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PROBE_OUT</name>
          <description>NA</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_PROBE_TOP_OUT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_RAM_PWR_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_L2_MEM_CLK_FORCE_ON</name>
              <description>l2ram clk_gating force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_CORESTALLED_ST</name>
          <description>NA</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_CORE0_CORESTALLED_ST</name>
              <description>hp core0 corestalled status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_CORE1_CORESTALLED_ST</name>
              <description>hp core1 corestalled status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CRYPTO_CTRL</name>
          <description>NA</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_ENABLE_SPI_MANUAL_ENCRYPT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_ENABLE_DOWNLOAD_DB_ENCRYPT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_ENABLE_DOWNLOAD_G0CB_DECRYPT</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_ENABLE_DOWNLOAD_MANUAL_ENCRYPT</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPIO_O_HOLD_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_GPIO_0_HOLD_LOW</name>
              <description>hold control for gpio47~16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPIO_O_HOLD_CTRL1</name>
          <description>NA</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_GPIO_0_HOLD_HIGH</name>
              <description>hold control for gpio56~48</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_CS</name>
          <description>NA</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_HP_SYS_RDN_ECO_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_HP_SYS_RDN_ECO_RESULT</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CACHE_APB_POSTW_EN</name>
          <description>NA</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_CACHE_APB_POSTW_EN</name>
              <description>cache apb register interface post write enable, 1 will speed up write, but will take some time to update value to register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_SUBSIZE</name>
          <description>NA</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_L2_MEM_SUB_BLKSIZE</name>
              <description>l2mem sub block size 00=&gt;32 01=&gt;64 10=&gt;128 11=&gt;256</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_INT_RAW</name>
          <description>NA</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_L2_MEM_ECC_ERR_INT_RAW</name>
              <description>intr triggered when two bit error detected and corrected from ecc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_EXCEED_ADDR_INT_RAW</name>
              <description>intr triggered when access addr exceeds 0xff9ffff at bypass mode or exceeds 0xff80000 at l2cache 128kb mode or exceeds 0xff60000 at l2cache 256kb mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_ERR_RESP_INT_RAW</name>
              <description>intr triggered when err response occurs</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_INT_ST</name>
          <description>NA</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_L2_MEM_ECC_ERR_INT_ST</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_EXCEED_ADDR_INT_ST</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_ERR_RESP_INT_ST</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_INT_ENA</name>
          <description>NA</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_L2_MEM_ECC_ERR_INT_ENA</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_EXCEED_ADDR_INT_ENA</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_ERR_RESP_INT_ENA</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
