esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>GDMA_CTRL</name>
          <description>N/A</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEBUG_CH_NUM</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_CTRL0</name>
          <description>N/A</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PTP_PPS</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBD_FLOWCTRL</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_INTF_SEL</name>
              <description>N/A</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC_MEM_CLK_FORCE_ON</name>
              <description>N/A</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMAC_RST_CLK_TX_N</name>
              <description>N/A</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GMAC_RST_CLK_RX_N</name>
              <description>N/A</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_CTRL1</name>
          <description>N/A</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PTP_TIMESTAMP_L</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GMAC_CTRL2</name>
          <description>N/A</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PTP_TIMESTAMP_H</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VPU_CTRL</name>
          <description>N/A</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PPA_LSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_SDSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_LSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG_DSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D_LSLP_MEM_PD</name>
              <description>N/A</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOTG20_CTRL</name>
          <description>N/A</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0x822640</resetValue>
          <fields>
            <field>
              <name>OTG_PHY_TEST_DONE</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_MEM_AUX_CTRL</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_SUSPENDM</name>
              <description>N/A</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_SUSPEND_FORCE_EN</name>
              <description>N/A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_RSTN</name>
              <description>N/A</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_RESET_FORCE_EN</name>
              <description>N/A</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_PLL_FORCE_EN</name>
              <description>N/A</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_PLL_EN</name>
              <description>N/A</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_SUSPENDM</name>
              <description>N/A</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_PHY_TXBITSTUFF_EN</name>
              <description>N/A</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_PHY_REFCLK_MODE</name>
              <description>N/A</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_PHY_BISTEN</name>
              <description>N/A</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_ERR_RESP_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_TCM_ERR_RESP_EN</name>
              <description>Set 1 to turn on tcm error response</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_REFRESH</name>
          <description>NA</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
              <name>HP_REG_L2_MEM_UNIT0_REFERSH_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT1_REFERSH_EN</name>
              <description>NA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT2_REFERSH_EN</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT3_REFERSH_EN</name>
              <description>NA</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT4_REFERSH_EN</name>
              <description>NA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT5_REFERSH_EN</name>
              <description>NA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_REFERSH_CNT_RESET</name>
              <description>Set 1 to reset l2mem_refresh_cnt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT0_REFRESH_DONE</name>
              <description>NA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT1_REFRESH_DONE</name>
              <description>NA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT2_REFRESH_DONE</name>
              <description>NA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT3_REFRESH_DONE</name>
              <description>NA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT4_REFRESH_DONE</name>
              <description>NA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_REG_L2_MEM_UNIT5_REFRESH_DONE</name>
              <description>NA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_INIT</name>
          <description>NA</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>HP_REG_TCM_INIT_EN</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_INIT_CNT_RESET</name>
              <description>Set 1 to reset tcm init cnt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_REG_TCM_INIT_DONE</name>
              <description>NA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_TCM_PARITY_CHECK_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_TCM_PARITY_CHECK_EN</name>
              <description>Set 1 to turn on tcm parity check</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_DESIGN_FOR_VERIFICATION0</name>
          <description>need_des</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_DFV0</name>
              <description>register for DV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_DESIGN_FOR_VERIFICATION1</name>
          <description>need_des</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_DFV1</name>
              <description>register for DV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PSRAM_FLASH_ADDR_INTERCHANGE</name>
          <description>need_des</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU</name>
              <description>Set 1 to enable addr interchange between psram and flash in axi matrix when hp cpu access through cache</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA</name>
              <description>Set 1 to enable addr interchange between psram and flash in axi matrix when dma device access, lp core access and hp core access through ahb</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_RAW</name>
          <description>NA</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_RAW</name>
              <description>the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in post write mode in ahb2axi.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_ST</name>
          <description>need_des</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_ST</name>
              <description>the masked interrupt status of  cpu_icm_h2x_bresp_err</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_ENA</name>
          <description>need_des</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_ENA</name>
              <description>Write 1 to enable cpu_icm_h2x_bresp_err int</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_AHB2AXI_BRESP_ERR_INT_CLR</name>
          <description>need_des</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CPU_ICM_H2X_BRESP_ERR_INT_CLR</name>
              <description>Write 1 to clear cpu_icm_h2x_bresp_err  int</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_ERR_RESP_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_L2_MEM_ERR_RESP_EN</name>
              <description>Set 1 to turn on l2mem error response</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_L2_MEM_AHB_BUFFER_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_L2_MEM_AHB_WRBUFFER_EN</name>
              <description>Set 1 to turn on l2mem ahb wr buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_L2_MEM_AHB_RDBUFFER_EN</name>
              <description>Set 1 to turn on l2mem ahb rd buffer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_DMACTIVE_LPCORE</name>
          <description>need_des</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE_DMACTIVE_LPCORE</name>
              <description>hp core dmactive_lpcore value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_ERR_RESP_DIS</name>
          <description>need_des</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE_ERR_RESP_DIS</name>
              <description>Set bit0 to disable ibus err resp. Set bit1 to disable dbus err resp.  Set bit 2 to disable ahb err resp.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_TIMEOUT_INT_RAW</name>
          <description>Hp core bus timeout interrupt raw register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_AHB_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core0  ahb timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_AHB_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core1  ahb timeout</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core0  ibus timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core1  ibus timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core0  dbus timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of hp core1  dbus timeout</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
