esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>HP_CORE_TIMEOUT_INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_AHB_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  ahb timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE1_AHB_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  ahb timeout</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  ibus timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  ibus timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core0  dbus timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of hp core1  dbus timeout</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_TIMEOUT_INT_ENA</name>
          <description>masked interrupt register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_AHB_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_ahb_timeout int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_AHB_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_ahb_timeout int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_ibus_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core0_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable hp_core1_dbus_timeout int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CORE_TIMEOUT_INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_AHB_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_ahb_timeout int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE1_AHB_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_ahb_timeout int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE0_IBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_ibus_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE1_IBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE0_DBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core0_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_CORE1_DBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear hp_core1_dbus_timeout int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPIO_O_HYS_CTRL0</name>
          <description>NA</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_GPIO_0_HYS_LOW</name>
              <description>hys control for gpio47~16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_GPIO_O_HYS_CTRL1</name>
          <description>NA</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_REG_GPIO_0_HYS_HIGH</name>
              <description>hys control for gpio56~48</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_RSA_PD_CTRL</name>
          <description>rsa pd ctrl register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>HP_RSA_MEM_FORCE_PD</name>
              <description>Set this bit to power down rsa internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_RSA_MEM_FORCE_PU</name>
              <description>Set this bit to force power up rsa internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_RSA_MEM_PD</name>
              <description>Set this bit to force power down rsa internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ECC_PD_CTRL</name>
          <description>ecc pd ctrl register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>HP_ECC_MEM_FORCE_PD</name>
              <description>Set this bit to power down ecc internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ECC_MEM_FORCE_PU</name>
              <description>Set this bit to force power up ecc internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ECC_MEM_PD</name>
              <description>Set this bit to force power down ecc internal memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_RNG_CFG</name>
          <description>rng cfg register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_RNG_SAMPLE_ENABLE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_RNG_CHAIN_CLK_DIV_NUM</name>
              <description>chain clk div num to pad for debug</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_UART_PD_CTRL</name>
          <description>ecc pd ctrl register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>HP_UART_MEM_FORCE_PD</name>
              <description>Set this bit to power down hp uart internal memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_UART_MEM_FORCE_PU</name>
              <description>Set this bit to force power up hp uart  internal memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_MEM_CLK_FORCE_ON</name>
          <description>hp peri mem clk force on regpster</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_RMT_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on mem clk in rmt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_BITSCRAMBLER_TX_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on tx mem clk in bitscrambler</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_BITSCRAMBLER_RX_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on rx mem clk in bitscrambler</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_GDMA_MEM_CLK_FORCE_ON</name>
              <description>Set this bit to force on mem clk in gdma</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_USB_OTGHS_PHY_ST</name>
          <description>Usb otg2.0 PHY status register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_USB_SOFT_RESET_ACTV_PDOMAIN</name>
              <description>Todo</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_UTMISRP_SESSEND</name>
              <description>Todo</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_UTMIOTG_VBUSVALID</name>
              <description>Todo</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_UTMISRP_BVALID</name>
              <description>Todo</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_UTMISRP_SESSVALID</name>
              <description>Todo</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_CPU_WAKEUP_EVENT</name>
          <description>cpu wakeup event ctrl register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_CORE0_WAKEUP_EVENT</name>
              <description>Set this bit to wake up hp core0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CORE1_WAKEUP_EVENT</name>
              <description>Set this bit to wake up hp core1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP0_EN</name>
          <description>HpP2LP Interrupt Enable Register Group0</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP0_EN</name>
              <description>Set each bit to enable corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP1_EN</name>
          <description>HpP2LP Interrupt Enable Register Group1</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP1_EN</name>
              <description>Set each bit to enable corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP2_EN</name>
          <description>HpP2LP Interrupt Enable Register Group2</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP2_EN</name>
              <description>Set each bit to enable corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP3_EN</name>
          <description>HpP2LP Interrupt Enable Register Group3</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0x3fff</resetValue>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP3_EN</name>
              <description>Set each bit to enable corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP0_ST</name>
          <description>HpP2LP Interrupt Status Register Group0</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP0_ST</name>
              <description>Each bit indicates the status of corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP1_ST</name>
          <description>HpP2LP Interrupt Enable Register Group1</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP1_ST</name>
              <description>Each bit indicates the status of corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP2_ST</name>
          <description>HpP2LP Interrupt Enable Register Group2</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP2_ST</name>
              <description>Each bit indicates the status of corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_INTR_GROUP3_ST</name>
          <description>HpP2LP Interrupt Enable Register Group3</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_INTR_GROUP3_ST</name>
              <description>Each bit indicates the status of corresponding peripheral interrupt to LP CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_WAKEUP_GROUP0_EN</name>
          <description>HpP2LP Wakeup Enable Register Group0</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_WAKEUP_GROUP0_EN</name>
              <description>Set each bit to enable corresponding peripheral wakeup to PMU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_WAKEUP_GROUP1_EN</name>
          <description>HpP2LP Wakeup Enable Register Group1</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_WAKEUP_GROUP1_EN</name>
              <description>Set each bit to enable corresponding peripheral wakeup to PMU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_WAKEUP_GROUP2_EN</name>
          <description>HpP2LP Wakeup Enable Register Group2</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_WAKEUP_GROUP2_EN</name>
              <description>Set each bit to enable corresponding peripheral wakeup to PMU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_HP2LP_WAKEUP_GROUP3_EN</name>
          <description>HpP2LP Wakeup Enable Register Group3</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_H2LP_WAKEUP_GROUP3_EN</name>
              <description>Set each bit to enable corresponding peripheral wakeup to PMU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
