esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>HP_FORCE_NORST1</name>
          <description>Reserved</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_FORCE_NORST_I3CSLV</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_I2C1</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_I2C0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_RMT</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_PWM0</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_PWM1</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_CAN0</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_CAN1</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_CAN2</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_LEDC</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_PCNT</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_ETM</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_INTRMTX</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_PARLIO</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_PARLIO_RX</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_PARLIO_TX</name>
              <description>Reserved</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_I2S0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_I2S1</name>
              <description>Reserved</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_I2S2</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_SPI2</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_SPI3</name>
              <description>Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_LCDCAM</name>
              <description>Reserved</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_ADC</name>
              <description>Reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_BITSRAMBLER</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_BITSRAMBLER_RX</name>
              <description>Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_BITSRAMBLER_TX</name>
              <description>Reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_FORCE_NORST_H264</name>
              <description>Reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPWDT_CORE0_RST_CTRL0</name>
          <description>Reserved</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0x1011</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE0_STALL_EN</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE0_STALL_WAIT_NUM</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_WDT_HPCORE0_RST_LEN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPWDT_CORE1_RST_CTRL0</name>
          <description>Reserved</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x1011</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE1_STALL_EN</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE1_STALL_WAIT_NUM</name>
              <description>Reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_WDT_HPCORE1_RST_LEN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_SRC_FREQ0</name>
          <description>CPU Source Frequency</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_CPU_SRC_FREQ</name>
              <description>cpu source clock frequency, step by 0.25MHz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_CLK_STATUS0</name>
          <description>CPU Clock Status</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_ASIC_OR_FPGA</name>
              <description>0: ASIC mode, 1: FPGA mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_EFFECT</name>
              <description>0: Divider bypass, 1: Divider takes effect</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_SRC_IS_CPLL</name>
              <description>0: CPU source isn't cpll_400m, 1: CPU Source is cll_400m</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_NUM_CUR</name>
              <description>cpu current div number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_NUMERATOR_CUR</name>
              <description>cpu current div numerator</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_CPU_DIV_DENOMINATOR_CUR</name>
              <description>cpu current div denominator</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_CLK_CTRL0</name>
          <description>Reserved</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0x3ffffff</resetValue>
          <fields>
            <field>
              <name>REG_DBG_CH0_SEL</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH1_SEL</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_SEL</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH0_DIV_NUM</name>
              <description>Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_CLK_CTRL1</name>
          <description>Reserved</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x303</resetValue>
          <fields>
            <field>
              <name>REG_DBG_CH1_DIV_NUM</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_DIV_NUM</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH0_EN</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH1_EN</name>
              <description>Reserved</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_DBG_CH2_EN</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPCORE_WDT_RESET_SOURCE0</name>
          <description>Reserved</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>REG_HPCORE0_WDT_RESET_SOURCE_SEL</name>
              <description>1'b0: use wdt0 to reset hpcore0, 1'b1: use wdt1 to reset hpcore0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_HPCORE1_WDT_RESET_SOURCE_SEL</name>
              <description>1'b0: use wdt0 to reset hpcore1, 1'b1: use wdt1 to reset hpcore1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_PERF_MON_CLKRST_CTRL0</name>
          <description>Reserved</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_AXI_PERF_MON_SYS_CLK_EN</name>
              <description>Configures axi_perf_mon clk enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_AXI_PERF_MON_SYS_RST_EN</name>
              <description>Configures axi_perf_mon rst enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_WAITI_CTRL0</name>
          <description>Reserved</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>REG_CORE0_WAITI_ICG_EN</name>
              <description>Configures whether cpu core0 waiti signal can control clock gate. If both core0 and core1 waiti_icg_en is 1, then only when core0 and core1 all in waiti will close related clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REG_CORE1_WAITI_ICG_EN</name>
              <description>Configures whether cpu core1 waiti signal can control clock gate. If both core0 and core1 waiti_icg_en is 1, then only when core0 and core1 all in waiti will close related clock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
