esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>gpio24</name>
          <description>iomux control register for gpio24</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0xc00</resetValue>
          <fields>
            <field>
              <name>GPIO24_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO24_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gpio25</name>
          <description>iomux control register for gpio25</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0xc00</resetValue>
          <fields>
            <field>
              <name>GPIO25_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO25_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gpio26</name>
          <description>iomux control register for gpio26</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>GPIO26_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO26_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gpio27</name>
          <description>iomux control register for gpio27</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>GPIO27_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO27_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gpio28</name>
          <description>iomux control register for gpio28</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>GPIO28_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO28_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gpio29</name>
          <description>iomux control register for gpio29</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>GPIO29_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO29_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
