esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>gpio54</name>
          <description>iomux control register for gpio54</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>GPIO54_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO54_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gpio55</name>
          <description>iomux control register for gpio55</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>GPIO55_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO55_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>gpio56</name>
          <description>iomux control register for gpio56</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0x800</resetValue>
          <fields>
            <field>
              <name>GPIO56_MCU_OE</name>
              <description>output enable on sleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_SLP_SEL</name>
              <description>io sleep mode enable. set 1 to enable sleep mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_MCU_WPD</name>
              <description>pull-down enable on sleep mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_MCU_WPU</name>
              <description>pull-up enable on sleep mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_MCU_IE</name>
              <description>input enable on sleep mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_MCU_DRV</name>
              <description>select drive strenth on sleep mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_FUN_WPD</name>
              <description>pull-down enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_FUN_WPU</name>
              <description>pull-up enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_FUN_IE</name>
              <description>input enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_FUN_DRV</name>
              <description>select drive strenth, 0:5mA, 1:10mA, 2:20mA, 3:40mA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_MCU_SEL</name>
              <description>0:select function0, 1:select function1 ...</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO56_FILTER_EN</name>
              <description>input filter enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>iomux version</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x201222</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>csv date</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
