esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ISP</name>
      <description>ISP Peripheral</description>
      <groupName>ISP</groupName>
      <baseAddress>0x500a1000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x274</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ISP</name>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>VER_DATE</name>
          <description>version control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x20210608</resetValue>
          <fields>
            <field>
              <name>VER_DATA</name>
              <description>csv version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN</name>
          <description>isp clk control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>this bit configures the clk force on of isp reg. 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_BLC_FORCE_ON</name>
              <description>this bit configures the clk force on of blc. 0: disable, 1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DPC_FORCE_ON</name>
              <description>this bit configures the clk force on of dpc. 0: disable, 1: enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_BF_FORCE_ON</name>
              <description>this bit configures the clk force on of bf. 0: disable, 1: enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_LSC_FORCE_ON</name>
              <description>this bit configures the clk force on of lsc. 0: disable, 1: enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DEMOSAIC_FORCE_ON</name>
              <description>this bit configures the clk force on of demosaic. 0: disable, 1: enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_MEDIAN_FORCE_ON</name>
              <description>this bit configures the clk force on of median. 0: disable, 1: enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_CCM_FORCE_ON</name>
              <description>this bit configures the clk force on of ccm. 0: disable, 1: enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_GAMMA_FORCE_ON</name>
              <description>this bit configures the clk force on of gamma. 0: disable, 1: enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_RGB2YUV_FORCE_ON</name>
              <description>this bit configures the clk force on of rgb2yuv. 0: disable, 1: enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SHARP_FORCE_ON</name>
              <description>this bit configures the clk force on of sharp. 0: disable, 1: enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_COLOR_FORCE_ON</name>
              <description>this bit configures the clk force on of color. 0: disable, 1: enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_YUV2RGB_FORCE_ON</name>
              <description>this bit configures the clk force on of yuv2rgb. 0: disable, 1: enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_AE_FORCE_ON</name>
              <description>this bit configures the clk force on of ae. 0: disable, 1: enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_AF_FORCE_ON</name>
              <description>this bit configures the clk force on of af. 0: disable, 1: enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_AWB_FORCE_ON</name>
              <description>this bit configures the clk force on of awb. 0: disable, 1: enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_HIST_FORCE_ON</name>
              <description>this bit configures the clk force on of hist. 0: disable, 1: enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_MIPI_IDI_FORCE_ON</name>
              <description>this bit configures the clk force on of mipi idi input. 0: disable, 1: enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_MEM_CLK_FORCE_ON</name>
              <description>this bit configures the clk force on of all isp memory. 0: disable, 1: enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_CROP_FORCE_ON</name>
              <description>this bit configures the clk force on of crop. 0: disable, 1: enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_WBG_FORCE_ON</name>
              <description>this bit configures the clk force on of wbg. 0: disable, 1: enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTL</name>
          <description>isp module enable control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x40002442</resetValue>
          <fields>
            <field>
              <name>MIPI_DATA_EN</name>
              <description>this bit configures mipi input data enable. 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_EN</name>
              <description>this bit configures isp global enable. 0: disable, 1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_EN</name>
              <description>this bit configures blc enable. 0: disable, 1: enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_EN</name>
              <description>this bit configures dpc enable. 0: disable, 1: enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BF_EN</name>
              <description>this bit configures bf enable. 0: disable, 1: enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSC_EN</name>
              <description>this bit configures lsc enable. 0: disable, 1: enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOSAIC_EN</name>
              <description>this bit configures demosaic enable. 0: disable, 1: enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEDIAN_EN</name>
              <description>this bit configures median enable. 0: disable, 1: enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_EN</name>
              <description>this bit configures ccm enable. 0: disable, 1: enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_EN</name>
              <description>this bit configures gamma enable. 0: disable, 1: enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB2YUV_EN</name>
              <description>this bit configures rgb2yuv enable. 0: disable, 1: enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_EN</name>
              <description>this bit configures sharp enable. 0: disable, 1: enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_EN</name>
              <description>this bit configures color enable. 0: disable, 1: enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV2RGB_EN</name>
              <description>this bit configures yuv2rgb enable. 0: disable, 1: enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_EN</name>
              <description>this bit configures ae enable. 0: disable, 1: enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_EN</name>
              <description>this bit configures af enable. 0: disable, 1: enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_EN</name>
              <description>this bit configures awb enable. 0: disable, 1: enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIST_EN</name>
              <description>this bit configures hist enable. 0: disable, 1: enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CROP_EN</name>
              <description>this bit configures crop enable. 0: disable, 1: enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBG_EN</name>
              <description>this bit configures wbg enable. 0: disable, 1: enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_ENDIAN_ORDER</name>
              <description>select input idi data byte_endian_order when isp is bypass, 0: csi_data[31:0], 1: {[7:0], [15:8], [23:16], [31:24]}</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_DATA_TYPE</name>
              <description>this field configures input data type, 0:RAW8 1:RAW10 2:RAW12</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_IN_SRC</name>
              <description>this field configures input data source, 0:CSI HOST 1:CAM 2:DMA</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISP_OUT_TYPE</name>
              <description>this field configures pixel output type, 0: RAW8 1: YUV422 2: RGB888 3: YUV420 4: RGB565</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HSYNC_CNT</name>
          <description>header hsync interval control register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x7</resetValue>
          <fields>
            <field>
              <name>HSYNC_CNT</name>
              <description>this field configures the number of clock before hsync and after vsync and line_end when decodes pix data from idi to isp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME_CFG</name>
          <description>frame control parameter register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x601e01e0</resetValue>
          <fields>
            <field>
              <name>VADR_NUM</name>
              <description>this field configures input image size in y-direction, image row number - 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HADR_NUM</name>
              <description>this field configures input image size in x-direction, image line number - 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BAYER_MODE</name>
              <description>this field configures the bayer mode of input pixel. 00 : BG/GR    01 : GB/RG   10 : GR/BG  11 : RG/GB</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSYNC_START_EXIST</name>
              <description>this bit configures the line end packet exist or not. 0: not exist, 1: exist</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSYNC_END_EXIST</name>
              <description>this bit configures the line start packet exist or not. 0: not exist, 1: exist</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCM_COEF0</name>
          <description>ccm coef register 0</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>CCM_RR</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_RG</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>13</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCM_COEF1</name>
          <description>ccm coef register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCM_RB</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_GR</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>13</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCM_COEF3</name>
          <description>ccm coef register 3</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>CCM_GG</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_GB</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>13</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCM_COEF4</name>
          <description>ccm coef register 4</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCM_BR</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCM_BG</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>13</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCM_COEF5</name>
          <description>ccm coef register 5</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>CCM_BB</name>
              <description>this field configures the color correction matrix coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BF_MATRIX_CTRL</name>
          <description>bf pix2matrix ctrl</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BF_TAIL_PIXEN_PULSE_TL</name>
              <description>matrix tail pixen low level threshold, should not to large to prevent expanding to next frame, only reg_bf_tail_pixen_pulse_th!=0 and reg_bf_tail_pixen_pulse_tl!=0 and reg_bf_tail_pixen_pulse_th &lt; reg_bf_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BF_TAIL_PIXEN_PULSE_TH</name>
              <description>matrix tail pixen high level threshold, must &lt; hnum-1, only reg_bf_tail_pixen_pulse_th!=0 and reg_bf_tail_pixen_pulse_tl!=0 and reg_bf_tail_pixen_pulse_th &lt; reg_bf_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BF_PADDING_DATA</name>
              <description>this field configures bf matrix padding data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BF_PADDING_MODE</name>
              <description>this bit configures the padding mode of bf matrix.  0: use pixel in image to do padding   1: use reg_padding_data to do padding</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
