esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>BF_SIGMA</name>
          <description>bf denoising level control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>SIGMA</name>
              <description>this field configures the bayer denoising level, valid data from 2 to 20</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BF_GAU0</name>
          <description>bf gau template register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>GAU_TEMPLATE21</name>
              <description>this field configures index 21 of gausian template</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAU_TEMPLATE20</name>
              <description>this field configures index 20 of gausian template</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAU_TEMPLATE12</name>
              <description>this field configures index 12 of gausian template</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAU_TEMPLATE11</name>
              <description>this field configures index 11 of gausian template</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAU_TEMPLATE10</name>
              <description>this field configures index 10 of gausian template</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAU_TEMPLATE02</name>
              <description>this field configures index 02 of gausian template</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAU_TEMPLATE01</name>
              <description>this field configures index 01 of gausian template</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAU_TEMPLATE00</name>
              <description>this field configures index 00 of gausian template</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BF_GAU1</name>
          <description>bf gau template register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>GAU_TEMPLATE22</name>
              <description>this field configures index 22 of gausian template</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPC_CTRL</name>
          <description>DPC mode control register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>DPC_CHECK_EN</name>
              <description>this bit configures the check mode enable. 0: disable, 1: enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STA_EN</name>
              <description>this bit configures the sta dpc enable. 0: disable, 1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DYN_EN</name>
              <description>this bit configures the dyn dpc enable. 0: disable, 1: enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_BLACK_EN</name>
              <description>this bit configures input image type select when in check mode, 0: white img, 1: black img</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_METHOD_SEL</name>
              <description>this bit configures dyn dpc method select. 0: simple method, 1: hard method</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_CHECK_OD_EN</name>
              <description>this bit configures output pixel data when in check mode or not. 0: no data output, 1: data output</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPC_CONF</name>
          <description>DPC parameter config register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0x4103030</resetValue>
          <fields>
            <field>
              <name>DPC_THRESHOLD_L</name>
              <description>this bit configures the threshold to detect black img in check mode, or the low threshold(use 8 bit 0~255) in dyn method 0, or the low threshold factor (use 5 bit 10000-&gt; 16/16, 00001-&gt;1/16, 0/16~16/16) in dyn method 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_THRESHOLD_H</name>
              <description>this bit configures the threshold to detect white img in check mode, or the high threshold(use 8 bit 0~255) in dyn method 0, or the high threshold factor (use 5 bit 10000-&gt; 16/16, 00001-&gt;1/16, 0/16~16/16) in dyn method 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_FACTOR_DARK</name>
              <description>this field configures the dynamic correction method 1 dark   factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_FACTOR_BRIG</name>
              <description>this field configures the dynamic correction method 1 bright factor</description>
              <bitOffset>22</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPC_MATRIX_CTRL</name>
          <description>dpc pix2matrix ctrl</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DPC_TAIL_PIXEN_PULSE_TL</name>
              <description>matrix tail pixen low level threshold,  should not to large to prevent expanding to next frame, only reg_dpc_tail_pixen_pulse_th!=0 and reg_dpc_tail_pixen_pulse_tl!=0 and reg_dpc_tail_pixen_pulse_th &lt; reg_dpc_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_TAIL_PIXEN_PULSE_TH</name>
              <description>matrix tail pixen high level threshold, must &lt; hnum-1, only reg_dpc_tail_pixen_pulse_th!=0 and reg_dpc_tail_pixen_pulse_tl!=0 and reg_dpc_tail_pixen_pulse_th &lt; reg_dpc_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_PADDING_DATA</name>
              <description>this field configures dpc matrix padding data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_PADDING_MODE</name>
              <description>this bit configures the padding mode of dpc matrix.  0: use pixel in image to do padding   1: use reg_padding_data to do padding</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPC_DEADPIX_CNT</name>
          <description>DPC dead-pix number register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DPC_DEADPIX_CNT</name>
              <description>this field represents the dead pixel count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT_CMD</name>
          <description>LUT command register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LUT_ADDR</name>
              <description>this field configures the lut access addr, when select lsc lut, [11:10]:00 sel gb_b lut, 01 sel r_gr lut</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LUT_NUM</name>
              <description>this field configures the lut selection. 0000:LSC LUT. 0001:DPC LUT. 0010:AWB LUT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LUT_CMD</name>
              <description>this bit configures the access event of lut. 0:rd 1: wr</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT_WDATA</name>
          <description>LUT write data register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LUT_WDATA</name>
              <description>this field configures the write data of lut. please initial ISP_LUT_WDATA before write ISP_LUT_CMD register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT_RDATA</name>
          <description>LUT read data register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LUT_RDATA</name>
              <description>this field represents the read data of lut. read ISP_LUT_RDATA after write ISP_LUT_CMD register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LSC_TABLESIZE</name>
          <description>LSC point in x-direction</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x1f</resetValue>
          <fields>
            <field>
              <name>LSC_XTABLESIZE</name>
              <description>this field configures lsc table size in x-direction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOSAIC_MATRIX_CTRL</name>
          <description>demosaic pix2matrix ctrl</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEMOSAIC_TAIL_PIXEN_PULSE_TL</name>
              <description>matrix tail pixen low level threshold,  should not to large to prevent expanding to next frame, only reg_demosaic_tail_pixen_pulse_th!=0 and reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th &lt; reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOSAIC_TAIL_PIXEN_PULSE_TH</name>
              <description>matrix tail pixen high level threshold, must &lt; hnum-1, only reg_demosaic_tail_pixen_pulse_th!=0 and reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th &lt; reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOSAIC_PADDING_DATA</name>
              <description>this field configures demosaic matrix padding data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOSAIC_PADDING_MODE</name>
              <description>this bit configures the padding mode of demosaic matrix.  0: use pixel in image to do padding   1: use reg_padding_data to do padding</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMOSAIC_GRAD_RATIO</name>
          <description>demosaic gradient select ratio</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>DEMOSAIC_GRAD_RATIO</name>
              <description>this field configures demosaic gradient select ratio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEDIAN_MATRIX_CTRL</name>
          <description>median pix2matrix ctrl</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEDIAN_PADDING_DATA</name>
              <description>this field configures median matrix padding data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEDIAN_PADDING_MODE</name>
              <description>this bit configures the padding mode of median matrix.  0: use pixel in image to do padding   1: use reg_padding_data to do padding</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
