esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>INT_RAW</name>
          <description>raw interrupt register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ISP_DATA_TYPE_ERR_INT_RAW</name>
              <description>the raw interrupt status of input data type error. isp only support RGB bayer data type, other type will report type_err_int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_ASYNC_FIFO_OVF_INT_RAW</name>
              <description>the raw interrupt status of isp input fifo overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_BUF_FULL_INT_RAW</name>
              <description>the raw interrupt status of isp input buffer full</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_HVNUM_SETTING_ERR_INT_RAW</name>
              <description>the raw interrupt status of hnum and vnum setting format error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_DATA_TYPE_SETTING_ERR_INT_RAW</name>
              <description>the raw interrupt status of setting invalid reg_data_type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_MIPI_HNUM_UNMATCH_INT_RAW</name>
              <description>the raw interrupt status of hnum setting unmatch with mipi input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPC_CHECK_DONE_INT_RAW</name>
              <description>the raw interrupt status of dpc check done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAMMA_XCOORD_ERR_INT_RAW</name>
              <description>the raw interrupt status of gamma setting error. it report the sum of the lengths represented by reg_gamma_x00~x0F isn't equal to 256</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_MONITOR_INT_RAW</name>
              <description>the raw interrupt status of ae monitor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_FRAME_DONE_INT_RAW</name>
              <description>the raw interrupt status of ae.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AF_FDONE_INT_RAW</name>
              <description>the raw interrupt status of af statistic. when auto_update enable, each frame done will send one int pulse when manual_update, each time when write 1 to reg_manual_update will send a int pulse when next frame done</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AF_ENV_INT_RAW</name>
              <description>the raw interrupt status of af monitor. send a int pulse when env_det function enabled and environment changes detected</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AWB_FDONE_INT_RAW</name>
              <description>the raw interrupt status of awb. send a int pulse when statistic of one awb frame done</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HIST_FDONE_INT_RAW</name>
              <description>the raw interrupt status of histogram. send a int pulse when statistic of one frame histogram done</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAME_INT_RAW</name>
              <description>the raw interrupt status of isp frame end</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLC_FRAME_INT_RAW</name>
              <description>the raw interrupt status of blc frame done</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSC_FRAME_INT_RAW</name>
              <description>the raw interrupt status of lsc frame done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPC_FRAME_INT_RAW</name>
              <description>the raw interrupt status of dpc frame done</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BF_FRAME_INT_RAW</name>
              <description>the raw interrupt status of bf frame done</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEMOSAIC_FRAME_INT_RAW</name>
              <description>the raw interrupt status of demosaic frame done</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEDIAN_FRAME_INT_RAW</name>
              <description>the raw interrupt status of median frame done</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCM_FRAME_INT_RAW</name>
              <description>the raw interrupt status of ccm frame done</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAMMA_FRAME_INT_RAW</name>
              <description>the raw interrupt status of gamma frame done</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RGB2YUV_FRAME_INT_RAW</name>
              <description>the raw interrupt status of rgb2yuv frame done</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHARP_FRAME_INT_RAW</name>
              <description>the raw interrupt status of sharp frame done</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COLOR_FRAME_INT_RAW</name>
              <description>the raw interrupt status of color frame done</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YUV2RGB_FRAME_INT_RAW</name>
              <description>the raw interrupt status of yuv2rgb frame done</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAIL_IDI_FRAME_INT_RAW</name>
              <description>the raw interrupt status of isp_tail idi frame_end</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HEADER_IDI_FRAME_INT_RAW</name>
              <description>the raw interrupt status of real input frame end of isp_input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_FRAME_INT_RAW</name>
              <description>the raw interrupt status of crop frame done</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WBG_FRAME_INT_RAW</name>
              <description>the raw interrupt status of wbg frame done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_ERR_INT_RAW</name>
              <description>the raw interrupt status of crop error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ISP_DATA_TYPE_ERR_INT_ST</name>
              <description>the masked interrupt status of input data type error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_ASYNC_FIFO_OVF_INT_ST</name>
              <description>the masked interrupt status of isp input fifo overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_BUF_FULL_INT_ST</name>
              <description>the masked interrupt status of isp input buffer full</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_HVNUM_SETTING_ERR_INT_ST</name>
              <description>the masked interrupt status of hnum and vnum setting format error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_DATA_TYPE_SETTING_ERR_INT_ST</name>
              <description>the masked interrupt status of setting invalid reg_data_type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP_MIPI_HNUM_UNMATCH_INT_ST</name>
              <description>the masked interrupt status of hnum setting unmatch with mipi input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPC_CHECK_DONE_INT_ST</name>
              <description>the masked interrupt status of dpc check done</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAMMA_XCOORD_ERR_INT_ST</name>
              <description>the masked interrupt status of gamma setting error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_MONITOR_INT_ST</name>
              <description>the masked interrupt status of ae monitor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_FRAME_DONE_INT_ST</name>
              <description>the masked interrupt status of ae</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AF_FDONE_INT_ST</name>
              <description>the masked interrupt status of af statistic</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AF_ENV_INT_ST</name>
              <description>the masked interrupt status of af monitor</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AWB_FDONE_INT_ST</name>
              <description>the masked interrupt status of awb</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HIST_FDONE_INT_ST</name>
              <description>the masked interrupt status of histogram</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAME_INT_ST</name>
              <description>the masked interrupt status of isp frame end</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLC_FRAME_INT_ST</name>
              <description>the masked interrupt status of blc frame done</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LSC_FRAME_INT_ST</name>
              <description>the masked interrupt status of lsc frame done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPC_FRAME_INT_ST</name>
              <description>the masked interrupt status of dpc frame done</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BF_FRAME_INT_ST</name>
              <description>the masked interrupt status of bf frame done</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEMOSAIC_FRAME_INT_ST</name>
              <description>the masked interrupt status of demosaic frame done</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEDIAN_FRAME_INT_ST</name>
              <description>the masked interrupt status of median frame done</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCM_FRAME_INT_ST</name>
              <description>the masked interrupt status of ccm frame done</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAMMA_FRAME_INT_ST</name>
              <description>the masked interrupt status of gamma frame done</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RGB2YUV_FRAME_INT_ST</name>
              <description>the masked interrupt status of rgb2yuv frame done</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHARP_FRAME_INT_ST</name>
              <description>the masked interrupt status of sharp frame done</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COLOR_FRAME_INT_ST</name>
              <description>the masked interrupt status of color frame done</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YUV2RGB_FRAME_INT_ST</name>
              <description>the masked interrupt status of yuv2rgb frame done</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAIL_IDI_FRAME_INT_ST</name>
              <description>the masked interrupt status of isp_tail idi frame_end</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HEADER_IDI_FRAME_INT_ST</name>
              <description>the masked interrupt status of real input frame end of isp_input</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_FRAME_INT_ST</name>
              <description>the masked interrupt status of crop frame done</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WBG_FRAME_INT_ST</name>
              <description>the masked interrupt status of wbg frame done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_ERR_INT_ST</name>
              <description>the masked interrupt status of crop error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
