esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>GAMMA_GX1</name>
          <description>point of X-axis of g channel gamma curve register 1</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x924924</resetValue>
          <fields>
            <field>
              <name>GAMMA_G_X07</name>
              <description>this field configures the point 7 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X06</name>
              <description>this field configures the point 6 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X05</name>
              <description>this field configures the point 5 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X04</name>
              <description>this field configures the point 4 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X03</name>
              <description>this field configures the point 3 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X02</name>
              <description>this field configures the point 2 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X01</name>
              <description>this field configures the point 1 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X00</name>
              <description>this field configures the point 0 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_GX2</name>
          <description>point of X-axis of g channel gamma curve register 2</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x924924</resetValue>
          <fields>
            <field>
              <name>GAMMA_G_X0F</name>
              <description>this field configures the point 15 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X0E</name>
              <description>this field configures the point 14 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X0D</name>
              <description>this field configures the point 13 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X0C</name>
              <description>this field configures the point 12 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X0B</name>
              <description>this field configures the point 11 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X0A</name>
              <description>this field configures the point 10 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X09</name>
              <description>this field configures the point 9 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_G_X08</name>
              <description>this field configures the point 8 of X-axis of g channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_BX1</name>
          <description>point of X-axis of b channel gamma curve register 1</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x924924</resetValue>
          <fields>
            <field>
              <name>GAMMA_B_X07</name>
              <description>this field configures the point 7 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X06</name>
              <description>this field configures the point 6 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X05</name>
              <description>this field configures the point 5 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X04</name>
              <description>this field configures the point 4 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X03</name>
              <description>this field configures the point 3 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X02</name>
              <description>this field configures the point 2 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X01</name>
              <description>this field configures the point 1 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X00</name>
              <description>this field configures the point 0 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAMMA_BX2</name>
          <description>point of X-axis of b channel gamma curve register 2</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x924924</resetValue>
          <fields>
            <field>
              <name>GAMMA_B_X0F</name>
              <description>this field configures the point 15 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X0E</name>
              <description>this field configures the point 14 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X0D</name>
              <description>this field configures the point 13 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X0C</name>
              <description>this field configures the point 12 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X0B</name>
              <description>this field configures the point 11 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X0A</name>
              <description>this field configures the point 10 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X09</name>
              <description>this field configures the point 9 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_B_X08</name>
              <description>this field configures the point 8 of X-axis of b channel gamma curve, it represents the power of the distance from the previous point</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_CTRL</name>
          <description>ae control register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_UPDATE</name>
              <description>write 1 to this bit triggers one statistic event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE_SELECT</name>
              <description>this field configures ae input data source, 0: data from median, 1: data from gama</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_MONITOR</name>
          <description>ae monitor control register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TL</name>
              <description>this field configures the lower lum threshold of ae monitor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TH</name>
              <description>this field configures the higher lum threshold of ae monitor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIOD</name>
              <description>this field cnfigures ae monitor frame period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BX</name>
          <description>ae window register in x-direction</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x180</resetValue>
          <fields>
            <field>
              <name>AE_X_BSIZE</name>
              <description>this field configures every block x size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_X_START</name>
              <description>this field configures first block start x address</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BY</name>
          <description>ae window register in y-direction</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0xd8</resetValue>
          <fields>
            <field>
              <name>AE_Y_BSIZE</name>
              <description>this field configures every block y size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AE_Y_START</name>
              <description>this field configures first block start y address</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_WINPIXNUM</name>
          <description>ae sub-window pix num register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x14400</resetValue>
          <fields>
            <field>
              <name>AE_SUBWIN_PIXNUM</name>
              <description>this field configures the pixel number of each sub win</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_WIN_RECIPROCAL</name>
          <description>reciprocal of ae sub-window pixel number</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_SUBWIN_RECIP</name>
              <description>this field configures the reciprocal of each subwin_pixnum, 20bit fraction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BLOCK_MEAN_0</name>
          <description>ae statistic result register 0</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_B03_MEAN</name>
              <description>this field configures block03 Y mean data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B02_MEAN</name>
              <description>this field configures block02 Y mean data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B01_MEAN</name>
              <description>this field configures block01 Y mean data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B00_MEAN</name>
              <description>this field configures block00 Y mean data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BLOCK_MEAN_1</name>
          <description>ae statistic result register 1</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_B12_MEAN</name>
              <description>this field configures block12 Y mean data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B11_MEAN</name>
              <description>this field configures block11 Y mean data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B10_MEAN</name>
              <description>this field configures block10 Y mean data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B04_MEAN</name>
              <description>this field configures block04 Y mean data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BLOCK_MEAN_2</name>
          <description>ae statistic result register 2</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_B21_MEAN</name>
              <description>this field configures block21 Y mean data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B20_MEAN</name>
              <description>this field configures block20 Y mean data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B14_MEAN</name>
              <description>this field configures block14 Y mean data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B13_MEAN</name>
              <description>this field configures block13 Y mean data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BLOCK_MEAN_3</name>
          <description>ae statistic result register 3</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_B30_MEAN</name>
              <description>this field configures block30 Y mean data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B24_MEAN</name>
              <description>this field configures block24 Y mean data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B23_MEAN</name>
              <description>this field configures block23 Y mean data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B22_MEAN</name>
              <description>this field configures block22 Y mean data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
