esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>AE_BLOCK_MEAN_4</name>
          <description>ae statistic result register 4</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_B34_MEAN</name>
              <description>this field configures block34 Y mean data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B33_MEAN</name>
              <description>this field configures block33 Y mean data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B32_MEAN</name>
              <description>this field configures block32 Y mean data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B31_MEAN</name>
              <description>this field configures block31 Y mean data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BLOCK_MEAN_5</name>
          <description>ae statistic result register 5</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_B43_MEAN</name>
              <description>this field configures block43 Y mean data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B42_MEAN</name>
              <description>this field configures block42 Y mean data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B41_MEAN</name>
              <description>this field configures block41 Y mean data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE_B40_MEAN</name>
              <description>this field configures block40 Y mean data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AE_BLOCK_MEAN_6</name>
          <description>ae statistic result register 6</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AE_B44_MEAN</name>
              <description>this field configures block44 Y mean data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARP_CTRL0</name>
          <description>sharp control register 0</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHARP_THRESHOLD_LOW</name>
              <description>this field configures sharpen threshold for detail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_THRESHOLD_HIGH</name>
              <description>this field configures sharpen threshold for edge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_AMOUNT_LOW</name>
              <description>this field configures sharpen amount for detail</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_AMOUNT_HIGH</name>
              <description>this field configures sharpen amount for edge</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARP_FILTER0</name>
          <description>sharp usm config register 0</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x441</resetValue>
          <fields>
            <field>
              <name>SHARP_FILTER_COE00</name>
              <description>this field configures unsharp masking(usm) filter coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_FILTER_COE01</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_FILTER_COE02</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARP_FILTER1</name>
          <description>sharp usm config register 1</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x882</resetValue>
          <fields>
            <field>
              <name>SHARP_FILTER_COE10</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_FILTER_COE11</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_FILTER_COE12</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARP_FILTER2</name>
          <description>sharp usm config register 2</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x441</resetValue>
          <fields>
            <field>
              <name>SHARP_FILTER_COE20</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_FILTER_COE21</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_FILTER_COE22</name>
              <description>this field configures usm filter coefficient</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARP_MATRIX_CTRL</name>
          <description>sharp pix2matrix ctrl</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHARP_TAIL_PIXEN_PULSE_TL</name>
              <description>matrix tail pixen low level threshold,  should not to large to prevent expanding to next frame, only reg_demosaic_tail_pixen_pulse_th!=0 and reg_demosaic_tail_pixen_pulse_tl!=0 and reg_demosaic_tail_pixen_pulse_th &lt; reg_demosaic_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_TAIL_PIXEN_PULSE_TH</name>
              <description>matrix tail pixen high level threshold, must &lt; hnum-1, only reg_sharp_tail_pixen_pulse_th!=0 and reg_sharp_tail_pixen_pulse_tl!=0 and reg_sharp_tail_pixen_pulse_th &lt; reg_sharp_tail_pixen_pulse_tl will enable tail pulse function</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_PADDING_DATA</name>
              <description>this field configures sharp padding data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHARP_PADDING_MODE</name>
              <description>this field configures sharp padding mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHARP_CTRL1</name>
          <description>sharp control register 1</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHARP_GRADIENT_MAX</name>
              <description>this field configures sharp max gradient, refresh at the end of each frame end</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CNTL</name>
          <description>isp dma source trans control register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x1080a8</resetValue>
          <fields>
            <field>
              <name>DMA_EN</name>
              <description>write 1 to triger dma to get 1 frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMA_UPDATE</name>
              <description>write 1 to update reg_dma_burst_len &amp; reg_dma_data_type</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_DATA_TYPE</name>
              <description>this field configures the idi data type for image data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_BURST_LEN</name>
              <description>this field configures dma burst len when data source is dma. set according to dma_msize, it is the number of 64bits in a dma transfer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_INTERVAL</name>
              <description>this field configures dma req interval, 12'b1: 1 cycle, 12'b11 2 cycle ...</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RAW_DATA</name>
          <description>isp dma source total raw number set register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_RAW_NUM_TOTAL</name>
              <description>this field configures the the number of 64bits in a frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RAW_NUM_TOTAL_SET</name>
              <description>write 1 to update reg_dma_raw_num_total</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAM_CNTL</name>
          <description>isp cam source control register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>CAM_EN</name>
              <description>write 1 to start recive camera data, write 0 to disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_UPDATE</name>
              <description>write 1 to update ISP_CAM_CONF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_RESET</name>
              <description>this bit configures cam clk domain reset, 1: reset cam input logic, 0: release reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_CLK_INV</name>
              <description>this bit configures the invertion of cam clk from pad. 0: not invert cam clk, 1: invert cam clk</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAM_CONF</name>
          <description>isp cam source config register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0xa8</resetValue>
          <fields>
            <field>
              <name>CAM_DATA_ORDER</name>
              <description>this field configures data order of cam port, 0: cam_data_in, 1:{cam_data_in[7:0], cam_data_in[15:8]}</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_2BYTE_MODE</name>
              <description>this field configures enable of cam 2 byte mode(input 2 bytes each clock). 0: disable, 1: enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_DATA_TYPE</name>
              <description>this field configures idi data type for image data, 0x2a: RAW8, 0x2b: RAW10, 0x2c: RAW12</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_DE_INV</name>
              <description>this bit configures cam data enable invert. 0: not invert, 1: invert</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_HSYNC_INV</name>
              <description>this bit configures cam hsync invert. 0: not invert, 1: invert</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VSYNC_INV</name>
              <description>this bit configures cam vsync invert. 0: not invert, 1: invert</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VSYNC_FILTER_THRES</name>
              <description>this bit configures the number of clock of vsync filter length</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_VSYNC_FILTER_EN</name>
              <description>this bit configures vsync filter en</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAM_DE_ONLY</name>
              <description>configures whether cam inf only has de, no hsync data. 0: has hsync, 1: no hsync</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_CTRL0</name>
          <description>af control register 0</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_AUTO_UPDATE</name>
              <description>this bit configures auto_update enable. when set to 1, will update sum and lum each frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_MANUAL_UPDATE</name>
              <description>write 1 to this bit will update the sum and lum once</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AF_ENV_THRESHOLD</name>
              <description>this field configures env threshold. when both sum and lum changes larger than this value, consider environment changes and need to trigger a new autofocus. 4Bit fractional</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_ENV_PERIOD</name>
              <description>this field configures environment changes detection period (frame). When set to 0, disable this function</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_CTRL1</name>
          <description>af control register 1</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_THPIXNUM</name>
              <description>this field configures pixnum used when calculating the autofocus threshold. Set to 0 to disable threshold calculation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_GEN_TH_CTRL</name>
          <description>af gen threshold control register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0x4400080</resetValue>
          <fields>
            <field>
              <name>AF_GEN_THRESHOLD_MIN</name>
              <description>this field configures min threshold when use auto_threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_GEN_THRESHOLD_MAX</name>
              <description>this field configures max threshold when use auto_threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_ENV_USER_TH_SUM</name>
          <description>af monitor user sum threshold register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_ENV_USER_THRESHOLD_SUM</name>
              <description>this field configures user setup env detect sum threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_ENV_USER_TH_LUM</name>
          <description>af monitor user lum threshold register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_ENV_USER_THRESHOLD_LUM</name>
              <description>this field configures user setup env detect lum threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_THRESHOLD</name>
          <description>af threshold register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>AF_THRESHOLD</name>
              <description>this field configures user threshold. When set to non-zero, autofocus will use this threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_GEN_THRESHOLD</name>
              <description>this field represents the last calculated threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
