esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>AF_HSCALE_A</name>
          <description>h-scale of af window a register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0x10080</resetValue>
          <fields>
            <field>
              <name>AF_RPOINT_A</name>
              <description>this field configures left coordinate of focus window a, must &gt;= 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_LPOINT_A</name>
              <description>this field configures top coordinate of focus window a, must &gt;= 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_VSCALE_A</name>
          <description>v-scale of af window a register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x10080</resetValue>
          <fields>
            <field>
              <name>AF_BPOINT_A</name>
              <description>this field configures right coordinate of focus window a, must &lt;= hnum-2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_TPOINT_A</name>
              <description>this field configures bottom coordinate of focus window a, must &lt;= hnum-2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_HSCALE_B</name>
          <description>h-scale of af window b register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0x10080</resetValue>
          <fields>
            <field>
              <name>AF_RPOINT_B</name>
              <description>this field configures left coordinate of focus window b, must &gt;= 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_LPOINT_B</name>
              <description>this field configures top coordinate of focus window b, must &gt;= 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_VSCALE_B</name>
          <description>v-scale of af window b register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0x10080</resetValue>
          <fields>
            <field>
              <name>AF_BPOINT_B</name>
              <description>this field configures right coordinate of focus window b, must &lt;= hnum-2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_TPOINT_B</name>
              <description>this field configures bottom coordinate of focus window b, must &lt;= hnum-2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_HSCALE_C</name>
          <description>v-scale of af window c register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0x10080</resetValue>
          <fields>
            <field>
              <name>AF_RPOINT_C</name>
              <description>this field configures left coordinate of focus window c, must &gt;= 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_LPOINT_C</name>
              <description>this field configures top coordinate of focus window c, must &gt;= 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_VSCALE_C</name>
          <description>v-scale of af window c register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0x10080</resetValue>
          <fields>
            <field>
              <name>AF_BPOINT_C</name>
              <description>this field configures right coordinate of focus window c, must &lt;= hnum-2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AF_TPOINT_C</name>
              <description>this field configures bottom coordinate of focus window c, must &lt;= hnum-2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_SUM_A</name>
          <description>result of sum of af window a</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_SUMA</name>
              <description>this field represents the result of accumulation of pix grad of focus window a</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_SUM_B</name>
          <description>result of sum of af window b</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_SUMB</name>
              <description>this field represents the result of accumulation of pix grad of focus window b</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_SUM_C</name>
          <description>result of sum of af window c</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_SUMC</name>
              <description>this field represents the result of accumulation of pix grad of focus window c</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_LUM_A</name>
          <description>result of lum of af window a</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_LUMA</name>
              <description>this field represents the result of accumulation of pix light of focus window a</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_LUM_B</name>
          <description>result of lum of af window b</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_LUMB</name>
              <description>this field represents the result of accumulation of pix light of focus window b</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AF_LUM_C</name>
          <description>result of lum of af window c</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AF_LUMC</name>
              <description>this field represents the result of accumulation of pix light of focus window c</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_MODE</name>
          <description>awb mode control register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>AWB_MODE</name>
              <description>this field configures awb algo sel. 00: none sellected. 01: sel algo0. 10: sel algo1. 11: sel both algo0 and algo1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_SAMPLE</name>
              <description>this bit configures awb sample location, 0:before ccm, 1:after ccm</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_HSCALE</name>
          <description>h-scale of awb window</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0x77f</resetValue>
          <fields>
            <field>
              <name>AWB_RPOINT</name>
              <description>this field configures awb window right coordinate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_LPOINT</name>
              <description>this field configures awb window left coordinate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_VSCALE</name>
          <description>v-scale of awb window</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0x437</resetValue>
          <fields>
            <field>
              <name>AWB_BPOINT</name>
              <description>this field configures awb window bottom coordinate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_TPOINT</name>
              <description>this field configures awb window top coordinate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_TH_LUM</name>
          <description>awb lum threshold register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0x2fd0000</resetValue>
          <fields>
            <field>
              <name>AWB_MIN_LUM</name>
              <description>this field configures lower threshold of r+g+b</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_MAX_LUM</name>
              <description>this field configures upper threshold of r+g+b</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_TH_RG</name>
          <description>awb r/g threshold register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0x3ff0000</resetValue>
          <fields>
            <field>
              <name>AWB_MIN_RG</name>
              <description>this field configures lower threshold of r/g, 2bit integer and 8bit fraction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_MAX_RG</name>
              <description>this field configures upper threshold of r/g, 2bit integer and 8bit fraction</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_TH_BG</name>
          <description>awb b/g threshold register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0x3ff0000</resetValue>
          <fields>
            <field>
              <name>AWB_MIN_BG</name>
              <description>this field configures lower threshold of b/g, 2bit integer and 8bit fraction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_MAX_BG</name>
              <description>this field configures upper threshold of b/g, 2bit integer and 8bit fraction</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB0_WHITE_CNT</name>
          <description>result of awb white point number</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AWB0_WHITE_CNT</name>
              <description>this field configures number of white point detected of algo0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB0_ACC_R</name>
          <description>result of accumulate of r channel of all white points</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AWB0_ACC_R</name>
              <description>this field represents accumulate of channel r of all white point of algo0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB0_ACC_G</name>
          <description>result of accumulate of g channel of all white points</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AWB0_ACC_G</name>
              <description>this field represents accumulate of channel g of all white point of algo0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB0_ACC_B</name>
          <description>result of accumulate of b channel of all white points</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AWB0_ACC_B</name>
              <description>this field represents accumulate of channel b of all white point of algo0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLOR_CTRL</name>
          <description>color control register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0x800080</resetValue>
          <fields>
            <field>
              <name>COLOR_SATURATION</name>
              <description>this field configures the color saturation value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_HUE</name>
              <description>this field configures the color hue angle</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_CONTRAST</name>
              <description>this field configures the color contrast value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLOR_BRIGHTNESS</name>
              <description>this field configures the color brightness value, signed 2's complement</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLC_VALUE</name>
          <description>blc black level register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLC_R3_VALUE</name>
              <description>this field configures the black level of bottom right channel of bayer img</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_R2_VALUE</name>
              <description>this field configures the black level of bottom left channel of bayer img</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_R1_VALUE</name>
              <description>this field configures the black level of top right channel of bayer img</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_R0_VALUE</name>
              <description>this field configures the black level of top left channel of bayer img</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLC_CTRL0</name>
          <description>blc stretch control register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLC_R3_STRETCH</name>
              <description>this bit configures the stretch feature of bottom right channel. 0: stretch disable, 1: stretch enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_R2_STRETCH</name>
              <description>this bit configures the stretch feature of bottom left channel. 0: stretch disable, 1: stretch enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_R1_STRETCH</name>
              <description>this bit configures the stretch feature of top right channel. 0: stretch disable, 1: stretch enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_R0_STRETCH</name>
              <description>this bit configures the stretch feature of top left channel. 0: stretch disable, 1: stretch enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLC_CTRL1</name>
          <description>blc window control register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLC_WINDOW_TOP</name>
              <description>this field configures blc average calculation window top</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_WINDOW_LEFT</name>
              <description>this field configures blc average calculation window left</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_WINDOW_VNUM</name>
              <description>this field configures blc average calculation window vnum</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_WINDOW_HNUM</name>
              <description>this field configures blc average calculation window hnum</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLC_FILTER_EN</name>
              <description>this bit configures enable blc average input filter. 0: disable, 1: enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
