esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>HIST_BIN4</name>
          <description>result of histogram bin 4</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_4</name>
              <description>this field represents result of histogram bin 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN5</name>
          <description>result of histogram bin 5</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_5</name>
              <description>this field represents result of histogram bin 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN6</name>
          <description>result of histogram bin 6</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_6</name>
              <description>this field represents result of histogram bin 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN7</name>
          <description>result of histogram bin 7</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_7</name>
              <description>this field represents result of histogram bin 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN8</name>
          <description>result of histogram bin 8</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_8</name>
              <description>this field represents result of histogram bin 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN9</name>
          <description>result of histogram bin 9</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_9</name>
              <description>this field represents result of histogram bin 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN10</name>
          <description>result of histogram bin 10</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_10</name>
              <description>this field represents result of histogram bin 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN11</name>
          <description>result of histogram bin 11</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_11</name>
              <description>this field represents result of histogram bin 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN12</name>
          <description>result of histogram bin 12</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_12</name>
              <description>this field represents result of histogram bin 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN13</name>
          <description>result of histogram bin 13</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_13</name>
              <description>this field represents result of histogram bin 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN14</name>
          <description>result of histogram bin 14</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_14</name>
              <description>this field represents result of histogram bin 14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIST_BIN15</name>
          <description>result of histogram bin 15</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HIST_BIN_15</name>
              <description>this field represents result of histogram bin 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_0</name>
          <description>mem aux control register 0</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>HEADER_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of isp input buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_LUT_MEM_AUX_CTRL</name>
              <description>this field represents this field configures the mem_aux of dpc lut memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_1</name>
          <description>mem aux control register 1</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>LSC_LUT_R_GR_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of lsc r gr lut memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSC_LUT_GB_B_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of lsc gb b lut memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_2</name>
          <description>mem aux control register 2</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>BF_MATRIX_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of bf line buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPC_MATRIX_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of dpc line buffer memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_3</name>
          <description>mem aux control register 3</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0x13201320</resetValue>
          <fields>
            <field>
              <name>SHARP_MATRIX_Y_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of sharp y line buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMOSAIC_MATRIX_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of demosaic line buffer memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_AUX_CTRL_4</name>
          <description>mem aux control register 4</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0x1320</resetValue>
          <fields>
            <field>
              <name>SHARP_MATRIX_UV_MEM_AUX_CTRL</name>
              <description>this field configures the mem_aux of sharp uv line buffer memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>YUV_FORMAT</name>
          <description>yuv format control register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>YUV_MODE</name>
              <description>this bit configures the yuv mode. 0: ITU-R BT.601, 1: ITU-R BT.709</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUV_RANGE</name>
              <description>this bit configures the yuv range. 0: full range, 1: limit range</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_CS</name>
          <description>rdn eco cs register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_EN</name>
              <description>rdn_eco_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDN_ECO_RESULT</name>
              <description>rdn_eco_result</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_LOW</name>
          <description>rdn eco all low register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDN_ECO_LOW</name>
              <description>rdn_eco_low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RDN_ECO_HIGH</name>
          <description>rdn eco all high register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RDN_ECO_HIGH</name>
              <description>rdn_eco_high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CROP_CTRL</name>
          <description>isp_crop ctrl register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CROP_SFT_RST</name>
              <description>Write 1 to clear err st</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CROP_Y_CAPTURE</name>
          <description>isp_crop row capture range register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CROP_Y_START</name>
              <description>isp_crop capture row start index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CROP_Y_END</name>
              <description>isp_crop capture row end index</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CROP_X_CAPTURE</name>
          <description>isp_crop col capture range register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CROP_X_START</name>
              <description>isp_crop capture col start index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CROP_X_END</name>
              <description>isp_crop capture col end index</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CROP_ERR_ST</name>
          <description>crop error state register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CROP_Y_MISMATCH</name>
              <description>Represents isp_corp row end index over image size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_X_MISMATCH</name>
              <description>Represents isp_corp col end index over image size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_Y_END_EVEN</name>
              <description>Represents isp_corp row end index is an even number</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_X_END_EVEN</name>
              <description>Represents isp_corp col end index is an even number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_Y_START_ODD</name>
              <description>Represents isp_corp row start index is an odd number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CROP_X_START_ODD</name>
              <description>Represents isp_corp col start index is an odd number</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WBG_COEF_R</name>
          <description>white balance red gain register 0</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>WBG_R</name>
              <description>Configures the white balance red gain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WBG_COEF_G</name>
          <description>white balance green gain register 0</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>WBG_G</name>
              <description>Configures the white balance green gain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WBG_COEF_B</name>
          <description>white balance blue gain register 0</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>WBG_B</name>
              <description>Configures the white balance blue gain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COLOR_HUE_CTRL</name>
          <description>color control register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COLOR_HUE_H</name>
              <description>Configures the color hue angle most bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_BX</name>
          <description>awb window register in x-direction</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AWB_X_BSIZE</name>
              <description>Configures every block x size, min number is 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_X_START</name>
              <description>Configures first block start x address</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWB_BY</name>
          <description>awb window register in y-direction</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AWB_Y_BSIZE</name>
              <description>Configures every block y size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWB_Y_START</name>
              <description>Configures first block start y address</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>awb window register in y-direction</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TAIL_BUSY</name>
              <description>Represents isp_tail state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HEADER_BUSY</name>
              <description>Represents isp_header state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
