esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>EVT_TASK_EN0</name>
          <description>Ledc event task enable bit register0.</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EVT_DUTY_CHNG_END_CH0_EN</name>
              <description>Configures whether or not to enable the ledc_ch0_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH1_EN</name>
              <description>Configures whether or not to enable the ledc_ch1_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH2_EN</name>
              <description>Configures whether or not to enable the ledc_ch2_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH3_EN</name>
              <description>Configures whether or not to enable the ledc_ch3_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH4_EN</name>
              <description>Configures whether or not to enable the ledc_ch4_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH5_EN</name>
              <description>Configures whether or not to enable the ledc_ch5_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH6_EN</name>
              <description>Configures whether or not to enable the ledc_ch6_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_DUTY_CHNG_END_CH7_EN</name>
              <description>Configures whether or not to enable the ledc_ch7_duty_chng_end event.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH0_EN</name>
              <description>Configures whether or not to enable the ledc_ch0_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH1_EN</name>
              <description>Configures whether or not to enable the ledc_ch1_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH2_EN</name>
              <description>Configures whether or not to enable the ledc_ch2_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH3_EN</name>
              <description>Configures whether or not to enable the ledc_ch3_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH4_EN</name>
              <description>Configures whether or not to enable the ledc_ch4_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH5_EN</name>
              <description>Configures whether or not to enable the ledc_ch5_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH6_EN</name>
              <description>Configures whether or not to enable the ledc_ch6_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_OVF_CNT_PLS_CH7_EN</name>
              <description>Configures whether or not to enable the ledc_ch7_ovf_cnt_pls event.\\0: Disable\\1: Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER0_EN</name>
              <description>Configures whether or not to enable the ledc_timer0_ovf event.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER1_EN</name>
              <description>Configures whether or not to enable the ledc_timer1_ovf event.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER2_EN</name>
              <description>Configures whether or not to enable the ledc_timer2_ovf event.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME_OVF_TIMER3_EN</name>
              <description>Configures whether or not to enable the ledc_timer3_ovf event.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME0_CMP_EN</name>
              <description>Configures whether or not to enable the ledc_timer0_cmp event.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME1_CMP_EN</name>
              <description>Configures whether or not to enable the ledc_timer1_cmp event.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME2_CMP_EN</name>
              <description>Configures whether or not to enable the ledc_timer2_cmp event.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVT_TIME3_CMP_EN</name>
              <description>Configures whether or not to enable the ledc_timer3_cmp event.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH0_EN</name>
              <description>Configures whether or not to enable the ledc_ch0_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH1_EN</name>
              <description>Configures whether or not to enable the ledc_ch1_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH2_EN</name>
              <description>Configures whether or not to enable the ledc_ch2_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH3_EN</name>
              <description>Configures whether or not to enable the ledc_ch3_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH4_EN</name>
              <description>Configures whether or not to enable the ledc_ch4_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH5_EN</name>
              <description>Configures whether or not to enable the ledc_ch5_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH6_EN</name>
              <description>Configures whether or not to enable the ledc_ch6_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_DUTY_SCALE_UPDATE_CH7_EN</name>
              <description>Configures whether or not to enable the ledc_ch7_duty_scale_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVT_TASK_EN1</name>
          <description>Ledc event task enable bit register1.</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TASK_TIMER0_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable ledc_timer0_res_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable ledc_timer1_res_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable ledc_timer2_res_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_RES_UPDATE_EN</name>
              <description>Configures whether or not to enable ledc_timer3_res_update task.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_CAP_EN</name>
              <description>Configures whether or not to enable ledc_timer0_cap task.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_CAP_EN</name>
              <description>Configures whether or not to enable ledc_timer1_cap task.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_CAP_EN</name>
              <description>Configures whether or not to enable ledc_timer2_cap task.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_CAP_EN</name>
              <description>Configures whether or not to enable ledc_timer3_cap task.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH0_EN</name>
              <description>Configures whether or not to enable ledc_ch0_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH1_EN</name>
              <description>Configures whether or not to enable ledc_ch1_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH2_EN</name>
              <description>Configures whether or not to enable ledc_ch2_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH3_EN</name>
              <description>Configures whether or not to enable ledc_ch3_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH4_EN</name>
              <description>Configures whether or not to enable ledc_ch4_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH5_EN</name>
              <description>Configures whether or not to enable ledc_ch5_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH6_EN</name>
              <description>Configures whether or not to enable ledc_ch6_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_SIG_OUT_DIS_CH7_EN</name>
              <description>Configures whether or not to enable ledc_ch7_sig_out_dis task.\\0: Disable\\1: Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH0_EN</name>
              <description>Configures whether or not to enable ledc_ch0_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH1_EN</name>
              <description>Configures whether or not to enable ledc_ch1_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH2_EN</name>
              <description>Configures whether or not to enable ledc_ch2_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH3_EN</name>
              <description>Configures whether or not to enable ledc_ch3_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH4_EN</name>
              <description>Configures whether or not to enable ledc_ch4_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH5_EN</name>
              <description>Configures whether or not to enable ledc_ch5_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH6_EN</name>
              <description>Configures whether or not to enable ledc_ch6_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_OVF_CNT_RST_CH7_EN</name>
              <description>Configures whether or not to enable ledc_ch7_ovf_cnt_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_RST_EN</name>
              <description>Configures whether or not to enable ledc_timer0_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_RST_EN</name>
              <description>Configures whether or not to enable ledc_timer1_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_RST_EN</name>
              <description>Configures whether or not to enable ledc_timer2_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_RST_EN</name>
              <description>Configures whether or not to enable ledc_timer3_rst task.\\0: Disable\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER0_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable ledc_timer0_pause_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER1_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable ledc_timer1_pause_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER2_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable ledc_timer2_pause_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_TIMER3_PAUSE_RESUME_EN</name>
              <description>Configures whether or not to enable ledc_timer3_pause_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
