esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>EVT_TASK_EN2</name>
          <description>Ledc event task enable bit register2.</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TASK_GAMMA_RESTART_CH0_EN</name>
              <description>Configures whether or not to enable ledc_ch0_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH1_EN</name>
              <description>Configures whether or not to enable ledc_ch1_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH2_EN</name>
              <description>Configures whether or not to enable ledc_ch2_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH3_EN</name>
              <description>Configures whether or not to enable ledc_ch3_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH4_EN</name>
              <description>Configures whether or not to enable ledc_ch4_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH5_EN</name>
              <description>Configures whether or not to enable ledc_ch5_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH6_EN</name>
              <description>Configures whether or not to enable ledc_ch6_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESTART_CH7_EN</name>
              <description>Configures whether or not to enable ledc_ch7_gamma_restart task.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH0_EN</name>
              <description>Configures whether or not to enable ledc_ch0_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH1_EN</name>
              <description>Configures whether or not to enable ledc_ch1_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH2_EN</name>
              <description>Configures whether or not to enable ledc_ch2_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH3_EN</name>
              <description>Configures whether or not to enable ledc_ch3_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH4_EN</name>
              <description>Configures whether or not to enable ledc_ch4_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH5_EN</name>
              <description>Configures whether or not to enable ledc_ch5_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH6_EN</name>
              <description>Configures whether or not to enable ledc_ch6_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_PAUSE_CH7_EN</name>
              <description>Configures whether or not to enable ledc_ch7_gamma_pause task.\\0: Disable\\1: Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH0_EN</name>
              <description>Configures whether or not to enable ledc_ch0_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH1_EN</name>
              <description>Configures whether or not to enable ledc_ch1_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH2_EN</name>
              <description>Configures whether or not to enable ledc_ch2_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH3_EN</name>
              <description>Configures whether or not to enable ledc_ch3_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH4_EN</name>
              <description>Configures whether or not to enable ledc_ch4_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH5_EN</name>
              <description>Configures whether or not to enable ledc_ch5_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH6_EN</name>
              <description>Configures whether or not to enable ledc_ch6_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_GAMMA_RESUME_CH7_EN</name>
              <description>Configures whether or not to enable ledc_ch7_gamma_resume task.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMER%s_CMP</name>
          <description>Ledc timer%s compare value register.</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_CMP</name>
              <description>Configures the comparison value for LEDC timer%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMER%s_CNT_CAP</name>
          <description>Ledc timer%s captured count value register.</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_CNT_CAP</name>
              <description>Represents the captured LEDC timer%s count value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>LEDC global configuration register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB_CLK_SEL</name>
              <description>Configures the clock source for the four timers.\\0: APB_CLK\\1: RC_FAST_CLK\\2: XTAL_CLK\\3: Invalid. No clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH0</name>
              <description>Configures whether or not to open LEDC ch0 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch0 gamma ram\\1: Force open the clock gate for LEDC ch0 gamma ram</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH1</name>
              <description>Configures whether or not to open LEDC ch1 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch1 gamma ram\\1: Force open the clock gate for LEDC ch1 gamma ram</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH2</name>
              <description>Configures whether or not to open LEDC ch2 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch2 gamma ram\\1: Force open the clock gate for LEDC ch2 gamma ram</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH3</name>
              <description>Configures whether or not to open LEDC ch3 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch3 gamma ram\\1: Force open the clock gate for LEDC ch3 gamma ram</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH4</name>
              <description>Configures whether or not to open LEDC ch4 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch4 gamma ram\\1: Force open the clock gate for LEDC ch4 gamma ram</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH5</name>
              <description>Configures whether or not to open LEDC ch5 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch5 gamma ram\\1: Force open the clock gate for LEDC ch5 gamma ram</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH6</name>
              <description>Configures whether or not to open LEDC ch6 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch6 gamma ram\\1: Force open the clock gate for LEDC ch6 gamma ram</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAMMA_RAM_CLK_EN_CH7</name>
              <description>Configures whether or not to open LEDC ch7 gamma ram clock gate.\\0: Open the clock gate only when application writes or reads LEDC ch7 gamma ram\\1: Force open the clock gate for LEDC ch7 gamma ram</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to open register clock gate.\\0: Open the clock gate only when application writes registers\\1: Force open the clock gate for register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0x2404020</resetValue>
          <fields>
            <field>
              <name>LEDC_DATE</name>
              <description>Configures the version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
