esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>LP_TCM_RAM_RDN_ECO_LOW</name>
          <description>need_des</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_TCM_RAM_RDN_ECO_LOW</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TCM_RAM_RDN_ECO_HIGH</name>
          <description>need_des</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>LP_TCM_RAM_RDN_ECO_HIGH</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TCM_ROM_RDN_ECO_CS</name>
          <description>need_des</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_TCM_ROM_RDN_ECO_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_TCM_ROM_RDN_ECO_RESULT</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TCM_ROM_RDN_ECO_LOW</name>
          <description>need_des</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_TCM_ROM_RDN_ECO_LOW</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TCM_ROM_RDN_ECO_HIGH</name>
          <description>need_des</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>LP_TCM_ROM_RDN_ECO_HIGH</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ROOT_CLK_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>CPU_CLK_EN</name>
              <description>clock gate enable for hp cpu root 400M clk</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_CLK_EN</name>
              <description>clock gate enable for hp sys root 480M clk</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PMU_RDN_ECO_LOW</name>
          <description>need_des</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMU_RDN_ECO_LOW</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PMU_RDN_ECO_HIGH</name>
          <description>need_des</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>PMU_RDN_ECO_HIGH</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_COMP0</name>
          <description>need_des</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DREF_COMP0</name>
              <description>pad comp dref</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE_COMP0</name>
              <description>pad comp mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_COMP0</name>
              <description>pad comp xpd</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_COMP1</name>
          <description>need_des</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DREF_COMP1</name>
              <description>pad comp dref</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE_COMP1</name>
              <description>pad comp mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_COMP1</name>
              <description>pad comp xpd</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_DMA_CFG0</name>
          <description>need_des</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0x1906414a</resetValue>
          <fields>
            <field>
              <name>BURST_LIMIT_AON</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_INTERVAL_AON</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINK_BACKUP_TOUT_THRES_AON</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINK_TOUT_THRES_AON</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_DMA_CFG1</name>
          <description>need_des</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AON_BYPASS</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_DMA_CFG2</name>
          <description>need_des</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LINK_ADDR_AON</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_ADDR_HP_CORE1</name>
          <description>need_des</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOOT_ADDR_HP_CORE1</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ADDRHOLE_ADDR</name>
          <description>need_des</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ADDRHOLE_ADDR</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ADDRHOLE_INFO</name>
          <description>need_des</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ADDRHOLE_ID</name>
              <description>master id: 5'h0: hp core0, 5'h1:hp core1, 5'h2:lp core, 5'h3:usb otg11, 5'h4: regdma, 5'h5: gmac, 5'h5 sdmmc, 5'h7: usbotg20, 5'h8: trace0, 5'h9: trace1, 5'ha tcm monitor, 5'hb: l2mem monitor. 5'h10~5'h1f: ahb pdma.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ADDRHOLE_WR</name>
              <description>1:write trans, 0: read trans.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_ADDRHOLE_SECURE</name>
              <description>1: illegal address access, 0: access without permission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>raw interrupt register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ADDRHOLE_INT_RAW</name>
              <description>the raw interrupt status of lp addrhole(for lp peri  and lp ram tee apm, and lp matrix default slave)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_INT_RAW</name>
              <description>the raw interrupt status of idbus addrhole(only for lp cpu ibus and dbus)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CORE_AHB_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of lp core ahb bus timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CORE_IBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of lp core  ibus timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CORE_DBUS_TIMEOUT_INT_RAW</name>
              <description>the raw interrupt status of lp core  dbus timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETM_TASK_ULP_INT_RAW</name>
              <description>the raw interrupt status of etm task ulp</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLOW_CLK_TICK_INT_RAW</name>
              <description>the raw interrupt status of slow_clk_tick</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>masked interrupt register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ADDRHOLE_INT_ST</name>
              <description>the masked interrupt status of lp addrhole (for lp peri  and lp ram tee apm, and lp matrix default slave)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_INT_ST</name>
              <description>the masked interrupt status of idbus addrhole(only for lp cpu ibus and dbus)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CORE_AHB_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of lp core ahb bus timeout</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CORE_IBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of lp core  ibus timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CORE_DBUS_TIMEOUT_INT_ST</name>
              <description>the masked interrupt status of lp core  dbus timeout</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETM_TASK_ULP_INT_ST</name>
              <description>the masked interrupt status of etm task ulp</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLOW_CLK_TICK_INT_ST</name>
              <description>the masked interrupt status of slow_clk_tick</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>masked interrupt register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ADDRHOLE_INT_ENA</name>
              <description>Write 1 to enable lp addrhole int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_INT_ENA</name>
              <description>Write 1 to enable idbus addrhole int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CORE_AHB_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable lp_core_ahb_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CORE_IBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable lp_core_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CORE_DBUS_TIMEOUT_INT_ENA</name>
              <description>Write 1 to enable lp_core_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_TASK_ULP_INT_ENA</name>
              <description>Write 1 to enable etm task ulp int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOW_CLK_TICK_INT_ENA</name>
              <description>Write 1 to enable slow_clk_tick int</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>interrupt clear register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_ADDRHOLE_INT_CLR</name>
              <description>write 1 to clear lp addrhole int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IDBUS_ADDRHOLE_INT_CLR</name>
              <description>write 1 to clear idbus addrhole int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_CORE_AHB_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear lp_core_ahb_timeout int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_CORE_IBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear lp_core_ibus_timeout int</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_CORE_DBUS_TIMEOUT_INT_CLR</name>
              <description>Write 1 to clear lp_core_dbus_timeout int</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ETM_TASK_ULP_INT_CLR</name>
              <description>Write 1 to clear etm tasl ulp int</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SLOW_CLK_TICK_INT_CLR</name>
              <description>Write 1 to clear slow_clk_tick int</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MEM_AUX_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0x2070</resetValue>
          <fields>
            <field>
              <name>HP_MEM_AUX_CTRL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_MEM_AUX_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0x2070</resetValue>
          <fields>
            <field>
              <name>LP_MEM_AUX_CTRL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_ROM_AUX_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0x70</resetValue>
          <fields>
            <field>
              <name>HP_ROM_AUX_CTRL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ROM_AUX_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0x70</resetValue>
          <fields>
            <field>
              <name>LP_ROM_AUX_CTRL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CPU_DBG_PC</name>
          <description>need_des</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_CPU_DBG_PC</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_CPU_EXC_PC</name>
          <description>need_des</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_CPU_EXC_PC</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
