esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_AON_CLKRST</name>
      <description>LP_AON_CLKRST Peripheral</description>
      <groupName>LP_AON_CLKRST</groupName>
      <baseAddress>0x50111000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LP_AONCLKRST_LP_CLK_CONF</name>
          <description>need_des</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_SLOW_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_FAST_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LP_PERI_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_ANA_SEL_REF_PLL8M</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LP_CLK_PO_EN</name>
          <description>need_des</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_CLK_CORE_EFUSE_OEN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_LP_BUS_OEN</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_AON_SLOW_OEN</name>
              <description>need_des</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_AON_FAST_OEN</name>
              <description>need_des</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_SLOW_OEN</name>
              <description>need_des</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_FAST_OEN</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_FOSC_OEN</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_RC32K_OEN</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_SXTAL_OEN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CLK_SOSC_OEN</name>
              <description>1'b1: probe sosc clk on
1'b0: probe sosc clk off</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LP_CLK_EN</name>
          <description>need_des</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x8000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_LP_RTC_XTAL_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_CK_EN_LP_RAM</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_ETM_EVENT_TICK_EN</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_PLL8M_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_XTAL_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_FOSC_CLK_FORCE_ON</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LP_RST_EN</name>
          <description>need_des</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_HUK</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_ANAPERI</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_WDT</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_TIMER</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_RTC</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_MAILBOX</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_AONEFUSEREG</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_RST_EN_LP_RAM</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_RESET_CAUSE</name>
          <description>need_des</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x2000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_CAUSE</name>
              <description>6'h1: POR reset
6'h9: PMU LP PERI power down reset
6'ha: PMU LP CPU reset
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_FLAG</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_CAUSE</name>
              <description>6'h1: POR reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h7: HP system reset from HP watchdog
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset
6'h18: HP jtag reset
6'h1a: HP core lockup</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_FLAG</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_CAUSE</name>
              <description>6'h1: POR reset
6'h3: digital system software reset
6'h5: PMU HP system power down reset
6'h7: HP system reset from HP watchdog
6'h9: HP system reset from LP watchdog
6'hb: HP core reset from HP watchdog
6'hc: HP core software reset
6'hd: HP core reset from LP watchdog
6'hf: brown out reset
6'h10: LP watchdog chip reset
6'h12: super watch dog reset
6'h13: glitch reset
6'h14: efuse crc error reset
6'h16: HP usb jtag chip reset
6'h17: HP usb uart chip reset
6'h18: HP jtag reset
6'h1a: HP core lockup</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_FLAG</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_CAUSE_PMU_LP_CPU_MASK</name>
              <description>1'b0: enable lpcore pmu_lp_cpu_reset reset_cause, 1'b1: disable lpcore pmu_lp_cpu_reset reset_cause</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_CAUSE_CLR</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LPCORE_RESET_FLAG_CLR</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_CAUSE_CLR</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_RESET_FLAG_CLR</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_CAUSE_CLR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_RESET_FLAG_CLR</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPCPU_RESET_CTRL0</name>
          <description>need_des</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x80028002</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPCORE0_LOCKUP_RESET_EN</name>
              <description>write 1 to enable hpcore0 lockup reset feature, write 0 to disable hpcore0 lockup reset feature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LP_WDT_HPCORE0_RESET_LENGTH</name>
              <description>need_des</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LP_WDT_HPCORE0_RESET_EN</name>
              <description>write 1 to enable lp_wdt reset hpcore0 feature, write 0 to disable lp_wdt reset hpcore0 feature</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_STALL_WAIT</name>
              <description>need_des</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_STALL_EN</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_SW_RESET</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_OCD_HALT_ON_RESET</name>
              <description>need_des</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE0_STAT_VECTOR_SEL</name>
              <description>1'b1: boot from HP TCM ROM: 0x4FC00000
1'b0: boot from LP TCM RAM:  0x50108000</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_LOCKUP_RESET_EN</name>
              <description>write 1 to enable hpcore1 lockup reset feature, write 0 to disable hpcore1 lockup reset feature</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LP_WDT_HPCORE1_RESET_LENGTH</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_LP_WDT_HPCORE1_RESET_EN</name>
              <description>write 1 to enable lp_wdt reset hpcore1 feature, write 0 to disable lp_wdt reset hpcore1 feature</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_STALL_WAIT</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_STALL_EN</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_SW_RESET</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_OCD_HALT_ON_RESET</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_STAT_VECTOR_SEL</name>
              <description>1'b1: boot from HP TCM ROM: 0x4FC00000
1'b0: boot from LP TCM RAM:  0x50108000</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_HPCPU_RESET_CTRL1</name>
          <description>need_des</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_HPCORE0_SW_STALL_CODE</name>
              <description>HP core0 software stall when set to 8'h86</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_HPCORE1_SW_STALL_CODE</name>
              <description>HP core1 software stall when set to 8'h86</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_FOSC_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x64000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_FOSC_DFREQ</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_RC32K_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x28a</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_RC32K_DFREQ</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_SOSC_CNTL</name>
          <description>need_des</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x2b000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_SOSC_DFREQ</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_CLK_TO_HP</name>
          <description>need_des</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0xf0000000</resetValue>
          <fields>
            <field>
              <name>LP_AONCLKRST_ICG_HP_XTAL32K</name>
              <description>reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_ICG_HP_SOSC</name>
              <description>reserved</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_ICG_HP_OSC32K</name>
              <description>reserved</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_AONCLKRST_ICG_HP_FOSC</name>
              <description>reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_AONCLKRST_LPMEM_FORCE</name>
          <description>need_des</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AONCLKRST_LPMEM_CLK_FORCE_ON</name>
              <description>reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
