esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>COMB_PD_SITE1_UNIT1_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT2_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT3_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT0_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT1_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT2_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE1_UNIT3_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE1_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT0_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT1_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT2_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT3_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT0_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT1_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT2_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT3_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT0_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT1_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT2_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT3_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
