esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT0_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT1_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT2_CONF2</name>
          <description>needs desc</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MONITOR_EDG_MOD_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_OVF_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_O_VT2_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE_UPDATE</name>
          <description>needs field desc</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VALUE_UPDATE</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BYPASS_CHAIN</name>
          <description>needs field desc</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CLK_CHAIN_EN</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC0</name>
          <description>needs field desc</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE0_DELAY_NUM_VT0_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE0_DELAY_NUM_VT1_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE0_DELAY_NUM_VT2_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE0_DELAY_NUM_VT3_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC1</name>
          <description>needs field desc</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE1_DELAY_NUM_VT0_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE1_DELAY_NUM_VT1_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE1_DELAY_NUM_VT2_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE1_DELAY_NUM_VT3_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC2</name>
          <description>needs field desc</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE2_DELAY_NUM_VT0_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE2_DELAY_NUM_VT1_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE2_DELAY_NUM_VT2_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE2_DELAY_NUM_VT3_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC3</name>
          <description>needs field desc</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE3_DELAY_NUM_VT0_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE3_DELAY_NUM_VT1_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE3_DELAY_NUM_VT2_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE3_DELAY_NUM_VT3_MAX_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC4</name>
          <description>needs field desc</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE0_DELAY_NUM_VT0_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE0_DELAY_NUM_VT1_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE0_DELAY_NUM_VT2_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE0_DELAY_NUM_VT3_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC5</name>
          <description>needs field desc</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE1_DELAY_NUM_VT0_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE1_DELAY_NUM_VT1_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE1_DELAY_NUM_VT2_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE1_DELAY_NUM_VT3_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC6</name>
          <description>needs field desc</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE2_DELAY_NUM_VT0_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE2_DELAY_NUM_VT1_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE2_DELAY_NUM_VT2_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE2_DELAY_NUM_VT3_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC7</name>
          <description>needs field desc</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SITE3_DELAY_NUM_VT0_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE3_DELAY_NUM_VT1_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE3_DELAY_NUM_VT2_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SITE3_DELAY_NUM_VT3_MIN_RECORD</name>
              <description>needs field desc</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLY_NUM_REC_CLR</name>
          <description>needs field desc</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DELAY_NUM_REC_CLR</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>version register</description>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <resetValue>0x2112130</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
