esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RMT</name>
      <description>Remote Control</description>
      <groupName>RMT</groupName>
      <baseAddress>0x500d4000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xd0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RMT</name>
        <value>43</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sDATA</name>
          <description>The read and write  data register for CHANNEL%s by apb fifo access.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHDATA</name>
              <description>Read and write data for channel %s via APB FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sCONF0</name>
          <description>Channel %s configure register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x710200</resetValue>
          <fields>
            <field>
              <name>TX_START_CH0</name>
              <description>Set this bit to start sending data on CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_RD_RST_CH0</name>
              <description>Set this bit to reset read ram address for CHANNEL%s by accessing transmitter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB_MEM_RST_CH0</name>
              <description>Set this bit to reset W/R ram address for CHANNEL%s by accessing apb fifo.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_CONTI_MODE_CH0</name>
              <description>Set this bit to restart transmission  from the first data to the last data in CHANNEL%s.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_TX_WRAP_EN_CH0</name>
              <description>This is the channel %s enable bit for wraparound mode: it will resume sending at the start when the data to be sent is more than its memory size.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_OUT_LV_CH0</name>
              <description>This bit configures the level of output signal in CHANNEL%s when the latter is in IDLE state.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_OUT_EN_CH0</name>
              <description>This is the output enable-control bit for CHANNEL%s in IDLE state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_STOP_CH0</name>
              <description>Set this bit to stop the transmitter of CHANNEL%s sending data out.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV_CNT_CH0</name>
              <description>This register is used to configure the divider for clock of CHANNEL%s.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_SIZE_CH0</name>
              <description>This register is used to configure the maximum size of memory allocated to CHANNEL%s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_EFF_EN_CH0</name>
              <description>1: Add carrier modulation on the output signal only at the send data state for CHANNEL%s. 0: Add carrier modulation on the output signal at all state for CHANNEL%s. Only valid when RMT_CARRIER_EN_CH%s is 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_EN_CH0</name>
              <description>This is the carrier modulation enable-control bit for CHANNEL%s. 1: Add carrier modulation in the output signal. 0: No carrier modulation in sig_out.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_OUT_LV_CH0</name>
              <description>This bit is used to configure the position of carrier wave for CHANNEL%s.1'h0: add carrier wave on low level.1'h1: add carrier wave on high level.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFIFO_RST_CH0</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONF_UPDATE_CH0</name>
              <description>synchronization bit for CHANNEL%s</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CH%sCONF1</name>
          <description>Channel %s configure register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x1e8</resetValue>
          <fields>
            <field>
              <name>RX_EN_CH4</name>
              <description>Set this bit to enable receiver to receive data on CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_WR_RST_CH4</name>
              <description>Set this bit to reset write ram address for CHANNEL%s by accessing receiver.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB_MEM_RST_CH4</name>
              <description>Set this bit to reset W/R ram address for CHANNEL%s by accessing apb fifo.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_OWNER_CH4</name>
              <description>This register marks the ownership of CHANNEL%s's ram block.1'h1: Receiver is using the ram. 1'h0: APB bus is using the ram.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_EN_CH4</name>
              <description>This is the receive filter's enable bit for CHANNEL%s.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_THRES_CH4</name>
              <description>Ignores the input pulse when its width is smaller than this register value in APB clock periods (in receive mode).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_RX_WRAP_EN_CH4</name>
              <description>This is the channel %s enable bit for wraparound mode: it will resume receiving at the start when the data to be received is more than its memory size.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFIFO_RST_CH4</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONF_UPDATE_CH4</name>
              <description>synchronization bit for CHANNEL%s</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sSTATUS</name>
          <description>Channel %s status register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_RADDR_EX_CH0</name>
              <description>This register records the memory address offset when transmitter of CHANNEL%s is using the RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_WADDR_CH0</name>
              <description>This register records the memory address offset when writes RAM over APB bus.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE_CH0</name>
              <description>This register records the FSM status of CHANNEL%s.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_EMPTY_CH0</name>
              <description>This status bit will be set when the data to be set is more than memory size and the wraparound mode is disabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_WR_ERR_CH0</name>
              <description>This status bit will be set if the offset address out of memory size when writes via APB bus.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when transmission done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when transmission done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when transmission done.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when transmission done.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when error occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when error occurs.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when error occurs.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when error occurs.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when reception done.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL5. Triggered when reception done.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL6. Triggered when reception done.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when reception done.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when error occurs.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL5. Triggered when error occurs.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL6. Triggered when error occurs.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when error occurs.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL5. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL6. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_DMA_ACCESS_FAIL_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when dma accessing CHANNEL3 fails.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_DMA_ACCESS_FAIL_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when dma accessing CHANNEL7 fails.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
