esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
        <peripheral>
      <name>LP_ADC</name>
      <description>Low-power Analog to Digital Converter</description>
      <groupName>RTCADC</groupName>
      <baseAddress>0x50127000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_ADC</name>
        <value>9</value>
      </interrupt>
      <registers>
        <register>
          <name>READER1_CTRL</name>
          <description>Control the read operation of ADC1.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x20040002</resetValue>
          <fields>
            <field>
              <name>SAR1_CLK_DIV</name>
              <description>Clock divider.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_CLK_GATED</name>
              <description>N/A</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_SAMPLE_NUM</name>
              <description>N/A</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_DATA_INV</name>
              <description>Invert SAR ADC1 data.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_INT_EN</name>
              <description>Enable saradc1 to send out interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_EN_PAD_FORCE_ENABLE</name>
              <description>Force enable adc en_pad to analog circuit 2'b11: force enable .</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READER1_STATUS</name>
          <description>N/A</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>SAR1_READER_STATUS</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEAS1_CTRL1</name>
          <description>N/A</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FORCE_XPD_AMP</name>
              <description>N/A</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_RST_FB_FORCE</name>
              <description>N/A</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_FORCE</name>
              <description>N/A</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_GND_FORCE</name>
              <description>N/A</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEAS1_CTRL2</name>
          <description>ADC1 configuration registers.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEAS1_DATA_SAR</name>
              <description>SAR ADC1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS1_DONE_SAR</name>
              <description>SAR ADC1 conversion done indication.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS1_START_SAR</name>
              <description>SAR ADC1 controller (in RTC) starts conversion.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEAS1_START_FORCE</name>
              <description>1: SAR ADC1 controller (in RTC) is started by SW.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_EN_PAD</name>
              <description>SAR ADC1 pad enable bitmap.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_EN_PAD_FORCE</name>
              <description>1: SAR ADC1 pad enable bitmap is controlled by SW.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEAS1_MUX</name>
          <description>SAR ADC1 MUX register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SAR1_DIG_FORCE</name>
              <description>1: SAR ADC1 controlled by DIG ADC1 CTRL.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATTEN1</name>
          <description>ADC1 attenuation registers.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>SAR1_ATTEN</name>
              <description>2-bit attenuation for each pad.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMP_CTRL1</name>
          <description>N/A</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0xa000a</resetValue>
          <fields>
            <field>
              <name>SAR_AMP_WAIT1</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_WAIT2</name>
              <description>N/A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMP_CTRL2</name>
          <description>N/A</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0xa0000</resetValue>
          <fields>
            <field>
              <name>SAR1_DAC_XPD_FSM_IDLE</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SAR_AMP_FSM_IDLE</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_RST_FB_FSM_IDLE</name>
              <description>N/A</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_FSM_IDLE</name>
              <description>N/A</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_GND_FSM_IDLE</name>
              <description>N/A</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SAR_FSM_IDLE</name>
              <description>N/A</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_RSTB_FSM_IDLE</name>
              <description>N/A</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_WAIT3</name>
              <description>N/A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AMP_CTRL3</name>
          <description>N/A</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x7338f3</resetValue>
          <fields>
            <field>
              <name>SAR1_DAC_XPD_FSM</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SAR_AMP_FSM</name>
              <description>N/A</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_RST_FB_FSM</name>
              <description>N/A</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_FSM</name>
              <description>N/A</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP_SHORT_REF_GND_FSM</name>
              <description>N/A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SAR_FSM</name>
              <description>N/A</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_RSTB_FSM</name>
              <description>N/A</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READER2_CTRL</name>
          <description>Control the read operation of ADC2.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x40050002</resetValue>
          <fields>
            <field>
              <name>SAR2_CLK_DIV</name>
              <description>Clock divider.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_WAIT_ARB_CYCLE</name>
              <description>Wait arbit stable after sar_done.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_CLK_GATED</name>
              <description>N/A</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_SAMPLE_NUM</name>
              <description>N/A</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_EN_PAD_FORCE_ENABLE</name>
              <description>Force enable adc en_pad to analog circuit 2'b11: force enable .</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_DATA_INV</name>
              <description>Invert SAR ADC2 data.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_INT_EN</name>
              <description>Enable saradc2 to send out interrupt.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READER2_STATUS</name>
          <description>N/A</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SAR2_READER_STATUS</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEAS2_CTRL1</name>
          <description>ADC2 configuration registers.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x7020200</resetValue>
          <fields>
            <field>
              <name>SAR2_CNTL_STATE</name>
              <description>saradc2_cntl_fsm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR2_PWDET_CAL_EN</name>
              <description>RTC control pwdet enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_PKDET_CAL_EN</name>
              <description>RTC control pkdet enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_EN_TEST</name>
              <description>SAR2_EN_TEST.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_RSTB_FORCE</name>
              <description>N/A</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_STANDBY_WAIT</name>
              <description>N/A</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_RSTB_WAIT</name>
              <description>N/A</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_XPD_WAIT</name>
              <description>N/A</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEAS2_CTRL2</name>
          <description>ADC2 configuration registers.</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEAS2_DATA_SAR</name>
              <description>SAR ADC2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS2_DONE_SAR</name>
              <description>SAR ADC2 conversion done indication.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS2_START_SAR</name>
              <description>SAR ADC2 controller (in RTC) starts conversion.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEAS2_START_FORCE</name>
              <description>1: SAR ADC2 controller (in RTC) is started by SW.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_EN_PAD</name>
              <description>SAR ADC2 pad enable bitmap.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_EN_PAD_FORCE</name>
              <description>1: SAR ADC2 pad enable bitmap is controlled by SW.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEAS2_MUX</name>
          <description>SAR ADC2 MUX register.</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SAR2_PWDET_CCT</name>
              <description>SAR2_PWDET_CCT.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_RTC_FORCE</name>
              <description>In sleep, force to use rtc to control ADC.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATTEN2</name>
          <description>ADC1 attenuation registers.</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>SAR2_ATTEN</name>
              <description>2-bit attenuation for each pad.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_WPD_SAR</name>
          <description>In sleep, force to use rtc to control ADC</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FORCE_XPD_SAR1</name>
              <description>2'b11:software control, force on. 2'b10:software control, force off. 2'b0x:hardware control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_XPD_SAR2</name>
              <description>2'b11:software control, force on. 2'b10:software control, force off. 2'b0x:hardware control.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEAS_STATUS</name>
          <description>N/A</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SARADC_MEAS_STATUS</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_CLKEN</name>
          <description>N/A</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
