esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>COCPU_INT_RAW</name>
          <description>Interrupt raw registers.</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_SARADC1_INT_RAW</name>
              <description>ADC1 Conversion is done, int raw.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_RAW</name>
              <description>ADC2 Conversion is done, int raw.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC1_ERROR_INT_RAW</name>
              <description>An errro occurs from ADC1, int raw.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_ERROR_INT_RAW</name>
              <description>An errro occurs from ADC2, int raw.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC1_WAKE_INT_RAW</name>
              <description>A wakeup event is triggered from ADC1, int raw.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_WAKE_INT_RAW</name>
              <description>A wakeup event is triggered from ADC2, int raw.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable registers.</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_SARADC1_INT_ENA</name>
              <description>ADC1 Conversion is done, int enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ENA</name>
              <description>ADC2 Conversion is done, int enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC1_ERROR_INT_ENA</name>
              <description>An errro occurs from ADC1, int enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_ERROR_INT_ENA</name>
              <description>An errro occurs from ADC2, int enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC1_WAKE_INT_ENA</name>
              <description>A wakeup event is triggered from ADC1, int enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_WAKE_INT_ENA</name>
              <description>A wakeup event is triggered from ADC2, int enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt status registers.</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_SARADC1_INT_ST</name>
              <description>ADC1 Conversion is done, int status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ST</name>
              <description>ADC2 Conversion is done, int status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_ERROR_INT_ST</name>
              <description>An errro occurs from ADC1, int status.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_ERROR_INT_ST</name>
              <description>An errro occurs from ADC2, int status.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_WAKE_INT_ST</name>
              <description>A wakeup event is triggered from ADC1, int status.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_WAKE_INT_ST</name>
              <description>A wakeup event is triggered from ADC2, int status.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear registers.</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_SARADC1_INT_CLR</name>
              <description>ADC1 Conversion is done, int clear.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_CLR</name>
              <description>ADC2 Conversion is done, int clear.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_ERROR_INT_CLR</name>
              <description>An errro occurs from ADC1, int clear.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_ERROR_INT_CLR</name>
              <description>An errro occurs from ADC2, int clear.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_WAKE_INT_CLR</name>
              <description>A wakeup event is triggered from ADC1, int clear.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_WAKE_INT_CLR</name>
              <description>A wakeup event is triggered from ADC2, int clear.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_W1TS</name>
          <description>Interrupt enable assert registers.</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_SARADC1_INT_ENA_W1TS</name>
              <description>ADC1 Conversion is done, write 1 to assert int enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ENA_W1TS</name>
              <description>ADC2 Conversion is done, write 1 to assert int enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_ERROR_INT_ENA_W1TS</name>
              <description>An errro occurs from ADC1, write 1 to assert int enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_ERROR_INT_ENA_W1TS</name>
              <description>An errro occurs from ADC2, write 1 to assert int enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_WAKE_INT_ENA_W1TS</name>
              <description>A wakeup event is triggered from ADC1, write 1 to assert int enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_WAKE_INT_ENA_W1TS</name>
              <description>A wakeup event is triggered from ADC2, write 1 to assert int enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_W1TC</name>
          <description>Interrupt enable deassert registers.</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COCPU_SARADC1_INT_ENA_W1TC</name>
              <description>ADC1 Conversion is done, write 1 to deassert int enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ENA_W1TC</name>
              <description>ADC2 Conversion is done, write 1 to deassert int enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_ERROR_INT_ENA_W1TC</name>
              <description>An errro occurs from ADC1, write 1 to deassert int enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_ERROR_INT_ENA_W1TC</name>
              <description>An errro occurs from ADC2, write 1 to deassert int enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_WAKE_INT_ENA_W1TC</name>
              <description>A wakeup event is triggered from ADC1, write 1 to deassert int enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_WAKE_INT_ENA_W1TC</name>
              <description>A wakeup event is triggered from ADC2, write 1 to deassert int enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP1</name>
          <description>ADC1 wakeup configuration registers.</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x3ffc000</resetValue>
          <fields>
            <field>
              <name>SAR1_WAKEUP_TH_LOW</name>
              <description>Lower threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_WAKEUP_TH_HIGH</name>
              <description>Upper threshold.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_WAKEUP_OVER_UPPER_TH</name>
              <description>Indicates that this wakeup event arose from exceeding upper threshold.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR1_WAKEUP_EN</name>
              <description>Wakeup function enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_WAKEUP_MODE</name>
              <description>0:absolute value comparison mode. 1: relative value comparison mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP2</name>
          <description>ADC2 wakeup configuration registers.</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x3ffc000</resetValue>
          <fields>
            <field>
              <name>SAR2_WAKEUP_TH_LOW</name>
              <description>Lower threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_WAKEUP_TH_HIGH</name>
              <description>Upper threshold.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_WAKEUP_OVER_UPPER_TH</name>
              <description>Indicates that this wakeup event arose from exceeding upper threshold.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR2_WAKEUP_EN</name>
              <description>Wakeup function enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_WAKEUP_MODE</name>
              <description>0:absolute value comparison mode. 1: relative value comparison mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_SEL</name>
          <description>Wakeup source select register.</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SAR_WAKEUP_SEL</name>
              <description>0: ADC1. 1: ADC2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR1_HW_WAKEUP</name>
          <description>Hardware automatic sampling registers for wakeup function.</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0xc8</resetValue>
          <fields>
            <field>
              <name>ADC1_HW_READ_EN_I</name>
              <description>Enable hardware automatic sampling.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_HW_READ_RATE_I</name>
              <description>Hardware automatic sampling rate.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR2_HW_WAKEUP</name>
          <description>Hardware automatic sampling registers for wakeup function.</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0xc8</resetValue>
          <fields>
            <field>
              <name>ADC2_HW_READ_EN_I</name>
              <description>Enable hardware automatic sampling.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_HW_READ_RATE_I</name>
              <description>Hardware automatic sampling rate.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_LOW</name>
          <description>N/A</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RND_ECO_LOW</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_HIGH</name>
          <description>N/A</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RND_ECO_HIGH</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_CS</name>
          <description>N/A</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RND_ECO_EN</name>
              <description>N/A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RND_ECO_RESULT</name>
              <description>N/A</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
