esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>CLK_EDGE_SEL</name>
          <description>SDIO control register.</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <resetValue>0x820200</resetValue>
          <fields>
            <field>
              <name>CCLKIN_EDGE_DRV_SEL</name>
              <description>It's used to select the clock phase of the output signal from phase 0, phase 90, phase 180, phase 270.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLKIN_EDGE_SAM_SEL</name>
              <description>It's used to select the clock phase of the input signal from phase 0, phase 90, phase 180, phase 270.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLKIN_EDGE_SLF_SEL</name>
              <description>It's used to select the clock phase of the internal signal from phase 0, phase 90, phase 180, phase 270.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLLKIN_EDGE_H</name>
              <description>The high level of the divider clock. The value should be smaller than CCLKIN_EDGE_L.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLLKIN_EDGE_L</name>
              <description>The low level of the divider clock. The value should be larger than CCLKIN_EDGE_H.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLLKIN_EDGE_N</name>
              <description>The clock division of cclk_in.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESDIO_MODE</name>
              <description>Enable esdio mode.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESD_MODE</name>
              <description>Enable esd mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCLK_EN</name>
              <description>Sdio clock enable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULTRA_HIGH_SPEED_MODE</name>
              <description>Enable ultra high speed mode, use dll to generate clk.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAW_INTS</name>
          <description>SDIO raw ints register.</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RAW_INTS</name>
              <description>It indicates raw ints.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_CLK_CONF</name>
          <description>SDIO DLL clock control register.</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DLL_CCLK_IN_SLF_EN</name>
              <description>Clock enable of cclk_in_slf when ULTRA_HIGH_SPEED_MODE==1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CCLK_IN_DRV_EN</name>
              <description>Clock enable of cclk_in_drv when ULTRA_HIGH_SPEED_MODE==1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CCLK_IN_SAM_EN</name>
              <description>Clock enable of cclk_in_sam when ULTRA_HIGH_SPEED_MODE==1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CCLK_IN_SLF_PHASE</name>
              <description>It's used to control the phase of cclk_in_slf when ULTRA_HIGH_SPEED_MODE==1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CCLK_IN_DRV_PHASE</name>
              <description>It's used to control the phase of cclk_in_drv when ULTRA_HIGH_SPEED_MODE==1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CCLK_IN_SAM_PHASE</name>
              <description>It's used to control the phase of cclk_in_sam when ULTRA_HIGH_SPEED_MODE==1.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_CONF</name>
          <description>SDIO DLL configuration register.</description>
          <addressOffset>0x80c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DLL_CAL_STOP</name>
              <description>Set 1 to stop calibration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_CAL_END</name>
              <description>1 means calibration finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
