esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SOC_ETM</name>
      <description>Event Task Matrix</description>
      <groupName>SOC_ETM</groupName>
      <baseAddress>0x500d5000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x228</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CH_ENA_AD0</name>
          <description>Channel enable status register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_ENA0</name>
              <description>Represents ch0 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA1</name>
              <description>Represents ch1 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA2</name>
              <description>Represents ch2 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA3</name>
              <description>Represents ch3 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA4</name>
              <description>Represents ch4 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA5</name>
              <description>Represents ch5 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA6</name>
              <description>Represents ch6 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA7</name>
              <description>Represents ch7 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA8</name>
              <description>Represents ch8 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA9</name>
              <description>Represents ch9 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA10</name>
              <description>Represents ch10 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA11</name>
              <description>Represents ch11 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA12</name>
              <description>Represents ch12 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA13</name>
              <description>Represents ch13 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA14</name>
              <description>Represents ch14 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA15</name>
              <description>Represents ch15 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA16</name>
              <description>Represents ch16 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA17</name>
              <description>Represents ch17 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA18</name>
              <description>Represents ch18 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA19</name>
              <description>Represents ch19 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA20</name>
              <description>Represents ch20 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA21</name>
              <description>Represents ch21 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA22</name>
              <description>Represents ch22 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA23</name>
              <description>Represents ch23 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA24</name>
              <description>Represents ch24 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA25</name>
              <description>Represents ch25 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA26</name>
              <description>Represents ch26 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA27</name>
              <description>Represents ch27 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA28</name>
              <description>Represents ch28 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA29</name>
              <description>Represents ch29 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA30</name>
              <description>Represents ch30 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_ENA31</name>
              <description>Represents ch31 enable status.\\0: Disable\\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_ENA_AD0_SET</name>
          <description>Channel enable set register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH_SET0</name>
              <description>Configures whether or not to enable ch0.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET1</name>
              <description>Configures whether or not to enable ch1.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET2</name>
              <description>Configures whether or not to enable ch2.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET3</name>
              <description>Configures whether or not to enable ch3.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET4</name>
              <description>Configures whether or not to enable ch4.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET5</name>
              <description>Configures whether or not to enable ch5.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET6</name>
              <description>Configures whether or not to enable ch6.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET7</name>
              <description>Configures whether or not to enable ch7.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET8</name>
              <description>Configures whether or not to enable ch8.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET9</name>
              <description>Configures whether or not to enable ch9.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET10</name>
              <description>Configures whether or not to enable ch10.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET11</name>
              <description>Configures whether or not to enable ch11.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET12</name>
              <description>Configures whether or not to enable ch12.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET13</name>
              <description>Configures whether or not to enable ch13.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET14</name>
              <description>Configures whether or not to enable ch14.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET15</name>
              <description>Configures whether or not to enable ch15.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET16</name>
              <description>Configures whether or not to enable ch16.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET17</name>
              <description>Configures whether or not to enable ch17.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET18</name>
              <description>Configures whether or not to enable ch18.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET19</name>
              <description>Configures whether or not to enable ch19.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET20</name>
              <description>Configures whether or not to enable ch20.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET21</name>
              <description>Configures whether or not to enable ch21.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET22</name>
              <description>Configures whether or not to enable ch22.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET23</name>
              <description>Configures whether or not to enable ch23.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET24</name>
              <description>Configures whether or not to enable ch24.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET25</name>
              <description>Configures whether or not to enable ch25.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET26</name>
              <description>Configures whether or not to enable ch26.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET27</name>
              <description>Configures whether or not to enable ch27.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET28</name>
              <description>Configures whether or not to enable ch28.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET29</name>
              <description>Configures whether or not to enable ch29.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET30</name>
              <description>Configures whether or not to enable ch30.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_SET31</name>
              <description>Configures whether or not to enable ch31.\\0: Invalid, No effect\\1: Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
