esp-rs/esp-pacs/esp32p4/svd/esp32p4.base.svd
        <register>
          <name>SPI_MEM_DDR</name>
          <description>SPI0 flash DDR mode control register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0x3020</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_DDR_EN</name>
              <description>1: in DDR mode,  0 in SDR mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_VAR_DUMMY</name>
              <description>Set the bit to enable variable dummy cycle in spi DDR mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_DDR_RDAT_SWP</name>
              <description>Set the bit to reorder rx data of the word in spi DDR mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_DDR_WDAT_SWP</name>
              <description>Set the bit to reorder tx data of the word in spi DDR mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_DDR_CMD_DIS</name>
              <description>the bit is used to disable dual edge in command phase when DDR mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_OUTMINBYTELEN</name>
              <description>It is the minimum output data length in the panda device.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_TX_DDR_MSK_EN</name>
              <description>Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when accesses to flash.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_RX_DDR_MSK_EN</name>
              <description>Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when accesses to flash.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_USR_DDR_DQS_THD</name>
              <description>The delay number of data strobe which from memory based on SPI clock.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_DDR_DQS_LOOP</name>
              <description>1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and negative edge of SPI_DQS.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_CLK_DIFF_EN</name>
              <description>Set this bit to enable the differential SPI_CLK#.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_DQS_CA_IN</name>
              <description>Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_HYPERBUS_DUMMY_2X</name>
              <description>Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 accesses flash or SPI1 accesses flash or sram.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_CLK_DIFF_INV</name>
              <description>Set this bit to invert SPI_DIFF when accesses to flash. .</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_OCTA_RAM_ADDR</name>
              <description>Set this bit to enable octa_ram address out when accesses to flash, which means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_HYPERBUS_CA</name>
              <description>Set this bit to enable HyperRAM address out when accesses to flash, which means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_DDR</name>
          <description>SPI0 external RAM DDR mode control register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0x3020</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>1: in DDR mode,  0 in SDR mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_VAR_DUMMY</name>
              <description>Set the bit to enable variable dummy cycle in spi DDR mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDAT_SWP</name>
              <description>Set the bit to reorder rx data of the word in spi DDR mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDAT_SWP</name>
              <description>Set the bit to reorder tx data of the word in spi DDR mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_DIS</name>
              <description>the bit is used to disable dual edge in command phase when DDR mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_OUTMINBYTELEN</name>
              <description>It is the minimum output data length in the DDR psram.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_TX_DDR_MSK_EN</name>
              <description>Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when accesses to external RAM.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_RX_DDR_MSK_EN</name>
              <description>Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when accesses to external RAM.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_USR_DDR_DQS_THD</name>
              <description>The delay number of data strobe which from memory based on SPI clock.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DQS_LOOP</name>
              <description>1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and negative edge of SPI_DQS.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_CLK_DIFF_EN</name>
              <description>Set this bit to enable the differential SPI_CLK#.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DQS_CA_IN</name>
              <description>Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_HYPERBUS_DUMMY_2X</name>
              <description>Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 accesses flash or SPI1 accesses flash or sram.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_CLK_DIFF_INV</name>
              <description>Set this bit to invert SPI_DIFF when accesses to external RAM. .</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_OCTA_RAM_ADDR</name>
              <description>Set this bit to enable octa_ram address out when accesses to external RAM, which means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_HYPERBUS_CA</name>
              <description>Set this bit to enable HyperRAM address out when accesses to external RAM, which means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_DLL_DLY_DB</name>
          <description>MSPI DLL function and debug configuration register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_DLL_DB_CFG_VLD_CNT</name>
              <description>Configures the end time of the debug window.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DLL_DB_CNT_MODE_SEL</name>
              <description>[3]:1-spi_din[15:8]. 0-spi_din[7:0]. [2]:1-only shift wptr or rptr. 0-both shft wptr and rptr. [1]:1-wprt[3:0] and rptr[3:0]. 0-rptr[3:0] and wprt[3:0]. [0]:1-neg_ptr[3:0]. 0-pos_prt[3:0].</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DLL_DB_CNT_CLR</name>
              <description>Configures the start time of the debug window. 1: Clear db_vld_cnt to 0 and Get ready for debug. 0: No debug.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_DLL_DIN_DLY_SEL</name>
              <description>Configures the din channel. 1: Use  delayed data. 0: Do not use delayed data.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_DLL_DB_ST0</name>
          <description>MSPI DLL debug status0 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_DB_FIFO_CNT_H</name>
              <description>Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes during the debug window. db_fifo_cnt[63:32]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_DLL_DB_ST1</name>
          <description>MSPI DLL debug status1 register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MEM_DB_FIFO_CNT_L</name>
              <description>Debug  for DLL FIFO pointer. Use a 64bits shift register to record pointer changes during the debug window. db_fifo_cnt[31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_ATTR</name>
          <description>SPI1 flash PMS section %s attribute register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x1b</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS_RD_ATTR</name>
              <description>1: SPI1 flash PMS section %s read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_WR_ATTR</name>
              <description>1: SPI1 flash PMS section %s write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_ECC</name>
              <description>SPI1 flash PMS section %s ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section %s is configured by registers SPI_FMEM_PMS%s_ADDR_REG and SPI_FMEM_PMS%s_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 flash  non-secure PMS section %s read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 flash non-secure PMS section %s write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS_NONSECURE_ECC</name>
              <description>SPI1 flash non-secure PMS section %s ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section %s is configured by registers SPI_FMEM_PMS%s_ADDR_REG and SPI_FMEM_PMS%s_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_ADDR</name>
          <description>SPI1 flash PMS section %s start address register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>S</name>
              <description>SPI1 flash PMS section %s start address value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_SIZE</name>
          <description>SPI1 flash PMS section %s start address register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0x1000</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS_SIZE</name>
              <description>SPI1 flash PMS section %s address region is (SPI_FMEM_PMS%s_ADDR_S, SPI_FMEM_PMS%s_ADDR_S + SPI_FMEM_PMS%s_SIZE)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_PMS0_ATTR</name>
          <description>SPI1 flash PMS section $n start address register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x1b</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS0_RD_ATTR</name>
              <description>1: SPI1 external RAM PMS section 0 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_WR_ATTR</name>
              <description>1: SPI1 external RAM PMS section 0 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_ECC</name>
              <description>SPI1 external RAM PMS section 0 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 0 is configured by registers SPI_SMEM_PMS0_ADDR_REG and SPI_SMEM_PMS0_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 0 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 0 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_NONSECURE_ECC</name>
              <description>SPI1 external RAM non-secure PMS section 0 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 0 is configured by registers SPI_SMEM_PMS0_ADDR_REG and SPI_SMEM_PMS0_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_PMS1_ATTR</name>
          <description>SPI1 external RAM PMS section $n attribute register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0x1b</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS1_RD_ATTR</name>
              <description>1: SPI1 external RAM PMS section 1 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_WR_ATTR</name>
              <description>1: SPI1 external RAM PMS section 1 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_ECC</name>
              <description>SPI1 external RAM PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 1 is configured by registers SPI_SMEM_PMS1_ADDR_REG and SPI_SMEM_PMS1_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 1 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 1 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_NONSECURE_ECC</name>
              <description>SPI1 external RAM non-secure PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 1 is configured by registers SPI_SMEM_PMS1_ADDR_REG and SPI_SMEM_PMS1_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
